[{"comment_id": "durvmuh", "post_id": "7zrqqv", "comment": "This is fascinating!\nLet's see...\n\nMedium: e-reader (tablet, kindle app)\n\nPros: ❇️ I legit have 2000+ books on the app, bc I get almost all of them FREE. ❇️ I can carry my slim tablet around and have an enormous variety of reading material without a lot of weight ❇️ so much more comfortable to read with this in bed at night than having too use a bright lamp to read a book\n\nCons: ❇️ hard to read in daylight, like riding in a car ❇️ have to keep up with a charger so it doesn't die"}, {"comment_id": "ds20cz7", "post_id": "7l66n3", "comment": "That's awesome. "}, {"comment_id": "dwhtc7d", "post_id": "7l66n3", "comment": "I am trying to get ebook copies of the Fearless series to read while I am at work but I am having no luck! :-o( "}, {"comment_id": "ds3jbx0", "post_id": "7iryxs", "comment": "The trifle one is from a collection called ‘My Naughty Little Sister,’ and the lost stuffed dog one is called ‘Dogger’ (it was my favourite when I was younger!!) Not sure about the others, sorry! Hope you manage to find what you’re looking for! (a couple of older children war books that spring to mind are ‘Goodnight Mr Tom’ and ‘The Peppermint Pig,’ - maybe a good place to start looking for those!) x"}, {"comment_id": "do9xsvh", "post_id": "75ylxn", "comment": "The book was written by David Stout. Well worth the read!"}, {"comment_id": "f0vg1a9", "post_id": "d6trpy", "comment": "On Laurie Sander's blog today hear and see about The Great Sacandaga Lake where my, Dream Catcher story takes place. Enter for a chance to win a beautiful bracelet."}, {"comment_id": "drcptl1", "post_id": "7jf2vb", "comment": "Any particular ideas how?"}, {"comment_id": "dqgf2g3", "post_id": "7g4jld", "comment": "The Forbidden Fruit as The Reproductive Egg.  The Bible suggests The Garden of Eden as an Underwater Tidal Pool Garden. The Tree of Life, as the Biological Structure that provided the Male Reproductive Cell, and The Tree of Knowledge as The Biological Structure that provided the Female Reproductive Cell. This would \nexplain how \"eating a fruit\" would cause \"pain in childbirth.\""}, {"comment_id": "dpuqe0b", "post_id": "7d3qef", "comment": "Our mission is to fetch success for students by providing them with the optimum quality services."}, {"comment_id": "dnqtxod", "post_id": "73js2p", "comment": "A review on The Glass Castle Written by Jeannette Walls. Have you read it ? Did you enjoy ?"}]