[{"comment_id": "dg4u36a", "post_id": "64r4de", "comment": "I read this in January and had the same experience. Absolutely couldn't put it down. Enjoy it!"}, {"comment_id": "dg4x1tf", "post_id": "64r4de", "comment": "I own it but havnt read it yet. I look forward to reading it!"}, {"comment_id": "dh7wam5", "post_id": "64r4de", "comment": "I absolutely love this book! I read it last year and I could not put it down! "}, {"comment_id": "djd0uw3", "post_id": "64r4de", "comment": "I was surprised by how much I enjoyed this book, I really fell in love with the two main characters and their journeys.  WWII is a favorite time period of mine to read about, but sometimes it can get a little repetitive, Doerr really wove together a fresh and amazing story."}, {"comment_id": "dg53qpc", "post_id": "64r4de", "comment": "I love his writing. You may enjoy his short stories as well. \"The Shell Collector\" was my favorite of the short story collections."}, {"comment_id": "dlw48n4", "post_id": "6uwejv", "comment": "I'm so jealous.  I wish I could read it all again for the first time.  Enjoy the journey! "}, {"comment_id": "dlxmlay", "post_id": "6uwejv", "comment": "I need to do this. I only read the first 3 as a kid and I want to re-start and go from beginning to end."}, {"comment_id": "dmed5ep", "post_id": "6uwejv", "comment": "Never too late. At least you don't have to wait for any new books to come out."}, {"comment_id": "dlw8esp", "post_id": "6uwejv", "comment": "That's awesome! I still remember my first time reading Harry Potter, and waiting anxiously for the next book to come out. \n\nWhat I want to know is whether you know all the big spoilers or not? "}, {"comment_id": "docznl5", "post_id": "6uwejv", "comment": "Honestly, The Goblet of Fire is my favorite one :) Enjoy!!"}, {"comment_id": "ekjxjhj", "post_id": "bbiz6y", "comment": "I read it once ever year or two. Hands down my favorite book"}, {"comment_id": "ekjzm9t", "post_id": "bbiz6y", "comment": "I just listened to this as an audiobook last month for the first time and I loved it!! I'm super excited for the show to come out."}, {"comment_id": "ekljl00", "post_id": "bbiz6y", "comment": "I'm currently reading this too! I love it so much!"}, {"comment_id": "cibfkrg", "post_id": "28j5de", "comment": "You're on a roller coaster that only goes up my friend."}, {"comment_id": "cibjo96", "post_id": "28j5de", "comment": "If you thoroughly enjoy the book I would recommend you read the entire series. It is a delightful, insightful, and comical work of fiction which will take you to the farthest depths of the galaxy and back. "}, {"comment_id": "cjf788r", "post_id": "28j5de", "comment": "IMHO it keeps getting better and better for the first 3 books, so keep it up :D\n\nThe 4th is... different. It is not bad, just very different. The 5th is similar to the first ones, but is not my favorite. I would still recommend the whole series.\n\nWhere are you in the book right now?"}, {"comment_id": "c9efy41", "post_id": "1c9txm", "comment": "by far my favorite author!"}, {"comment_id": "c9ek91w", "post_id": "1c9txm", "comment": "Fantastic book!"}, {"comment_id": "c9emyjy", "post_id": "1c9txm", "comment": "Really nice read"}, {"comment_id": "c9o4gls", "post_id": "1c9txm", "comment": "Would this be a good starter book for someone who hadn't yet read anything by Gaiman? I suspect I'd like him a lot, but not sure what to grab for my Kindle."}, {"comment_id": "cb1d1v4", "post_id": "1c9txm", "comment": "I finished this before starting my most recent. I love Gaiman--my favorite so far is the Graveyard Book, followed by Good Omens (co written with Terry Pratchett). "}, {"comment_id": "cc014t3", "post_id": "1c9txm", "comment": "WOW!  This was an amazing book.  I was teaching a class on mythology, and I made this an optional, EC read.  Fantastic narrative, brilliant creation of the \"gods,\" charismatic characters, and a dynamite ending.  A++.\n\nI have all of his works, but this was definitely one of the top two."}, {"comment_id": "ddnd7vp", "post_id": "5tjy01", "comment": "This is one of my favorite novels! I love the book because it provides so much intricate detail to everything. Although Malcolm annoys me with his long rants after a while, they're still masterful. Highly recommend the second book as well. "}, {"comment_id": "ddn3pm9", "post_id": "5tjy01", "comment": "I have and also really enjoyed it much better than the movie( though I do really like the movie). I would highly recommend you also read the second book lost world if you enjoyed Jurassic park :)"}, {"comment_id": "dec64y5", "post_id": "5tjy01", "comment": "I absolutely loved it, not having had high expectations when I started it. So much better than the movie -- although the movie was actually pretty good."}, {"comment_id": "c84odol", "post_id": "17dfl6", "comment": "I just finished the book...wow! It was so fantastic!  So many people refuse to read ASOIAF because it's so long, drawn out, boring, confusing, etc. While at times I sympathize with these people, I am so glad that I chose to continue with the series. A Storm of Swords is easily one of the best books I've ever read."}, {"comment_id": "c56ksuw", "post_id": "vommt", "comment": "I avoided Vonnegut for so many years, as I was afraid it wouldn't live up to everything I hoped it would be... \n\nDear gosh though, Slaughterhouse 5 is brilliant. I read it in a day, straight after reading Forever War by halderman, could not recommended either book too highly... \n"}, {"comment_id": "c57dsi5", "post_id": "vommt", "comment": "Slaughterhouse Five is absolutely brilliant. I was forced into reading it in a high school class and fell in love with Vonnegut from that point.\nJust finished up reading Sirens of Titan not too long ago. I can't say I've ever read a Vonnegut book I haven't liked."}, {"comment_id": "c56fk32", "post_id": "vommt", "comment": "i thought this was a video game. \n\nis it a history book, or a work of fiction? "}, {"comment_id": "c56xgrx", "post_id": "vommt", "comment": "I'm hoping to read this after Cats Cradle. Hope it lives up to my expectations. "}, {"comment_id": "c571fzm", "post_id": "vommt", "comment": "I haven't read this yet, it's going to be one of my holiday reads in a couple of weeks. \n\nI have only read \"Welcome to The Monkey House\" - Short stories by VG, can honestly say I've never been as taken and addicted by a short story collection since the first time I read Kiss Kiss by Roald Dahl when I secretly read my Dad's copy as a 10 year old after being told it would scare the crap out of me! \n\nSo exited about reading Slaughterhouse Five, his visions are so brick-shittingly plausible (with my slightly melodromatic, pessimistic \"what if\" paranoid) thoughts about the future,he just grabs you by the imagination and manages to plant deliciously jaw clenching no hope disaster scenarios! "}, {"comment_id": "eipk348", "post_id": "b1xe3q", "comment": "Yo I read this book years ago and I still think about it all the time. Such a beautiful snapshot of someone else’s mind. "}, {"comment_id": "ex4sktb", "post_id": "b1xe3q", "comment": "I loved this book."}, {"comment_id": "dzznftn", "post_id": "8nyc9w", "comment": "I reread them earlier this year. It’s been a few years since I did a reread, and it was enjoyable!"}, {"comment_id": "e0gj674", "post_id": "8nyc9w", "comment": "I read them when I was 11, then re-read them when I was 17, now I'm 21 and I think I'll reread at 23 maybe.\n\nWhat's your favourite book from the series?"}, {"comment_id": "e2dgbio", "post_id": "8nyc9w", "comment": "I was actually just thinking about rereading the series too. I’ve been wanting to jump back in the magic"}, {"comment_id": "e3651cf", "post_id": "8nyc9w", "comment": "I read it when it came out. Now I am reading the series again at 29yo :) and I’m enjoying it. Currently in The Prisoner of Azkaban."}, {"comment_id": "d58rahe", "post_id": "4s9aww", "comment": "it's a great book very dark and mysterious.  one of my top 3"}, {"comment_id": "d5alpsp", "post_id": "4s9aww", "comment": "I'd love to hear a Heinlein/Gaiman comparison...SF sure has changed a lot over the last 50 years!"}, {"comment_id": "d5ywubv", "post_id": "4s9aww", "comment": "This is on my to-read list.. I'm just about done with my current book. Hum. Maybe this should be my next book. This or Lord of the Flies. I'm torn!"}, {"comment_id": "d5zqrlk", "post_id": "4s9aww", "comment": "Went with Lord of the Flies. It's a short read and I e had it on the brain a lot lately. But AG might be my next read!"}, {"comment_id": "d61vvlo", "post_id": "4s9aww", "comment": "It's called How To Live Safely In A Science Fictional Universe. I'm done with it (it was slow at work). So I might pick up AG now. Is it still good?"}, {"comment_id": "d59bzts", "post_id": "4s9aww", "comment": "I feel like this is the only book that's ever posted on here..."}, {"comment_id": "citz80v", "post_id": "2ab29m", "comment": "Now there's a book that will stick with you. While not totally accurate, the movie is definitely worth watching."}, {"comment_id": "civexcx", "post_id": "2ab29m", "comment": "I haven't heard of this book. Is it worth the read?\n\nMay I have a-not-so-brief summary? Spoilers are welcome if you feel the need to add them. Always up for reading new books :)."}, {"comment_id": "cjzkfvj", "post_id": "2ab29m", "comment": "I read the entire series. It's fantastic. "}, {"comment_id": "c9rdri4", "post_id": "1dl0oe", "comment": "Great book - glad you are enjoying it!"}, {"comment_id": "c9red85", "post_id": "1dl0oe", "comment": "My absolute favorite Stephen King book.  I need to read it again soon.  "}, {"comment_id": "c9rgjav", "post_id": "1dl0oe", "comment": "Which version? I read the expanded edition that included the cuts made to the originally published version and love the extra little details. "}, {"comment_id": "c9rs6y1", "post_id": "1dl0oe", "comment": "One of my favorite books of all time. I couldn't put it down and read it in a week. Glad your enjoying it! "}, {"comment_id": "ca2p94c", "post_id": "1dl0oe", "comment": "Such an amazing book! loveloveloveloved it! I would also suggest The Passage by Justin Cronin; I read these two around the same time and was absolutely addicted to both. Mind bending."}, {"comment_id": "c9hlug1", "post_id": "1ckw0y", "comment": "I read the book and so far have not been able to sit through the movie. Anyway my favorite Chrichton book is \"Sphere\" but my first was Jurassic Park."}, {"comment_id": "c9hqodd", "post_id": "1ckw0y", "comment": "The book is great.  Michael has always done a great job at doing is research on the technology in his books while writing them.  I would suggest reading the Lost World first before going to see the movies, as there are definitely a lot of differences between them...but both the books and movies are enjoyable.  There's a lot of stuff in the books that was left out in the movies which would have been neat to see on the big screen.\n\nIf you ever get a chance to read any more of Crichton's works \"Prey\" and \"Timeline\" are also amazing."}, {"comment_id": "c52u1e2", "post_id": "var2u", "comment": "this books if freaken awesome. \n\nyou will love it. i wish i could re-read it for the first time again man\n\n\n\n\n"}, {"comment_id": "c52vatx", "post_id": "var2u", "comment": "I love Pratchett's work, but I'm nowhere near completing the run of Discworld books. I'm kind of saving them, if that makes sense. Hopefully his sword made of meteoric iron will help extend his life, but I don't know how many more books he's got in him."}, {"comment_id": "c5315km", "post_id": "var2u", "comment": "Fantastic book, but definitely not my favourite about Vimes/The Watch."}, {"comment_id": "c57ret0", "post_id": "var2u", "comment": "That was the book that introduced me to Terry Pratchett's work and still probably my favorite."}, {"comment_id": "c5gp1xw", "post_id": "var2u", "comment": "I love Discworld!  The Night Watch are my favorite subseries, for sure.  They just keep getting better!  Vimes is one of my heroes."}, {"comment_id": "c518hqp", "post_id": "ukcdx", "comment": "This is going to be massive?!... was planning a book group in my area, but this is more inspiring.\n\nTo hear (hopefully,) the context and tone different people interpret various books is so awesome as a relentless reader who regularly makes the mistake of picking a fucking shite read... it's going to be great to hear I'm being a dick from day one. \n\nThanks StarlightxUK...have some love and serious literary prowess ;)"}, {"comment_id": "etueocf", "post_id": "cdge51", "comment": "I recently finished the book, and she is by far one of my favorite characters. Yes, she is whiny and spoiled and terrible in just about every way. And you are suppose to hate her just a bit. But you’ll come to find that most everything she does, she does with purpose and somehow for the greater good. Stick with it. It’s an amazingly beautiful book."}, {"comment_id": "ewe57gv", "post_id": "cdge51", "comment": "Late to the party here, hi OP. How's the read going now? Personally I just saw the movie for the first time last night (not sure if I am compelled to read the book yet or not; I understand there's more depth to the story, but...I have a huge backlog of books in preferred genres to get to first)\n\nThey didn't include her first or (second?) child in the movie, but yes I found the character very self-absorbed and manipulative of others throughout, and especially at the beginning. However, it is true that after the scenes you are talking about she goes through some very harrowing experiences and seems to develop a lot of interesting depth as a character, even though she remains far from perfect. She has others depending on her and vows to protect her home and others in her care by working hard and doing absolutely whatever it takes, despite a great deal of judgement and condemnation for most of how she chooses to do so. She sacrifices a lot of her own happiness to achieve practical ends for herself and her homestead.\n\nIt's a four hour movie but she remains very delusional about Ashley and mostly quite unhappy throughout, but everything she does is for a clearly rational (if completely self-interested) reason. She's at best very misguided, at worst mentally ill. But not irredeemable.\n\nShe does reach a sort of final cathartic revelation by the end of the story which I found myself thinking I wished she'd reached much, much earlier. But there's something very ... depressingly realistic... about it, and poignant. In spite of the fact that 90% of her problems seem to be self inflicted and she's quite a piece of work, I couldn't help but have a fairly strong sympathy for her and feel very moved by her failed pursuit of happiness. She's obviously a very seriously  flawed person, but also probably a pretty 'real' and interesting person. I don't admire the character but I feel like she's understandable and sort of sympathetic in spite of her many faults, which is a rare but commendable thing in a character study.\n\nI can see why it's a famous story and it actually came across to me a little surprising and refreshing just how flawed Scarlett is. I was expecting a sappy romantic epic with a airheaded but pure damsel in distress. It isn't that at all. . It wasn't quite a typical romance or drama or tragedy, but somewhere in between all three, and the ending and overall tone were very impactful."}, {"comment_id": "emeiki0", "post_id": "bk7bhp", "comment": "I don’t read a lot of general fiction, but that one tore my heart up! It was definitely a good read."}, {"comment_id": "ely7xxc", "post_id": "bi28ne", "comment": "Oh wow! I googled the book after seeing your post and I’m sold! I’m currently reading the Maddaddam series by Margaret Atwood and it’s dystopian themed. I just found Wool on eBay and purchased it. Thank you kind stranger :)"}, {"comment_id": "elynn6l", "post_id": "bi28ne", "comment": "And Hugh is a decent human. When first on Amazon, the first book was free, and since I live in Mexico, I couldn't get it. Wrote to him on his blog page, and he gifted me the entire series"}, {"comment_id": "epv8lmz", "post_id": "bi28ne", "comment": "[deleted]"}, {"comment_id": "ed41ggz", "post_id": "abxk74", "comment": "Nice, good luck. I gave myself that goal a few years ago, and have been increasing it every year since. "}, {"comment_id": "ed470ws", "post_id": "abxk74", "comment": "The audiobook of Norse Mythology was one of my favourite reads from a couple of years ago. Good luck with the challenge, hope you enjoy it. "}, {"comment_id": "ed4a6ec", "post_id": "abxk74", "comment": "Great book, one of my favourites last year!"}, {"comment_id": "ed4hxok", "post_id": "abxk74", "comment": "I'm reading Good Omens by him now"}, {"comment_id": "ef8fub7", "post_id": "abxk74", "comment": "Nice, just finished the audiobook of this but I think it'd be much better to actually physically read a book like this"}, {"comment_id": "dglx67g", "post_id": "66w9kf", "comment": "I really liked the premise of this book and appreciate it for what it is. It is my no means one of the most technically or thematically advanced stories of all time but it is enjoyable and does have its fair share of 'wow' moments. The main characters are also relatable and I recommend it to anyone after a funzinteresting read.\n\nEnjoy the coming surprises :) "}, {"comment_id": "dgmlye9", "post_id": "66w9kf", "comment": "I devoured this book. The style and worldbuilding are some of the most unique I've ever read, and I was hooked from the first page. There is a sense of mystery about the Circus and its characters that is never truly explained or revealed, and that to me is what made the book special. I would love to visit the Night Circus. "}, {"comment_id": "digbhsz", "post_id": "66w9kf", "comment": "I tried this book twice, four years apart, and both times I abandoned it. It didn't really capture me at all, with the exception of the first forty or fifty pages."}, {"comment_id": "decbzhc", "post_id": "5wmljf", "comment": "I love this book, but absolutely despise what being a high school standard has done to public perception of it. I find it a much more interesting and fulfilling read through the lens of it as a meditation upon learning to love the nuance of life, art, and literature, set to the backdrop of a failing state than a story about the horrors of a police state or something."}, {"comment_id": "decml8j", "post_id": "5wmljf", "comment": "I'm finally reading this one too! I really like it so far. "}, {"comment_id": "dg4bhfh", "post_id": "5wmljf", "comment": "I'm the same as you.  Never read it in HS and now it's sitting on my shelf waiting for me ..... I'll put it in the queue for next !"}, {"comment_id": "d9dfah6", "post_id": "58uj45", "comment": "I've read this at least 3 times, and it gets better every time"}, {"comment_id": "d9kgze5", "post_id": "58uj45", "comment": "Where are you now? I finished it a couple of months ago. It was a weird experience. Definitely a good book and an interesting story, but at the same times just weird. Can't say is my favorite, but won't say it's anything but good."}, {"comment_id": "d33msad", "post_id": "3v2y4c", "comment": "Rhett is so great and Scarlett you just love to hate. "}, {"comment_id": "c8kxk9c", "post_id": "18i42p", "comment": "Love this book. It lead me to Oryx and Crake by Margaret Atwood. Would seriously suggest that as well. \n"}, {"comment_id": "c8fceht", "post_id": "18i42p", "comment": "That's next in my read list. I've put it off as I've thought it was a 'hard read'. How are you finding it? "}, {"comment_id": "c8jmik5", "post_id": "18i42p", "comment": "Read this last year. Great book. Enjoy."}, {"comment_id": "c794iq3", "post_id": "140k8z", "comment": "Enjoy it, friend. You're in for a treat."}, {"comment_id": "c79enhy", "post_id": "140k8z", "comment": "Excellent series"}, {"comment_id": "c7973ck", "post_id": "140k8z", "comment": "Hands down my favorite of the series."}, {"comment_id": "c7o2drj", "post_id": "140k8z", "comment": "http://www.reddit.com/r/AskReddit/comments/15nkvy/does_anyone_else_want_part_2_to_the_golden/ - petition to get it to the box office.\n"}, {"comment_id": "c5lys5g", "post_id": "xfrsn", "comment": "If you end up loving it you might want to try some more Heinlein. Frank Herbert's *Dune* is an excellent book too, and while on the surface it may seem nothing like *Stranger in a Strange Land* it does have some similar themes and is also considered a classic from the period."}, {"comment_id": "c5h415p", "post_id": "wwqyr", "comment": ">President Snow\n\nThat bastard!"}, {"comment_id": "c59t6b7", "post_id": "w1fc7", "comment": "I am 150 pages in. I have never not enjoyed reading quite like I don't enjoy IJ. I am determined to make it to 200 before I stop but it is almost physically painful to read."}, {"comment_id": "c4xj7dk", "post_id": "upggl", "comment": "This is the only one of his books that I've read and I liked it quite a bit.  I have been contemplating reading another one after I finish my current book.  So far I've had both The Martian Chronicles and Something Wicked This Way Comes recommended, so I still have yet to make a decision.  "}, {"comment_id": "c4xm2x1", "post_id": "upggl", "comment": "How do people rate 'The illustrated man' have searched through my dad's extensive sci-fi collection for some Ray Bradbury and this is the one I've found. A good starting point? "}, {"comment_id": "f0qe86a", "post_id": "d65t6k", "comment": "I really struggled to enjoy it because Victor is such an unlikeable dick."}, {"comment_id": "f0qr13j", "post_id": "d65t6k", "comment": "Read it in high school, and really enjoyed it. Read it again in college, and the professor drained all the pleasure from it. Read it for fun a while back and loved it again. Give Dracula a try as well, if you have a chance."}, {"comment_id": "f0r00dp", "post_id": "d65t6k", "comment": "I agree that Victor is dreadful, but this novel is still one of my favorites. Frankenstein's monster is a monster - by birth and through his actions. But the reader sees the complexity of the situation, the factors that drove his horrendous actions, and can empathize with him despite his actions. To me, it was a testimony to the complexity of human emotion and behavior, and a lesson in compassion and empathy in the face of behavior that I disagreed with or was negatively affected by."}, {"comment_id": "f0vpph3", "post_id": "d65t6k", "comment": "That feels like cheating."}, {"comment_id": "ex4i54r", "post_id": "cg9l5j", "comment": "I haven't read it since high school. I need to again. It was amazing!"}, {"comment_id": "etig95s", "post_id": "bukec6", "comment": "There was a good movie version with Valerie Perrine"}, {"comment_id": "drpt7kx", "post_id": "7lssy5", "comment": "I've always wanted to read it since I noticed Julia Stiles reading it in 10 Things I Hate About You"}, {"comment_id": "dn23udx", "post_id": "70c2vn", "comment": "So it goes."}, {"comment_id": "dnn7eak", "post_id": "70c2vn", "comment": "One of my all time favorites.  "}, {"comment_id": "dpjx7sr", "post_id": "70c2vn", "comment": "Love this."}, {"comment_id": "dgkcb0e", "post_id": "66lcfb", "comment": "I love this book! I want to reread it again soon. I also didn't read it as a teen. I don't know if I would have appreciated it as much as a teen anyway."}, {"comment_id": "dgmfvju", "post_id": "66lcfb", "comment": "Shame on your middle school teachers. This is my favorite book to teach and use to get even the most reluctant readers into. I love how it is still relevant soooooo many years after it was published. How is it going so far?"}, {"comment_id": "civcy2v", "post_id": "2ahy7y", "comment": "I too read it twice, the first time the language really challenged me, the second time I just pushed through it and focused on the story and was able to enjoy it. "}, {"comment_id": "cj1ky98", "post_id": "2ahy7y", "comment": "I haven't read it in years, but A Clockwork Orange is one of my favorite novels. \n\nOne thing I always tell people who want to read this book: if there's a glossary for the slang, don't use it! Push through the first couple chapters until you've got it straight. More often than not the context clues will be enough to infer meaning, and eventually the seemingly non-sense words will become an extension of your vocabulary. It is also much more immersive than flipping back and forth through pages to figure out what words mean.\n\nI also definitely wouldn't recommend watching the film until after you've read it. Kubrick (and the first few US pressings of the novel, for that matter) doesn't address the final Chapter of the novel, which is really the kicker that drives the whole over-arching themes of redemption/improvement/self home. The film leaves the resolution off for shock value (as per with Kubrick), which not only deviates so far from the message Burgess was trying to convey, but is also just underwhelming in my opinion."}, {"comment_id": "cmh7mx6", "post_id": "2ahy7y", "comment": "this is one of my favorite books. i think everyone should read it! very important and the book is much more poignant than the movie in my opinion. do you have the version with the letter from Anthony Burgess at the beginning? It explains some things and it was just cool to read before starting the book"}, {"comment_id": "c7w3vpw", "post_id": "16fjac", "comment": "It's been a while since I read the series but I don't remember that particular question ever being addressed.  It's also not addressed why the Golden Monkey can be physically distant from Marisa whereas most daemons cannot stand to be physically apart, save for shaman and witches."}, {"comment_id": "c7t00i4", "post_id": "165enp", "comment": "The Fountainhead "}, {"comment_id": "c7syq5b", "post_id": "165enp", "comment": "I just finished reading *The Lord of the Rings* and now I'm totally switching gears by reading Bukowski's *Ham On Rye*. I loved LotR but the change of pace and style is such a breath of fresh air - it's awesome."}, {"comment_id": "c7syz4t", "post_id": "165enp", "comment": "Just finished flatland.  I was pretty turned off by the way women are portrayed in it even though its supposed to be a commentary of Victorian life. The first half of the book was not quite so interesting, but once I got past stuff like that it was pretty good. Educational and entertaining."}, {"comment_id": "c7t0tq7", "post_id": "165enp", "comment": "Damned by Chuck Palanhiuk\n\nOnly a few pages in... Feels different than lots of his other stuff - but he's good at varying things up."}, {"comment_id": "c7t222k", "post_id": "165enp", "comment": "The Gunslinger, 1st book in Stephen King's Dark Tower series, and The Shipping News by Annie Proulx, which I don't really like very much but feel like I should finish anyway."}, {"comment_id": "c7tb84r", "post_id": "165enp", "comment": "I'm not normally a reader of fantasy, but after watching both seasons of Game of Thrones, I decided to give the books a shot.  I'm currently reading the 1st book in that series, and so far it's pretty good.  Next I'll be getting back to historical fiction by reading *When Christ and His Saints Slept*, by Sharon Kay Penman."}, {"comment_id": "c7tg2wy", "post_id": "165enp", "comment": "Heart of Darkness by Joseph Conrad.  Not too bad but could definitely use a few more page breaks. It's like one long paragraph \n"}, {"comment_id": "c7tgxpl", "post_id": "165enp", "comment": "Deadlocked by Charlaine Harris, not as good a the others though"}, {"comment_id": "c7u0oe0", "post_id": "165enp", "comment": "Jarret Diamond just came out with a new book. I'm a bit excited. "}, {"comment_id": "c7wftpt", "post_id": "165enp", "comment": "The Day The World Came To Town: 9/11 In Gander, Newfoundland by William Morrow. It's really interesting. I love it, which is surprising because I'm more of a fantasy reader and normally don't find myself reading anything about modem history. "}, {"comment_id": "c5ligf9", "post_id": "xdb9d", "comment": "[deleted]"}, {"comment_id": "c5lufo1", "post_id": "xdb9d", "comment": "I will tell you now, the first one is slow, but this is hands down my favorite series of books that I have ever read. Good choice! "}, {"comment_id": "c5ljzqs", "post_id": "xdb9d", "comment": "I strongly recommend the revised version over the original. "}, {"comment_id": "c5lqv4p", "post_id": "xdb9d", "comment": "The series gets much better. I just started retreading it and decided to skip this book. The next three are amazing!"}, {"comment_id": "c57i40d", "post_id": "vtex5", "comment": "I read it when it was coming out in tiny installments, thin paperbacks. Awesome story. "}, {"comment_id": "c57nhkc", "post_id": "vtex5", "comment": "There were multiple parts of the book that made me cry like a brokenhearted schoolchild, as well as parts that made me want to punch walls.  I mean that in the best possible way.  "}, {"comment_id": "f0yt3s7", "post_id": "d75n84", "comment": "I’m just finishing The Colour of Magic. I’m enjoying the book, looking forward to reading the whole series. I’ve already purchased the second book, The Light Fantastic, too! Why did people recommend starting on book 8 to you?"}, {"comment_id": "f0ytq7l", "post_id": "d75n84", "comment": "I hear it's the best"}, {"comment_id": "f118aqx", "post_id": "d75n84", "comment": "Just read color of magic.  Enjoyed it, but decided.to tackle the rest of my reading pile before adding all the discworld books to said pile.\n\nWhat do you think of it so far?"}, {"comment_id": "ex6vxut", "post_id": "cqzecr", "comment": " Not my favorite book by him, but you should read it just so you can understand what Grok means. And then slip it into everyday conversation."}, {"comment_id": "eykd8sp", "post_id": "cqzecr", "comment": "It’s one of my favorite books. Changed my life and outlook. How are you enjoying it?"}, {"comment_id": "ex8s9o7", "post_id": "cqzecr", "comment": "/r/heinlein"}, {"comment_id": "exkpsl5", "post_id": "cqzecr", "comment": "I tried it years ago, but returned it to the library. I keep saying I am going to go back and finish it, but I haven't yet."}, {"comment_id": "eymhlyr", "post_id": "cqzecr", "comment": "I have read it several times over the years along with all of his other works.. he is still my all time favorite author.. the uncut original is the best version to read .."}, {"comment_id": "ezjxdyr", "post_id": "cqzecr", "comment": "Definitely one of my favorite books!"}, {"comment_id": "eqraf4e", "post_id": "bz3pqb", "comment": "Absolutely loved this book!"}, {"comment_id": "epyiv11", "post_id": "bw8p0e", "comment": "Me too! It's so big though I can't take it to work with me 😟"}, {"comment_id": "encuyzp", "post_id": "bo2npq", "comment": "Small world! I'm also reading that, I'm still trying to wrap my head around the very flowery prose, but it's certainly engaging."}, {"comment_id": "ene2l4l", "post_id": "bo2npq", "comment": "I wanted to fall in love with this book, but it wasnt what I expected. Good book, but as much horror as I was expecting"}, {"comment_id": "eq1dbfv", "post_id": "bo2npq", "comment": "One of my good friends is Oscar Wilde obsessed and would not leave me alone till I read it.. definitely worth the hype imo"}, {"comment_id": "e7kd06d", "post_id": "9n85uu", "comment": "Currently reading as well!"}, {"comment_id": "ea98wu8", "post_id": "9n85uu", "comment": "Me too. I love it!"}, {"comment_id": "eetf09z", "post_id": "9n85uu", "comment": "Holy crap, it was so good!"}, {"comment_id": "eh0hern", "post_id": "9n85uu", "comment": "Loved it. Especially the part about the soldier (I'm bad with names!). "}, {"comment_id": "doa152x", "post_id": "724svu", "comment": "I am starting this book now :)"}, {"comment_id": "dp4pn7z", "post_id": "724svu", "comment": "I love that book. So far it's my favourite Stephen King book! What did you think? "}, {"comment_id": "dhqteui", "post_id": "6bu702", "comment": "I love the Bachman books! I hope you enjoy The Long Walk, do up your laces!"}, {"comment_id": "dhqxwd4", "post_id": "6bu702", "comment": "One of my all-time favorites. I do a re-read every few years."}, {"comment_id": "ddabb5s", "post_id": "5rat9u", "comment": "What is this book about? It sounds interesting"}, {"comment_id": "ddcvagu", "post_id": "5rat9u", "comment": "I thought *What Alice Forgot* was amazing. Can't say I noticed the inaccuracies about amnesia. *The Husband's Secret* is really good also if you haven't read it yet.  I Read *The Five People You Meet in Heaven* ages ago and yes, loved it."}, {"comment_id": "dg4bkxe", "post_id": "5rat9u", "comment": "I love everything by that author.  Her books are quick reads that are so enjoyable. "}, {"comment_id": "dh56d28", "post_id": "5rat9u", "comment": "I loved it too and agree with your remarks but about a week after I finished it I felt that Alice was a brat! She became such a self absorbed selfish person. The accident saved her life and marriage. "}, {"comment_id": "d8xkmmx", "post_id": "57x4gd", "comment": "What do you think so far? This book broke my head but in kind of a good way, but I couldn't get through the sequel."}, {"comment_id": "cyd1ncs", "post_id": "3hjjl0", "comment": "I loved that book when I read it in high school! I'd be curious to see if I'd still like it. Have you read the other books in the series? \n\nAnd yeahhh, you're gonna have to do a lot of embracing camp if you wanna enjoy that miniseries"}, {"comment_id": "clh3tgw", "post_id": "2k0p4b", "comment": "The back and forth is what really kept me interested.  The side characters are just as interesting. Frederick Law Olmstead would be unknown to me without this book. I read his biography and his other interests. A perfect example of a great book IMO. It open so many doors. Completely wrecked my reading list and glad for it."}, {"comment_id": "clh9t04", "post_id": "2k0p4b", "comment": "You should read his book Isaac's Storm. Its about the hurricane in Galveston at the turn of the century. It's literally a gripping page turner and it's non-fiction! It's even better!"}, {"comment_id": "clleo30", "post_id": "2k0p4b", "comment": "Just finished it! An astonishing book filled with many famous (and infamous) characters about whom I must read more! I can't imagine a feat like the White City being accomplished today in the little amount of time given, let alone in the late 19th century!\n\nAnd how about that Holmes fellow? How dreadful that there are sure to be many other murders of which we aren't aware! How embarrassing for the Chicago police dept. that this man was only caught thanks to his insurance companies!"}, {"comment_id": "cg9c51c", "post_id": "20ywiz", "comment": "The only interpretation debate I can think of is related to the nature of the apocalyptic event. Popular theories are asteroid impact, nuclear exchange, or eruption of a super-volcano."}, {"comment_id": "c9x0jj7", "post_id": "1e4bvg", "comment": "If you enjoy that you should check out the book George Orwell wrote about his experience of the Spanish Civil War, *A Homage to Catalonia*. I prefer it to Hemingway, but they're both great books."}, {"comment_id": "cab29pa", "post_id": "1e4bvg", "comment": "Hemingway is far and away my favorite author.  Excellent choice :D. It's an incredible book."}, {"comment_id": "cbhmlww", "post_id": "1e4bvg", "comment": "This is my next read. If you haven't read A Movable Feast, also by Hemingway, I recommend it. "}, {"comment_id": "c8l7827", "post_id": "195d9b", "comment": "I read this after watching the film adaptation a few years ago. \nI will never watch that film again. "}, {"comment_id": "c8s2998", "post_id": "195d9b", "comment": "i agree. one the best vampire stories i've read in a long while and the additional short stories are awesome too. i also heard 'Salem's Lot by Stephen King is pretty good read."}, {"comment_id": "c934qmr", "post_id": "195d9b", "comment": "I loved that book. The movie is such a disgrace to that book. The short stories are amazing along with the actual story"}, {"comment_id": "c8175c7", "post_id": "1708sd", "comment": "Great book!"}, {"comment_id": "c8580x2", "post_id": "1708sd", "comment": "Well, more Bolaño, of course! You must read 2666, his masterpiece. \n\nHis character / alter ego Arturo Belano from The Savage Detectives returns in The Secret of Evil , a collection of essays, short stories and unfinished fragments, so you may want to check that out. \n\nI just finished the Third Reich , but I found the writing style is very different from his other works.  \nSo far I love everything I have read by Bolaño.\n\n I have seen The Savage Detectives compared to Hoscotch by  Julio Cortázar, but I have not read that yet.\n"}, {"comment_id": "c7nnrlp", "post_id": "15lwzy", "comment": "I thought it was probably the most complete novel he has written in that it had aspects of almost any major genre out there. "}, {"comment_id": "c7s09xd", "post_id": "15lwzy", "comment": "I read it a year ago, completely fascinated with  it"}, {"comment_id": "c830eew", "post_id": "15lwzy", "comment": "Another constant reader here, I agree, his best at least since IT. \n"}, {"comment_id": "c5pkpub", "post_id": "xtzg1", "comment": "Loved this book! Of all places, found it in a hotel bookshelf in Istanbul, and read it solely on the strength of Stranger in a Strange Land. \nHow are you enjoying it? It is a brilliant idea I thought, I loved the way they talk although it took some getting used to... "}, {"comment_id": "c5oq76e", "post_id": "x73c9", "comment": "I find them to be more tense than 24."}, {"comment_id": "c5fbmzz", "post_id": "wotxs", "comment": "Haven't read it, though I've heard Hemingway is great.  Make sure you tell us what you think?"}, {"comment_id": "c5fe255", "post_id": "wotxs", "comment": "Hemingway is one of, if not the best American authors. While I will say that The Sun Also Rises is not my absolute favorite by him, it is still quite good. It's semi-autobiographical so keep in mind he's writing about the expatriates in Paris during that time. Let the story develop a bit and you'll understand more about what he's talking about.\n\nWhat do you think of the writing style?"}, {"comment_id": "c5lgyj1", "post_id": "wotxs", "comment": "Expect nothing to be resolved- thats just his style of writing. He just gives you a slice a life that has no resolution (and some would argue no climax either). To me, I hated most of the characters- but I did like the book overall. "}, {"comment_id": "c57gfr4", "post_id": "vt8n4", "comment": "Damn fine book that is. Second favourite of mine from the series.\n\nLong days, pleasant nights, sai."}, {"comment_id": "c57wvmn", "post_id": "vt8n4", "comment": "That's one of my favourite books out of the series - it definitely stands alone. I've re-read it quite a few times, along with Drawing of the Three and Wizard and Glass. I've gone through the series in full twice... maybe thrice now? But Wizard and Calla hold up really well to single reads. "}, {"comment_id": "c588gal", "post_id": "vt8n4", "comment": "Cool! I can't wait to get deeper into it! I am only 20% through so far.\nI was not a huge fan of The Drawing of the Three. That is not to say I didn't like it, but I can say it is my least favorite so far.\nUltimately I view The Dark Tower as a whole work, and The Drawing of the Three as my least favorite segment so far :)"}, {"comment_id": "c5ecfp7", "post_id": "vt8n4", "comment": "10 years later some of that lingo still pops into my head from time to time\n\nThankee-sai"}, {"comment_id": "c5dao13", "post_id": "vrfxg", "comment": "How is/was it? I read The Stranger a year ago and want to get into some of his other works too."}, {"comment_id": "c4wagk8", "post_id": "ujpjl", "comment": "I'm looking forward to reading this."}, {"comment_id": "c4w0jtl", "post_id": "ujpjl", "comment": "I loved that book!  The movie look ridiculous, but in an fun way.  The book left me feeling warm and fuzzy on the inside."}, {"comment_id": "c4w2y8n", "post_id": "ujpjl", "comment": "Really liked the book! The movie looks like it'll be a little different, but kick ass!"}, {"comment_id": "c4w4mf3", "post_id": "ujpjl", "comment": "Hmm.  On my list to read.  Problem is I ned to work through the pile I already have! :D"}, {"comment_id": "c4wa5ek", "post_id": "ujpjl", "comment": "Speaking of ass kicking, I was disappointed Lincoln didn't do more kicking of asses.  I hope the movie fills in more of what the book lacked (in my opinion)."}, {"comment_id": "c518ezr", "post_id": "ujpjl", "comment": "I can't wait to read this! Just finished the obligatory lady bewwks Pride and Prejudice and Zombies, and the sequel Happily Never After... needed some cheese to counteract my college course and they totally fit the bill for me...but alas...I am a girrrrrl :')"}, {"comment_id": "c4w27x0", "post_id": "ujk56", "comment": "I think it's one of the ones I read many years ago.\n"}, {"comment_id": "c4w337x", "post_id": "ujk56", "comment": "I read this when I was about 19. It really helped to develop my scepticism."}, {"comment_id": "c4wdi29", "post_id": "ujk56", "comment": "I haven't read the whole thing, but I did read about half of it. Good as an intro to skepticism."}, {"comment_id": "eul77du", "post_id": "cd8n78", "comment": "About to finish this gem. Seems our girl Kristin has a thing for sadness but it is beautiful"}, {"comment_id": "ehtq5bt", "post_id": "axdaml", "comment": "I definitely preferred Uprooted over Spinning Silver. Let me know what you think after you've finished it."}, {"comment_id": "eelsd37", "post_id": "ai5rua", "comment": "That was my first murakami. Still the best one I've read. The beauty of the book lies in its strangeness.There were some instances when I was so lost in the book, I felt like drowning in the text, especially the scenes when the protagonist is stuck in the well. Hey even I'm setting up a goal to read around 20 this year. Wanna do it together? \n"}, {"comment_id": "eenubws", "post_id": "ai5rua", "comment": "Loooooove this book"}, {"comment_id": "e6xncn9", "post_id": "9jqqgs", "comment": "Great book have hankies ready!"}, {"comment_id": "e3g90yf", "post_id": "93teky", "comment": "I enjoyed a few of Wally Lamb's novels. It's been over a decade since a read any of them.  I hope you are enjoying it. "}, {"comment_id": "e3gaqi5", "post_id": "93teky", "comment": "Get your Kleenex ready!"}, {"comment_id": "e5qoind", "post_id": "93teky", "comment": "One of my favorites of all time. Are you all done now? What did you think?"}, {"comment_id": "dzuoo8g", "post_id": "8nd6wv", "comment": "It’ll pick up pace and scariness, it’s fantastic. I’ve read a few King novels and it’s definitely up there as one of my favourites."}, {"comment_id": "dzusr72", "post_id": "8nd6wv", "comment": "I loved the character development, but I agree it’s a bit slow in the beginning.  But it gets sooo good towards the middle to end.  It’s one of my favorite King books.  The other is The Stand.  Another long book with lots of character development.  "}, {"comment_id": "dzutxnj", "post_id": "8nd6wv", "comment": "I really liked Tommyknockers by King when I read it ages ago. "}, {"comment_id": "dzvluak", "post_id": "8nd6wv", "comment": "I e read every single book that man has written,  some are definitely better than others.   Bag of Bones was really good,  Needful Things,  The Dark Tower Series,  Lisey’s Story was not a favorite.   "}, {"comment_id": "dzw92f4", "post_id": "8nd6wv", "comment": "You should check out The Girl who loved Tom Gordon by King, super good."}, {"comment_id": "e219asb", "post_id": "8nd6wv", "comment": "I love King although I admittedly haven’t read much at all by him (I just.. I have *so many* books on my shelf to work through...)\n\nI don’t know many other King readers and I’ve never looked for any related forums or anything because I’m always worried that one of the ones I’ve really loved will end up being some universally hated story by his hardcore fanbase. That said, I can’t believe The Shining isn’t on your read list! That was my second King novel and its popularity is well deserved. I also really enjoyed Firestarter. \n\nI’ve read about a third of IT. I had it checked out during a semester of college and classes ended before I got any further so back to the library it went lol. I’ll have to make an effort to pick it up again sometime. "}, {"comment_id": "ds2a3ts", "post_id": "7njhh3", "comment": "Fireworks! 💥 You are a reader too?  Can you be any more perfect?  To answer your question... No, it does not get easier.  It's a good read, but it is very dense and is a slow read.  I personally thought his novel, The Name of the Rose was a little better, but both are good. It has been a while since I read it, but I seem to remember getting about half way through and having an internal struggle on if I wanted to finish it.  In the end, I think it was worth it.  However, I did set it down for a while, read something else, and came back to it later to finish. I don't know if I answered your question, but I hope that helps.  "}, {"comment_id": "ds29sx9", "post_id": "7njhh3", "comment": "You'll be pleased in the end. "}, {"comment_id": "ds4ktpa", "post_id": "7njhh3", "comment": "I remember struggling to finish it... but it was interesting "}, {"comment_id": "dlxs1nw", "post_id": "6v4woq", "comment": "Im with ya. Started it a few weeks back. "}, {"comment_id": "dlyhe55", "post_id": "6v4woq", "comment": "I finished it [about a month ago.](https://www.reddit.com/r/writing/comments/6nfchl/writing_the_book_you_want_to_read/?st=J6N6AVUW&sh=c926450b)\n\nHave fun!"}, {"comment_id": "dlzanci", "post_id": "6v4woq", "comment": "I tried reading it in high school, but stopped because I would have long quiet stretches of road when I walked home. Finished as an adult but took a lot of effort. One of the scariest books I have ever read."}, {"comment_id": "dnfpnb4", "post_id": "6v4woq", "comment": "How do you like IT? Naturally it’s in my list. I currently reading a different [book](https://www.reddit.com/r/currentlyreading/comments/724svu/stephen_king_pet_sematary/)."}, {"comment_id": "dlre4ps", "post_id": "6tgno4", "comment": "Post this on r/books, that sub has a bigger community. Also post it on /r/r4r and you'll probably get some answers :D\n\nGood luck!"}, {"comment_id": "ddurcj8", "post_id": "5uio56", "comment": "Loved it. TV show was crap compared. When you're done message me and we can chat about it"}, {"comment_id": "ddyj48m", "post_id": "5uio56", "comment": "I'm about 1/3 of the way through it right now! It definitely goes pretty slowly because it is so long, but I am enjoying it so far. I don't know about you but sometimes it is really hard for me to forge my way through long books. Best of luck and I hope you like it!"}, {"comment_id": "dec5zuk", "post_id": "5uio56", "comment": "I loved that one! Keep going, it's worth it."}, {"comment_id": "deh1dbo", "post_id": "5uio56", "comment": "Oh, how I loved that book. Need to reread it now! I don't remember enough of it to really give it a good review, but I did absolutely love it and I can tell you it's worth it to finish it."}, {"comment_id": "d6grqkf", "post_id": "4xj6na", "comment": "I started it, then moved and my copy was lost. I was about half way. Really enjoyed it."}, {"comment_id": "d73zpbo", "post_id": "4xj6na", "comment": "Oh man, so when I saw that Amazon was doing this show I was like \"wow that's such a cool idea!\" The discovered that it was based off of a book. I went out and bought the book and I was thoroughly disappointed. I think my trouble was I went into it with an expectation of an action packed violent thriller where the resistance tries to over throw the evil empire. Yeah it wasn't that, it had some cool parts to it for sure, just not what I expected."}, {"comment_id": "d9kh8b4", "post_id": "4xj6na", "comment": "Have you finished? I almost bought it yesterday, but didn't. I would like to hear your thoughts on it."}, {"comment_id": "d3mtj6o", "post_id": "4lbvdj", "comment": "Neil Gaiman seems to be the most popular author on this subreddit!"}, {"comment_id": "d3n2n5e", "post_id": "4lbvdj", "comment": "I hope you're enjoying it, please let me know what you think. (It's been sitting on my Kindle for a while now, and I've been very curious!)"}, {"comment_id": "d3nthg3", "post_id": "4lbvdj", "comment": "I'm interested to hear what you think! I have it on my kindle ready to read but haven't finished my current book (*Escape to Ash Island - J. H. Lucas*). If you find it enjoyable, let me know and I shall read it next."}, {"comment_id": "cy6fc36", "post_id": "3x91ec", "comment": "me toooo"}, {"comment_id": "cuxlq61", "post_id": "3kcqqu", "comment": "I finished this probably about 3-4 months ago and it has to be one of my favorite books I've ever read. I loved how technical it got, while still being dumbed down enough for me to enjoy"}, {"comment_id": "cv2nhjs", "post_id": "3kcqqu", "comment": "Currently reading it too! I am not a sci-fi kind of girl, but I am really enjoying it. I love the science and the main character is pretty funny. Can't wait to see the movie!"}, {"comment_id": "csy8awz", "post_id": "3cqkzv", "comment": "I have this on my to read list but I am worried that it might make me cry. Which isn't bad but I don't wanna cry. "}, {"comment_id": "csz4skg", "post_id": "3cqkzv", "comment": "I absolutely agree. I've never never been able to see my dogs the same after reading it! It heavily impacted me in a lot of areas actually! Great book! "}, {"comment_id": "cteafr7", "post_id": "3cqkzv", "comment": "Ahh I'm glad you're enjoying it! Unfortunately, I can't read dog books anymore. As someone who has to change the channel when the ASPCA commercials come on to avoid waterworks, books like *Where The Red Fern Grows* and *A Dog's Life* have forced me to kick that habit for good.\n "}, {"comment_id": "cr3yjfe", "post_id": "35ewf1", "comment": "I do like Murakami's writing; it's the self-conscious brand of pretentious without taking the piss (like Dave Eggers does). I read this book about two weeks ago and felt like he was showing a lot of self-restraint and making a real effort to keep his writing grounded; from what I've heard, his other work has more magical realism."}, {"comment_id": "css4sxv", "post_id": "35ewf1", "comment": "This book is one of my favorites. So beautifully written. Enjoy! "}, {"comment_id": "ct181s7", "post_id": "35ewf1", "comment": "I read it. It was great. A little sad but left me tons of things to think about. I relate a lot to the main character and also see some of my friends and acquaintances in other characters. Wont't spoil it for you but highly recommended."}, {"comment_id": "cr3w005", "post_id": "35ewf1", "comment": "He's a wonderful writer and I love his style. Occasionally I have to take a break of reading his books, they sometimes get too sad or confusing for me. I used him for my Japanese literature final last year. \nHow is that book though? I'm not sure of the premise but it's been on my list. "}, {"comment_id": "chic7u7", "post_id": "25l4ic", "comment": "It is an amazing book. The film adaptation is beautiful, but DWJ just captures Sophie's abilities with an incredible subtly that the movie doesn't quite convey."}, {"comment_id": "chn0f5h", "post_id": "25l4ic", "comment": "It never occurred to me that the film might have been an adaptation , I'll definitely have to give this a look, thanks for turning me on to this! "}, {"comment_id": "chva8ym", "post_id": "25l4ic", "comment": "I absolutely adore Diana Wynne Jones.  Her writing is phenomenal and her imagination is unlike any other.  I would highly recommend checking out her other works.  Howl's Moving Castle is one of my favorites, but she also does well with her short story collections such as Unexpected Magic."}, {"comment_id": "ccaoh8s", "post_id": "1mm3pz", "comment": "I'd be interested in hearing how you liked it once you finish."}, {"comment_id": "ccgo34y", "post_id": "1mm3pz", "comment": "I personally found some of the sections incredibly difficult to push through, so don't give up if you get to a less exciting chapter."}, {"comment_id": "ccb1nek", "post_id": "1mm3pz", "comment": "All of it??"}, {"comment_id": "c72xb8u", "post_id": "13dcru", "comment": "[Amazon UK](http://www.amazon.co.uk/Locke-Key-Volume-Head-Games/dp/1600104835/ref=sr_1_1?ie=UTF8&qid=1353190679&sr=8-1)\n\n[Amazon US](http://www.amazon.com/Locke-Key-Vol-Head-Games/dp/1600104835/ref=tmm_hrd_title_0?ie=UTF8&qid=1353191050&sr=8-1)\n\n[Goodreads](http://www.goodreads.com/book/show/6120349-locke-and-key-vol-2)"}, {"comment_id": "c6x4e67", "post_id": "12i2o1", "comment": "So it's been four days.  What do you think of *Speaker*?"}]