[{"comment_id": "dnte7ei", "post_id": "73v7mj", "comment": "As a musician, Tom Petty was one of my greatest inspirations. I always wanted to write songs like he did. And, of course, I never saw him live...it was always “next time” he comes to town. Goddammit."}, {"comment_id": "dntgb0a", "post_id": "73v7mj", "comment": "Fucking same. Just seemed like there would always be time. We knew he was slowing down but you can never predict something like this.\n\n☹️"}, {"comment_id": "dnth1b7", "post_id": "73v7mj", "comment": "...had tickets to his show at the Greek in Berkeley a couple weeks back but he got sick and they had to reschedule the dates and (BECAUSE WORK DAMNIT!) I couldn't make the make up show.\n\nPROMISED myself I'd make the next go 'round..."}, {"comment_id": "dnuxuy5", "post_id": "73v7mj", "comment": "Since Cornell died, I've refused to use that excuse any time a bucket list band comes near me. I'll find ways to make more money if I need to. You can't bring back those experiences.\n\n*cliche white people saying*"}, {"comment_id": "dntsx6f", "post_id": "73v7mj", "comment": "Song request: write  \"next time\" "}, {"comment_id": "dntmydp", "post_id": "73v7mj", "comment": "I am so glad my mom and dad actually just took my sisters and I to see him in April because he is my dad's favorite artist. Hands down the best live show I've been to so far in my short 21 years but I am glad I got to see him. I won't ever wait until \"next time\" again knowing some of the people I've already missed out on from when i was a teenager. Linkin Park for example. Life is too short"}, {"comment_id": "dntmacz", "post_id": "73v7mj", "comment": "I saw him at Bonaroo"}, {"comment_id": "dntoihh", "post_id": "73v7mj", "comment": "Saw him in Pittsburgh, dude could put on a show....was in Denver this year unexpectedly when he was at red rocks but tickets were like $600 😕"}, {"comment_id": "dntcr65", "post_id": "73v7mj", "comment": "When I learned that riff in Runnin Down A Dream as a kid. I left like a rock god. Sad to see him go....\n\nRip Tom. "}, {"comment_id": "dnterxc", "post_id": "73v7mj", "comment": "Just listened to that tune. Such a banger of a song. The man really knew how to write a hit. Rest in peace, Tom."}, {"comment_id": "dntj8ik", "post_id": "73v7mj", "comment": "my band just started learning this song a couple weeks ago.  the song means so much to me because i feel like i'm running down a dream too.  we haven't played it out just yet but i have a feeling we will soon.  rip one of my favorite writers"}, {"comment_id": "dntm62c", "post_id": "73v7mj", "comment": "One of my fave songs from GTA: San Andreas. For perfectly for those country drives."}, {"comment_id": "dntof2x", "post_id": "73v7mj", "comment": "Not to take away from the man who wrote a big part of the soundtrack to my life, but\n\n>  that riff in Runnin Down A Dream\n\nwasn't that [Mike Campbell](https://en.m.wikipedia.org/wiki/Mike_Campbell_%28musician%29?wprov=sfla1)?"}, {"comment_id": "dnte42i", "post_id": "73v7mj", "comment": "Sad.\n\nI saw him live in about 1982 (or 83 can't remember exactly). It was a really good show.\n\nAt least once I'd got over the fact that he wasn't Johnny Thunders. My sister bought the wrong tickets due to a bit of confusion around the Heartbreakers."}, {"comment_id": "dntlwr9", "post_id": "73v7mj", "comment": "That's a great story! They were pretty much polar opposites and not at all what you were expecting, but you still liked it! I can't think of a better introduction to a musical artist. "}, {"comment_id": "dnuegun", "post_id": "73v7mj", "comment": "Oh my"}, {"comment_id": "dntes4h", "post_id": "73v7mj", "comment": "The man was a walking masterclass in songwriting. He’ll be missed. "}, {"comment_id": "dnthche", "post_id": "73v7mj", "comment": "God damnit. I knew something was up when I was driving home and they played like 4 of his songs in a row. The last time I remember a station doing that was when Bowie died.\n\nOne of the worst things about getting older is watching all of your heroes die. \n\nRIP."}, {"comment_id": "dntdr2n", "post_id": "73v7mj", "comment": "Noooooooo 😭"}, {"comment_id": "dntdtpv", "post_id": "73v7mj", "comment": "R.I.P. Tom Petty...he will always be remembered for his contributions to rock music.  Another lost legend."}, {"comment_id": "dnte3b3", "post_id": "73v7mj", "comment": "One of the first concerts I ever attended was Tom Petty and the heartbreakers. Trey Anastasio opened for them while phish was broken up. That show will always have a special place in my memory as it was kind of a coming of age experience for me. RIP Tom you will be missed dearly."}, {"comment_id": "dntok2j", "post_id": "73v7mj", "comment": ">EDIT HE IS NOT DEAD YET\n\nStop dragging my heart around!"}, {"comment_id": "dntqsq3", "post_id": "73v7mj", "comment": "“Music is probably the only real magic I have encountered in my life. It's pure and it's real. It moves, it heals.” – Tom Petty"}, {"comment_id": "dnteiyy", "post_id": "73v7mj", "comment": "If you're looking for me, I'll be sitting over there in a corner, drinking - while listening to Tom Petty and The Traveling Wilburys.\n\nWhat an incredibly sad day. Tom Petty and his music were a constant in my life for so long. Something to depend on, that's there for you."}, {"comment_id": "dvcglt3", "post_id": "73v7mj", "comment": "I read this much later - but check out Mudcrutch too if you haven’t already. Great band with Tom, Mike and Benmont. "}, {"comment_id": "dntil5e", "post_id": "73v7mj", "comment": "[Runnin' Down a Dream](https://www.netflix.com/search?q=Runnin%20down%20a%20dream&jbv=70082634&jbp=0&jbr=0)\n\nA documentary on Netflix (US), that no Petty fan should miss. Set some time aside, its four hours long."}, {"comment_id": "dntziei", "post_id": "73v7mj", "comment": "And it's awesome. I watched it last week."}, {"comment_id": "do0wxxb", "post_id": "73v7mj", "comment": "Watched about 3 times in a row last year.  There's just certain guys that have it, they're true.  Like The Who, they're the real deal.  Tom Petty was one of those.  "}, {"comment_id": "dnte7l0", "post_id": "73v7mj", "comment": "Fuck, I am sick of getting older and losing pieces of my past little by little. RIP Tom, thanks for the good music and good memories."}, {"comment_id": "dntm6ni", "post_id": "73v7mj", "comment": "I'm right there with you. Hate to say it, but it just keeps getting worse. If you were around when TP was recording Refugee or American Girl, you are already at the age where funerals start outnumbering weddings.\n\nAnd it really, really sucks."}, {"comment_id": "dnurzbu", "post_id": "73v7mj", "comment": "Ay, I definitely feel you, stuff like this is awful. I suppose the beauty of music is that now this person is immortalized and they can have an effect on people long after they're gone. I don't know if that helps at all but to me it's a small silver lining."}, {"comment_id": "dnth34t", "post_id": "73v7mj", "comment": "Every time I think Tom Petty I think \"Don't Come Around Here No More.\"  I know it wasn't one of his big ones, but the Wonderland thing they had going on in that video was awesome, and because of it I never stopped seeing Petty as the Mad Hatter."}, {"comment_id": "dnte8kd", "post_id": "73v7mj", "comment": "We just covered two of his classics this weekend, and we did them better then we ever have. Mary janes last dance and free fallin. Moment of silence to one of the greatest. "}, {"comment_id": "dntf4t5", "post_id": "73v7mj", "comment": "Fuuuuck.  Tom is helping me learn guitar.  Now I have to go be sad.\n\nMemory:  His performance of \"Refugee\" on SNL when I was 9 or 10 is the first memory I have of watching a band on tv and thinking \"this is badass\". "}, {"comment_id": "dnte53a", "post_id": "73v7mj", "comment": "I just learned to play Wildflowers a couple of days ago, bought a quality capo specifically for that song.  This one hurts."}, {"comment_id": "dntpcsz", "post_id": "73v7mj", "comment": "I love that song. "}, {"comment_id": "dnualp0", "post_id": "73v7mj", "comment": "Crawling Back to You off the Wildflowers album I always found especially beautiful <3"}, {"comment_id": "dnterkk", "post_id": "73v7mj", "comment": "Fuck.  My wife texted me this morning about the mass shooting and the day was off to a shitty start.  I just texted her back about Tom Petty, who is one of our favorite musicians.  At least we're even with the shitty text messages now.  :'("}, {"comment_id": "dntr9mp", "post_id": "73v7mj", "comment": "Shit day all around, just gotta make it work somehow. "}, {"comment_id": "dnte55a", "post_id": "73v7mj", "comment": "Free Fallin' was one of the first songs I learned how to play on the guitar. So simple yet so catchy. RIP"}, {"comment_id": "dnti6sn", "post_id": "73v7mj", "comment": "I never bothered to learn it, but, I'm going to learn it tonight"}, {"comment_id": "dnu0w3v", "post_id": "73v7mj", "comment": "It was my very first song. Such a sad day."}, {"comment_id": "dnue2oj", "post_id": "73v7mj", "comment": "It's the one I've been trying to learn, love that song and all his stuff.  Such good music.  So sad."}, {"comment_id": "dnti45k", "post_id": "73v7mj", "comment": "\"If Tom Petty can sing, so can I\" .. one of the many thoughts I had that actually got me to open my mouth and bleat out some vocals after *years* of thinking \"I just can't sing *and* play at the same time\".\n\n:-( RIP Tom, you were a bona-fide inspiration. I'm calling it a day 'cause after Las Vegas and now this I think I need a gddam drink or three, who's with me\n"}, {"comment_id": "dnthbr5", "post_id": "73v7mj", "comment": "My first experience with Tom Petty was in the movie \"the Postman\", Kevin Costner found him (as himself) leading a city and say \"I know you... you're famous\" I had no idea who it was until like15 years later when I watched the movie with a girlfriend who said \"oh hey Tom Petty is in this movie?\""}, {"comment_id": "dntu4sg", "post_id": "73v7mj", "comment": "That was Tom Petty?!? I have a movie to rewatch, thank you. "}, {"comment_id": "dnthulb", "post_id": "73v7mj", "comment": "[deleted]"}, {"comment_id": "dnu5nkk", "post_id": "73v7mj", "comment": "For me, it's [Don't Come Around Here No More](https://youtu.be/h0JvF9vpqx8). The video reminds me of MTV and VH1 in its heyday. "}, {"comment_id": "dntqpny", "post_id": "73v7mj", "comment": "[deleted]"}, {"comment_id": "dntwxt1", "post_id": "73v7mj", "comment": "That start time means it had to be a killer show to let everyone jam ."}, {"comment_id": "dntv2kr", "post_id": "73v7mj", "comment": "What a killer show that must've been"}, {"comment_id": "dnvb0be", "post_id": "73v7mj", "comment": "20 dollars for that show? With Tom Petty at third billing? Good lord that must have been awesome"}, {"comment_id": "dntgzun", "post_id": "73v7mj", "comment": "Slickest shit on wax \"Breakdown\" smoothest lyrics ever"}, {"comment_id": "dnu1c7j", "post_id": "73v7mj", "comment": "https://www.youtube.com/watch?v=fsKsFU766Io\n\nIt's just a perfect song"}, {"comment_id": "dnth5st", "post_id": "73v7mj", "comment": "One of my heroes left this world today. Fly high, Mr. Petty. Thanks for some of the coolest music I’ll ever hear. "}, {"comment_id": "dntk6bw", "post_id": "73v7mj", "comment": "He belongs among the wildflowers"}, {"comment_id": "dntmn8d", "post_id": "73v7mj", "comment": "Really saddened by this news. I know he's still technically alive, so that makes it a good time to celebrate his life.\n\nHe was always one of my favourites. He wrote very genuine music. Sure, he'd have his fair share of pop songs, but he never compromised who he was. His music is very real. Not the greatest singer or greatest guitar player, but he meant every note you sang and played. I think that's admirable, especially when he still manages to stay a household name.\n\nThis news makes me sad, but luckily Tom Petty's music can always make you feel better when you're down. Thanks for everything Tom. We all love you."}, {"comment_id": "dntwy83", "post_id": "73v7mj", "comment": "I actually think he is one of the great rock singers of all time. He could wail away as well as anyone and sing ballads in a unique, affecting way. Take a listen to \"Square One\" for a song sung well\n\n\n "}, {"comment_id": "dntsrh3", "post_id": "73v7mj", "comment": "First concert I ever went to. My dad took me to see Tom petty and pearl jam at the xcel energy center in Minneapolis. That was the first time I smelled pot too."}, {"comment_id": "dntzjjv", "post_id": "73v7mj", "comment": "Xcel Center is in St. Paul, Target Center is in Minneapolis. Either way, that's dope"}, {"comment_id": "dntuldz", "post_id": "73v7mj", "comment": "Saw him for the first time in '83. Been listening to him since '76. I bought a Rickenbacker 360 in '82 because of him. It was way too big, too good, and too expensive for a dumbshit like me. But I love that guitar. (https://imgur.com/Q9e6v1m) And I love Tom Petty. "}, {"comment_id": "dntdt9t", "post_id": "73v7mj", "comment": "Ugh... This hurts."}, {"comment_id": "dnti8lx", "post_id": "73v7mj", "comment": "I yelled \"NO!\" loud enough to disturb some students in the other room. I said \"Tom Petty\" and they nodded\n"}, {"comment_id": "dnts3zb", "post_id": "73v7mj", "comment": "Dude was one of the most consistent musicians of his era, It never felt like a B-side when you flipped that tape over. He ran that dream down and made it his bitch."}, {"comment_id": "dnterw6", "post_id": "73v7mj", "comment": "This sucks. One of the most down to earth songwriters/superstars ever. The man wrote such great music and did it with some of the most basic structures and made it sound *damn good*. He always made it \"like they used to\"."}, {"comment_id": "dntqvvc", "post_id": "73v7mj", "comment": "His songwriting was such a strength of his. He just had that ability to write songs that you could chill out to and listen to all day long. Such a shame he's gone now. RIP"}, {"comment_id": "dnth8r4", "post_id": "73v7mj", "comment": "First song I ever learned to play was free falling. Though he was never my favorite artist, he definitely had his own voice that helped shape a generation of music.  Sad news."}, {"comment_id": "dnttigy", "post_id": "73v7mj", "comment": "Capo 3"}, {"comment_id": "dntkvh1", "post_id": "73v7mj", "comment": "I am a big fan of George Harrison and Tom and yesterday i deiced to re-watch Living In the Material World. there is part when Roy Orbison dies and George calls Tom and tells him \"Aren't you glad it wasn't you?\"."}, {"comment_id": "dnttlrq", "post_id": "73v7mj", "comment": "Get better soon Tom, as of 6:30 PST, he is still alive and fighting "}, {"comment_id": "dnu2oc7", "post_id": "73v7mj", "comment": "he's gone https://www.facebook.com/tompetty/posts/10154978089270905?pnref=story \n"}, {"comment_id": "dntrusy", "post_id": "73v7mj", "comment": "I miss him so much. God. Ive been crying all afternoon and evening. Cranking a mix of his stuff now. \n\nI've seen him more than any other artist. The first time in July of 2002 at Saratoga Performing Arts Center, and the last time a few months back at Mountain Jam in Hunter NY. \n\nHis music has been the soundtrack to my since I was 8 years old. Now I'm 35 and there won't be anything new. This is going to be a difficult adjustment. \n\nThank you so much, Tom. You gave us all so many great songs that are just truly wonderful and fantastic gifts. May you rest well. I miss you so much. "}, {"comment_id": "dntpu4o", "post_id": "73v7mj", "comment": "Fuck me this one hurt. One of my all time favorites."}, {"comment_id": "do0x3ch", "post_id": "73v7mj", "comment": "Curt Cobain was a biggie, I remember driving, like I heard about Tom.  I think Jimmy Page will the hardest.  "}, {"comment_id": "dntfege", "post_id": "73v7mj", "comment": "Awww, saw him at Bonnaroo 2013, it was a great show!!! R.I.P."}, {"comment_id": "dntsyc4", "post_id": "73v7mj", "comment": "In the pouring rain. Great show."}, {"comment_id": "dntfeir", "post_id": "73v7mj", "comment": "Born a rebel down in Dixie hey hey hey.\n\nRip"}, {"comment_id": "dntga86", "post_id": "73v7mj", "comment": "I only knew him throught Travellin' Wilburries, the most legendary of all the legendary all-star bands."}, {"comment_id": "dntzpxo", "post_id": "73v7mj", "comment": "You've got some work to do. "}, {"comment_id": "dntgnzz", "post_id": "73v7mj", "comment": "He is such a brilliant lyricist. Of all his great songs, and there are many, the best example is Southern Accent. It’s like he took Even The Losers, but made it more personal. Both brilliant songs from a talent that may never be matched."}, {"comment_id": "dntgzf9", "post_id": "73v7mj", "comment": "Pine Knob, Clarkston MI. Still one of the loudest concerts I’ve ever been to. RIP. "}, {"comment_id": "dntx1f9", "post_id": "73v7mj", "comment": "If that was about 1981 - I was there!  And yeah, he fucking killed it.\n\n\"Damn the Torpedoes\" tour I think."}, {"comment_id": "do0x3uj", "post_id": "73v7mj", "comment": "Detroit, Rock City indeed.  "}, {"comment_id": "dnti00z", "post_id": "73v7mj", "comment": "Just a heads up that the LAPD tweeted this about Tom and states \"The LAPD has no information about the passing of singer Tom Petty. Initial information was inadvertantly provided to some media sources (2/2) However, the LAPD has no investigative role in this matter.  We apologize for any inconvenience in this reporting.\"\n\nDoes anyone have credible evidence that supports this?"}, {"comment_id": "dnti1s7", "post_id": "73v7mj", "comment": "Just added this into the post. TMZ updated their article after I made the post. "}, {"comment_id": "dntj65g", "post_id": "73v7mj", "comment": "And don't forget that he was the voice of Lucky on \"King of the Hill.\""}, {"comment_id": "dnte7th", "post_id": "73v7mj", "comment": "He provided the soundtrack to my high school years"}, {"comment_id": "dntf93d", "post_id": "73v7mj", "comment": "Damn, sad to hear. Was just listening to him on the way to work this morning :("}, {"comment_id": "dntrc9y", "post_id": "73v7mj", "comment": "Me and my sister were too, local station plays him a lot. "}, {"comment_id": "dnu55mm", "post_id": "73v7mj", "comment": "I just recently started listening to him again.  I listened to him on the way to my first two classes, and after leaving my third class.  Had no clue he had a heart attack until I got a call from my mom at around 3:00 PM telling me he died, even though he ended up dying at around 11:00 CST."}, {"comment_id": "dnthjqr", "post_id": "73v7mj", "comment": "Only two Wilburys left :("}, {"comment_id": "dntzirp", "post_id": "73v7mj", "comment": "Dylan will be the last to go at this rate"}, {"comment_id": "dntlphv", "post_id": "73v7mj", "comment": "When I first moved up to Ottawa, a friend and I used to jam in the forest near tenth line in Orleans. Into the Great Wide Open was one of the songs we played a lot."}, {"comment_id": "dntnvrv", "post_id": "73v7mj", "comment": "Man he was the soundtrack to so many of my summers. This one really hurts."}, {"comment_id": "df41qil", "post_id": "606si5", "comment": "Please everybody keep this thread civil. This man was an icon and regardless of what opinion you held of him, this thread is not a place for jokes. Respect what he did for music and if you can't contribute to the discussion, simply don't post. RIP Chuck.\n\n**Edit: Unfortunately since this thread was given a chance to be civil but the hate never stopped, I'm forced to lock it. Thank you to all who were civil. A thread about a very influential individual passing away doesn't deserve to be treated with such disrespect. It honestly shows a lot of your true colors.**"}, {"comment_id": "df41wq0", "post_id": "606si5", "comment": "Is any fair criticism allowed? I don't particularly care about his personal flaws but I do think they should be allowed to be mentioned. It's kinda sick to not allow them actually. It's like you're denying his victims reality."}, {"comment_id": "df432az", "post_id": "606si5", "comment": "Right the fuck on!"}, {"comment_id": "df3xwpy", "post_id": "606si5", "comment": "I owe that man a lot, he provided a life for me that very few people get to experience. I remember being a 6 year old boy \"playing\" my first show with him, and having the honor to do it again when I was teenager. Being that friegthend 14 year old terrified on stage but my grandfather walked me through how to play with a band and how to preform for the crowd. Many people will bring up his faults but I loved my grandfather, I promise you papa I will continue to play my guitar and name my first son Charles Edward Berry IV he too will learn how to play everyone of your licks as my father and I have done. Your gone but your family will do their hardest to continue to keep a Berry in the music biz & keep your legacy alive. \n-Charles Edward Berry III"}, {"comment_id": "df40b52", "post_id": "606si5", "comment": "Wait, what? He's your grandfather?\n\nMy condolences. And wow. "}, {"comment_id": "df45q45", "post_id": "606si5", "comment": "That's really cool man.  He was an icon.  I would argue that every single one of our influences can be traced back to him.  Sorry for your loss."}, {"comment_id": "df42ykm", "post_id": "606si5", "comment": "every single person here who has picked up an electric guitar owe him. \nSorry for your loss. \nId like to say he was grandfather to all guitarists.\n"}, {"comment_id": "df483mg", "post_id": "606si5", "comment": "Thank you for sharing that, and sorry for your loss. "}, {"comment_id": "df487vf", "post_id": "606si5", "comment": "Chuck Berry is a fucking legend, may he rock in peace! "}, {"comment_id": "df3yx6r", "post_id": "606si5", "comment": ":')"}, {"comment_id": "df3whlv", "post_id": "606si5", "comment": "Wow...\n\nA sad day. His impact cannot be understated. "}, {"comment_id": "df3x7kr", "post_id": "606si5", "comment": "Don't forget the inspiration Marty McFly had on him back in the day as well. "}, {"comment_id": "df44gw8", "post_id": "606si5", "comment": "*Overstated?"}, {"comment_id": "df400s6", "post_id": "606si5", "comment": "Yeah, and my that little country boy could play. "}, {"comment_id": "df41bea", "post_id": "606si5", "comment": "One of my first influences along with Buddy Holly! RIP "}, {"comment_id": "df46jg4", "post_id": "606si5", "comment": "I think you mean overstated."}, {"comment_id": "df43306", "post_id": "606si5", "comment": "Yeah. Too bad he ripped off the Beach Boys though. A black mark on his legacy. "}, {"comment_id": "df3wpti", "post_id": "606si5", "comment": "Most important person in modern music. No Chuck, no Beatles. RIP you legend "}, {"comment_id": "df3xgvs", "post_id": "606si5", "comment": ">Most important person in modern music\n\ntom delonge just rolled in his grave"}, {"comment_id": "df458rb", "post_id": "606si5", "comment": "Robert Johnson. "}, {"comment_id": "df40tqc", "post_id": "606si5", "comment": "[removed]"}, {"comment_id": "df40mz6", "post_id": "606si5", "comment": "Truth.  "}, {"comment_id": "df40uix", "post_id": "606si5", "comment": "[deleted]"}, {"comment_id": "df3xmde", "post_id": "606si5", "comment": "I usually don't understand people getting sad when a celebrity dies, but this has certainly hit me hard. It's not like I knew the guy or anything, but this news genuinely hurts. Chuck Berry played such a big part in shaping the way I listen to music, and his songs feel like a part of my childhood. It's not like he was in his prime, releasing records, so I'm a bit confused as to why I'm grieving so much over him. Guess I'll have to have a few drinks tonight to process this.\n\nHe was a real pioneer, and without him, music would be so much different. Chuck Berry put the life into music. Rest in peace Chuck, we'll all miss you dearly."}, {"comment_id": "df3yfev", "post_id": "606si5", "comment": "It's likely because of the massive impact he has had on modern music.  Especially rock n' roll. Chuck is the true king of rock n' roll regardless of what other people want to claim. He just didn't get the proper recognition until years later due to how black folks where viewed back then.\n\nHe will be missed but his music and influence will never die."}, {"comment_id": "df46bgr", "post_id": "606si5", "comment": "On the other hand, this isn't like George Michael who died before his time. He lived to 90 and had a great life. That's not something to be sad about imo."}, {"comment_id": "df3x82e", "post_id": "606si5", "comment": "I was just going to post the NYTimes article I had.\n\nI am very sad with this.  The line drawn from so many favourite guitarists to Berry is direct.  There are techniques he used that I shake my head at because I can't replicate them.\n\nFare thee well, Chuck.  May the 4 winds blow you safely home!"}, {"comment_id": "df3x7vi", "post_id": "606si5", "comment": "Time to go play some Johnny B. Goode."}, {"comment_id": "df3xwmv", "post_id": "606si5", "comment": "Was holding my Cherry 335 when i read this post. Instantly started playing it. \n\n"}, {"comment_id": "df3wn7u", "post_id": "606si5", "comment": "the real king of rock and roll has left the building. sad."}, {"comment_id": "df3xfnv", "post_id": "606si5", "comment": "Rest In Peace, Chuck. I was dreading this day for a long time and now it's here. \n\nIf you tried to give rock and roll another name, you might call it 'Chuck Berry'. - John Lennon"}, {"comment_id": "df3wkor", "post_id": "606si5", "comment": "Sad, that guy rocked on stage until he died. Gonna be missed."}, {"comment_id": "df3whh9", "post_id": "606si5", "comment": "What a loss. Rest in peace. I hope there was enough of the album recorded that they could release some of it, considering that was his final endeavor he'd probably want the world to hear at least some of that work.\n\nAlso, I guess it was just old age?"}, {"comment_id": "df3wwol", "post_id": "606si5", "comment": "I'm from St. Louis and he was an absolute treat to see at The Duck Room in The Loop's Blueberry Hill.  He was a real innovator and will be mourned greatly.\n\nGotta watch Hail! Hail! Rock 'N' Roll tonight, I guess."}, {"comment_id": "df40ca6", "post_id": "606si5", "comment": "Have you seen all the behind the scenes footage from making that movie?\n\nIt paints a VERY different picture of Chuck."}, {"comment_id": "df477em", "post_id": "606si5", "comment": "Crazy. I was in a thread yesterday talking about him playing at Blueberry Hill."}, {"comment_id": "df3x0a4", "post_id": "606si5", "comment": "He is peeing on the faces of angels now. :("}, {"comment_id": "df3xqvu", "post_id": "606si5", "comment": "Face-farting with God and the J-man."}, {"comment_id": "df3y1sq", "post_id": "606si5", "comment": "We should never forget that even though he had great contributions to music, he was a pretty terrible person."}, {"comment_id": "df3y58p", "post_id": "606si5", "comment": "I hate to be weird, but this a reminder to me that I need to see Buddy Guy play when I return to the US. I loved Chuck Berry's music, but I'd really regret not seeing/hearing Buddy Guy play at least once.\n"}, {"comment_id": "df43dvm", "post_id": "606si5", "comment": "Buddy Guy is amazing live. I took my grandmother to see him and he played part of a solo to her from about a foot away as he walked the crowd. "}, {"comment_id": "df3yzkn", "post_id": "606si5", "comment": "Man this is sad. I was just thinking about how old he was recently, and I learned he was making a new album. Pretty incredible. \n\n  \nWe still have some old legends with us. Ya know Fats Domino is still alive? Kind of blows my mind. \n  \nRIP Chuck\n  \n\n  \n"}, {"comment_id": "df42zaf", "post_id": "606si5", "comment": "I took a African American History class in college. The professor asked \"does anyone know who the founder of rock music is?\"\n\nI raised my hand all confident and said \"Buck Cherry.\"\n\nHe said \"... who?\"\n\nAnd I'm like \"...Buck Cherry.\"\n\nHe said \"No, Chuck Berry. You must be talking about his long lost cousin.\"\n\nStill ashamed."}, {"comment_id": "df3wv5m", "post_id": "606si5", "comment": "As a young kid, I first loved guitar because of Roy Rogers...then I heard Chuck Berry."}, {"comment_id": "df44v4v", "post_id": "606si5", "comment": "Roy Rogers plays the best slide guitar ever, hands down"}, {"comment_id": "df3ynmt", "post_id": "606si5", "comment": "He could play his guitar just like ringing a bell."}, {"comment_id": "df45vcx", "post_id": "606si5", "comment": "Chuck Berry was not only a huge influence on the Stones with his style and lyrics, but the Stones also performed and recorded a large number of Berry covers throughout their long and storied career.\n\n* [Around and Around](https://www.youtube.com/watch?v=ct2n2iiiIGQ)\n* [Beautiful Delilah](https://www.youtube.com/watch?v=nj8FYok39_I)\n* [Bye Bye Johnny](https://www.youtube.com/watch?v=arqpnd3fR6k)\n* [Carol](https://www.youtube.com/watch?v=Wfj1O_fApvA)\n* [Come On](https://www.youtube.com/watch?v=UCWxU2pln2k)\n* [Confessin' the Blues](https://www.youtube.com/watch?v=m2N0MuhcjDg)\n* [Don't Lie to Me](https://www.youtube.com/watch?v=NQur4LSgxi4)\n* [Down the Road Apiece](https://www.youtube.com/watch?v=CkRmIIYw3Hg)\n* [Let it Rock](https://www.youtube.com/watch?v=z72wCH5ZZy0)\n* [Little Queenie](https://www.youtube.com/watch?v=4lXFl_qM2Z8)\n* [Memphis, Tennessee](https://www.youtube.com/watch?v=BKIcavxkZk0)\n* [Reelin' And Rockin'](https://www.youtube.com/watch?v=IhKHNFE1M4M)\n* [Roll Over Beethoven](https://www.youtube.com/watch?v=64GbValI_To)\n* [Route 66](https://www.youtube.com/watch?v=c5TG8nn5dRI)\n* [Run Rudolph Run](https://www.youtube.com/watch?v=KDMDMLF2j1A)\n* [Sweet Little Sixteen](https://www.youtube.com/watch?v=Sklo38sGZks)\n* [Talking About You](https://www.youtube.com/watch?v=V-az93Vfx68)\n* [You Can't Catch Me](https://www.youtube.com/watch?v=a99GqZGZuJE)"}, {"comment_id": "df3xn1r", "post_id": "606si5", "comment": "Just imagine the look on St Peter's face at the gates when Chuck starts into \"My Ding-A-Ling\" and everyone joins in."}, {"comment_id": "df44oa6", "post_id": "606si5", "comment": "Who?"}, {"comment_id": "df3yl3f", "post_id": "606si5", "comment": "RIP to the guy who inspired my username."}, {"comment_id": "df3z5z2", "post_id": "606si5", "comment": "Damn. He was 90 so this didn't exactly come out of nowhere, but it still sucks. The importance and influence of this man probably can't even be quantified. Even if you didn't listen to a lot of Chuck Berry yourself, it's almost a guarantee that one of your favorite bands did. \n\nWhat he did for music was incredible. Thanks Chuck."}, {"comment_id": "df3xrug", "post_id": "606si5", "comment": "Jimi's [Johnny B. Goode](https://youtu.be/xlJclT1lMBk) made me want to play guitar. Huge loss. "}, {"comment_id": "df3y0hm", "post_id": "606si5", "comment": "I don't think he will get the respect he certainly deserves. And I am sorry for that."}, {"comment_id": "df40zw9", "post_id": "606si5", "comment": "Why do you think that?"}, {"comment_id": "df3zejd", "post_id": "606si5", "comment": "Well, i had a gig next Saturday and i wasn't sure wether I should include Johnny B. Goode in my set, but now i have no choice but to pay respects to chuck and play the song. \n\nR.I.P "}, {"comment_id": "df420e9", "post_id": "606si5", "comment": "Glad he got to live a long life, but this is a sad day.\n\nIf I was a good cartoonist, I'd draw a cartoon of Chuck walking through the pearly gates, with Jimi Hendrix sat smoking on a chair, saying \"I've been waiting for you for 47 years, man. Let's lay down some tunes.\""}, {"comment_id": "df3ygfu", "post_id": "606si5", "comment": "This hits hard. I've seen Chuck Berry several times. The last time was in Austin about twelve years ago.  You could tell he was tired, the man toured constantly, but he gave it everything he had. He was such a big influence for me.  \n\nListening to Havana Moon right now. "}, {"comment_id": "df404me", "post_id": "606si5", "comment": "This is crazy. I was just telling my friend yesterday how crazy it was that Chuck Berry is still alive. Very sad news."}, {"comment_id": "df40s1y", "post_id": "606si5", "comment": "Huge loss. That scene in Back to the Future with Johnny B Goode was probably the most memorable moment for me when watching movies as a kid."}, {"comment_id": "df42cyf", "post_id": "606si5", "comment": "not to be disrespectful but is his new album still coming out?"}, {"comment_id": "df3ym6o", "post_id": "606si5", "comment": "The reason I started learning guitar was because I wanted to play like Chuck Berry, sad day :( His music will live on forever like Mozart and Beethoven, I'm sure of it."}, {"comment_id": "df42o7c", "post_id": "606si5", "comment": "He will be missed, even if he did rip off Marty McFly\n"}, {"comment_id": "df3y96b", "post_id": "606si5", "comment": "I can only imagine Blueberry Hill will be packed more than it usually is on Saturday nights. "}, {"comment_id": "df40gnb", "post_id": "606si5", "comment": "Why?"}, {"comment_id": "df42axg", "post_id": "606si5", "comment": "If you rated musicians by the impact they left behind, just about every rock n roll and blues guitar player was inspired by this guy. RIP Chuck\nhttps://youtu.be/c0he1y8g6yE"}, {"comment_id": "df42ohs", "post_id": "606si5", "comment": "Interesting angle.\n\nIf I was going for the big ones, the ones that changed the way we looked at the guitar, things were just different after them, etc.  \n\nI guess I'd say Chuck/Jimi/EVH as the ones who really changed how the guitar was viewed, etc.  Idk, that's an interesting question. "}, {"comment_id": "df459i8", "post_id": "606si5", "comment": "Can't believe he was releasing a new album, damn."}, {"comment_id": "df45v0c", "post_id": "606si5", "comment": "Age 32 here. Chuck Berry is one of a handful of artists I would hear my dad listen to in my childhood that I went on to listen to and reminisce about being little and hearing the sounds on the stereo in our den. Once I was in my teens and learning guitar, I wanted to learn his classics. All time great. Thank you for everything you've done and allowed to be created down the road.\n\nHeroes get remembered, legends never die."}, {"comment_id": "df41ylh", "post_id": "606si5", "comment": "I only heard about this less than 30 minutes ago, I was picked up from my first day of work from my first job all excited and then checked my phone to see a text from my friend telling me. I gasped really loud in front of my mom who was ready to freak out. Gosh, I'm only 16 but my guitar teacher introduced me to his music back within our first few lessons back around July last year. Since I learned about him in my first few weeks of learning guitar, he's made a HUGE impact on my playing. If it weren't for him, I wouldn't be constantly sliding into the first and second strings, bending those strings high, doing his way of double stops, or try playing notes out of the scale to sound more bluesy. It's really sad, I always had a tiny sense of hope that maybe I would have the honor to meet him. Just wish he could how much he impacted my playing and taste in music, I'll no doubt ever forget him and surely will miss him."}, {"comment_id": "df3y026", "post_id": "606si5", "comment": "A sad day. Although it was technically Marty McFly that inspired me to pick up a guitar, It's a sad day nonetheless."}, {"comment_id": "df3zocg", "post_id": "606si5", "comment": "News alert with this popped up on my phone as I was trying to teach myself Johnny B Goode. Just another reason to learn to play it. \nRIP Chuck Berry"}, {"comment_id": "df3xg2r", "post_id": "606si5", "comment": "R.i.p. To a true ledge"}, {"comment_id": "df3wggn", "post_id": "606si5", "comment": "Just posted this without realising that you posted it first, my mistake, it's a sad day:-("}, {"comment_id": "df3yzb0", "post_id": "606si5", "comment": "This guy is my main inspiration on guitar. I cant believe this. im actually sad"}, {"comment_id": "df41g3e", "post_id": "606si5", "comment": "If you can't play Chuck Berry, you can't play Rock n' Roll. For those of you who haven't learned any of his tunes, do it now. You'll see where 90% of what we call \"Rock n' Roll\" comes from and that's not an overstatement. \n\nBe sure to check out \"Hail! Hail! Rock n' Roll\", which is a great documentary about Chuck made several years ago, featuring Keith Richards leading and all-star backing band. "}, {"comment_id": "df41s6t", "post_id": "606si5", "comment": "No fucking way... rip"}, {"comment_id": "df3zp8h", "post_id": "606si5", "comment": "The man had a monumental impact on the electric guitar. I hope he is at peace."}, {"comment_id": "df405or", "post_id": "606si5", "comment": "I'd kind of like him to teach Jerry what he was trying for on Run Run Rudolph!!!!!"}, {"comment_id": "df406fm", "post_id": "606si5", "comment": "What truly astounds me is that he was still going strong, about to release a new studio album at 90."}, {"comment_id": "df409bt", "post_id": "606si5", "comment": "Watching [this](https://www.youtube.com/watch?v=V2i9RvBOSZ4&t=70s) in remembrance. RIP Chuck. "}, {"comment_id": "df41814", "post_id": "606si5", "comment": "One of the main guys that got me playing guitar. He really helped me along in my early blues playing days and learning to solo."}, {"comment_id": "df41u9w", "post_id": "606si5", "comment": "I remember the first time I heard Johnny B. Goode. I was like, this can't be rock, the guitar is too clean!\n\nThen I listened to the whole thing and had my mind changed about what rock and roll really was. \n\nThank, Chuck, and may you rest in peace."}, {"comment_id": "cmnw4xa", "post_id": "2ok4kh", "comment": "I bought the app, and it's STILL trying to get my to buy the app ??? -_-"}, {"comment_id": "cmnyibt", "post_id": "2ok4kh", "comment": "STOP RESISTING!"}, {"comment_id": "cmo22fm", "post_id": "2ok4kh", "comment": "[deleted]"}, {"comment_id": "cmo5bkt", "post_id": "2ok4kh", "comment": "Holy fucking shit tell me about it. I paid money for that app and they STILL have the nerve to send push notifications with spam telling me to buy shit? Jesus, so infuriating, wish I could get my money back."}, {"comment_id": "cmnyfdz", "post_id": "2ok4kh", "comment": "I bought the app on my old phone before I broke and for some reason it's the only app that I apparently have to buy again. If I wasn't on mobile I would mash my keyboard right now just thinking about all the frustrations this new digital age of cloud-sourced software has given me."}, {"comment_id": "cmoeark", "post_id": "2ok4kh", "comment": "Yeah this is what really pissed me off. I bought the app and the first thing I see is a popup telling me to buy the tuner and chord library. Then after caving in and buying THAT I get a popup telling me to buy lessons. Like, fucking seriously?"}, {"comment_id": "cmo4k7j", "post_id": "2ok4kh", "comment": "Lol i get the same thing?! 50% off app of you buy the app... But I've already bought your app!! "}, {"comment_id": "cmoc1is", "post_id": "2ok4kh", "comment": "This happened to me, too. "}, {"comment_id": "cmocxxc", "post_id": "2ok4kh", "comment": "I bought the app too then it tries to get you to buy features within the app its pretty stupid."}, {"comment_id": "cmomkrx", "post_id": "2ok4kh", "comment": "#"}, {"comment_id": "cmoobsr", "post_id": "2ok4kh", "comment": "Came here to say this.   We can leave them a piece of mind with negative reviews. "}, {"comment_id": "cmo1154", "post_id": "2ok4kh", "comment": "I keep seeing ads for candy crush but I already HAVE the app"}, {"comment_id": "cmo09ky", "post_id": "2ok4kh", "comment": "Just ignore the OP. He's a fucking idiot. I mean, he's saying something to ultimateguitar, but he posted it here. What a fucking retard. If he wanted to do it right, he would go to [the official contact page](http://www.ultimate-guitar.com/about/contact.htm), but no, he's shitting up THIS part of the internet with his stupid fucking problems. \n\n/u/native411, I hope you have a major flood and lose all of your guitars. "}, {"comment_id": "cmny00b", "post_id": "2ok4kh", "comment": "I miss OLGA so much :("}, {"comment_id": "cmo1fzn", "post_id": "2ok4kh", "comment": "I miss mxtabs."}, {"comment_id": "cmo3jua", "post_id": "2ok4kh", "comment": "I remember years ago, I used to use Tabcrawler"}, {"comment_id": "cmo1ayl", "post_id": "2ok4kh", "comment": "OLGA and the old mysongbook. Every shitty guitar tab site that exists today plagiarized those two sites and was built upon their ruins."}, {"comment_id": "cmo2h2i", "post_id": "2ok4kh", "comment": "Shit. I had totally forgotten about OLGA. That site was amazing."}, {"comment_id": "cmolix5", "post_id": "2ok4kh", "comment": "[Well then go back in time](https://web.archive.org/web/20060610121532/http://www.olga.net/)"}, {"comment_id": "cmod9ls", "post_id": "2ok4kh", "comment": "OLGA pretty much taught me how to play 13 years ago.  What a gold mine for a 10 year old just starting out.  "}, {"comment_id": "cmnyww9", "post_id": "2ok4kh", "comment": "\nAnd HC."}, {"comment_id": "cmohsw9", "post_id": "2ok4kh", "comment": "Didn't ultimate guitar just download all of the online guitar archive and make an ad-based business out of it?  It was so long ago."}, {"comment_id": "cmobfyz", "post_id": "2ok4kh", "comment": "Anyone remember taborama? First tab site I ever found when I was about 12. That was 10 years ago."}, {"comment_id": "cmoc27a", "post_id": "2ok4kh", "comment": "Oh, wow. I'd forgotten OLGA every happened. That was an excellent site.\n"}, {"comment_id": "cmoeqxt", "post_id": "2ok4kh", "comment": "OLGA! What ever happened to that site? I used that so much 10-15 years ago..."}, {"comment_id": "cmx37m8", "post_id": "2ok4kh", "comment": "OLGA - Blast from the past! Those were the days ;)"}, {"comment_id": "cmoalmc", "post_id": "2ok4kh", "comment": "Sadly enough, a large portion of this subreddit probably has no clue what OLGA was."}, {"comment_id": "cmnv9e4", "post_id": "2ok4kh", "comment": "Songsterr is great!"}, {"comment_id": "cmnxqnq", "post_id": "2ok4kh", "comment": "Holyyyy shit. You just made my day. I've been so frustrated with UG lately."}, {"comment_id": "cmnz3vr", "post_id": "2ok4kh", "comment": "They even have a windows phone app. Praise to you for sharing. \n\nEdit: I take that back. Songsterr is some music quiz app for windows phone. That's some BS...\n\nEdit II: So I suggested to a developer to make an app for the site, and he found that he can. http://www.reddit.com/r/windowsphone/comments/2okpqy/student_developer_here_what_are_some_apps_we_need/cmovmus\n\nThere is hope! Comment on and like that comment to encourage the developer! "}, {"comment_id": "cmnxfcd", "post_id": "2ok4kh", "comment": "Came here to suggest this,  been using for years,  and OP was wondering about mobile support I believe songsterr has an app that is decent as well.  Love Songsterr!! "}, {"comment_id": "cmnzib1", "post_id": "2ok4kh", "comment": "I find the selection/range of tabs isn't anywhere near as good (ver 1/2/3/4 etc anyone?) and a lot of tabs I can find better elsewhere since they slap up some mediocre one.\n\nComments are just about dead unlike UG. Usually some helpful/good tips and suggestions.\n\nA great alternative, just some flaws."}, {"comment_id": "cmo24l0", "post_id": "2ok4kh", "comment": "Thanks. I've been using UG for nearly nine years. That place has gone to shit."}, {"comment_id": "cmo5r7r", "post_id": "2ok4kh", "comment": "If only they'd stick to a business model. \n\nI paid $5 one-time purchase several years ago. Then they upped the price to $20. Then $10. Then $100. 100 dollars for a tab app. \n\nFinally they went to $5/month, but I'm still grandfathered in. "}, {"comment_id": "cmnwscr", "post_id": "2ok4kh", "comment": "Wow, this is awesome! A billion times better than UG, thanks for posting."}, {"comment_id": "cmnwd3n", "post_id": "2ok4kh", "comment": "Yeah never looked back since I found Songsterr, even paid for subs and its even better!"}, {"comment_id": "cmnxupw", "post_id": "2ok4kh", "comment": "I found it and instantly got pissed that I bothered to get guitar pro"}, {"comment_id": "cmnzkq8", "post_id": "2ok4kh", "comment": "Not only that, but a lot of the tabs are usually the best one copied over from UG, so you're not missing out on anything.  The only reason I still go to UG is to get the guitar-pro versions."}, {"comment_id": "cmo1gn1", "post_id": "2ok4kh", "comment": "I like chordie.com"}, {"comment_id": "cmo3615", "post_id": "2ok4kh", "comment": "Great recommendation, songsterr is awesome! I would even say paying the $5 for the iPhone app is worth it since you can check out the tabs on your phone. This comes in handy at rehearsals when you need to look up a part and don't have your laptop with you. "}, {"comment_id": "cmo65ji", "post_id": "2ok4kh", "comment": "Came here to say this actually.  They have more in depth resources and none of the shitty popups."}, {"comment_id": "cmog77y", "post_id": "2ok4kh", "comment": "> Songsterr\n\nOMG you genius! this app is awesome and totally new to me. THANKS!"}, {"comment_id": "cmo464g", "post_id": "2ok4kh", "comment": "I also like Jellynote"}, {"comment_id": "cmo8ck0", "post_id": "2ok4kh", "comment": "[deleted]"}, {"comment_id": "cmo8zug", "post_id": "2ok4kh", "comment": "The site is good but their iPad app is worth every cent. "}, {"comment_id": "cmobui5", "post_id": "2ok4kh", "comment": "I didn't even know this existed, I freaking love you. It's so much easier for me to \"play along\" that to try to solo learn things, this is great."}, {"comment_id": "cmoj6xu", "post_id": "2ok4kh", "comment": "Thank you for this suggestion, I've been getting pretty weary with ultimate-guitar the past few years, honestly the best part about UG is the comments section which usually makes small corrections. (even though the comments are all like 10 years old now.) What is even the deal with the loud chord that blares when you load up a tab. Stop bloating my system UG. Go home UG you're drunk!!!"}, {"comment_id": "cmomk9h", "post_id": "2ok4kh", "comment": "I've been praising Songsterr ever since I first came across it, and I'm constantly uploading new material there.\n\nUG was crap since its inception. Let it die. Faster."}, {"comment_id": "cmopuxu", "post_id": "2ok4kh", "comment": "This place is awesome, thanks! "}, {"comment_id": "cmoss7p", "post_id": "2ok4kh", "comment": "The only problem I have with Songsterr is that it never has songs I want.\n\nAlthough, the last time I used it was quite a while ago, probably over a year. Maybe I should check back."}, {"comment_id": "cmnxwps", "post_id": "2ok4kh", "comment": "My only frustration with Songsterr is that I half-wrote a program that does something similar to its play through feature. I'm still working on it but I've turned it into something else now. \n\nI love Songsterr. And to touch on a comment I made elsewhere in this thread, their advertisements aren't that great but are so much better than UG's."}, {"comment_id": "cmo16qn", "post_id": "2ok4kh", "comment": "Is there any way to download the tabs from there?"}, {"comment_id": "cmnvusv", "post_id": "2ok4kh", "comment": "Agreed!\n"}, {"comment_id": "cmnvfj4", "post_id": "2ok4kh", "comment": "Songsterr.com is my goto. Really great site. Edit: might not he good for mobile though."}, {"comment_id": "cmnvw26", "post_id": "2ok4kh", "comment": "Their mobile app is good though! I think it costs a buck or two."}, {"comment_id": "cmnut92", "post_id": "2ok4kh", "comment": "ad-Block Plus gets a good workout on that site.   And with the 'select an element to hide' plugin you can even get rid of that annoying fucking music player app they throw at the bottom of every TAB page.\n"}, {"comment_id": "cmnuw0t", "post_id": "2ok4kh", "comment": "Can Ad-Block run through iOS/Mobile? I browse on my iPhone since it's easier than having my laptop around and more portable but I'm at wits end with how they've made this experience for me."}, {"comment_id": "cmnv27t", "post_id": "2ok4kh", "comment": "Oh god, and the articles? Seriously, who gives a shit what Ted Nugent and the fucking Gallagher brothers have to say about anything? "}, {"comment_id": "cmnwgl6", "post_id": "2ok4kh", "comment": "But what does Dave Mustaine think?"}, {"comment_id": "cmnxhu6", "post_id": "2ok4kh", "comment": "The Gallagher brothers I do, only because it's usually hilarious. Nugent can get fucked though. "}, {"comment_id": "cmo0rxn", "post_id": "2ok4kh", "comment": "\"Ted Nugent Slams the Gallagher Brothers for Dave Mustaine's Opinion on Global Warming\""}, {"comment_id": "cmnwjdw", "post_id": "2ok4kh", "comment": "I actually use the reviews section as a way of keeping track of when albums come out/find new music.\n\nI don't actually read the reviews, though.\n\nAlso, part of the problem is they are on a 24 hour news cycle, but exclusively for rock music news, and there isn't enough quality rock news to feed the beast."}, {"comment_id": "cmnwpsr", "post_id": "2ok4kh", "comment": "That website is basically the Slash daily news. "}, {"comment_id": "cmoji03", "post_id": "2ok4kh", "comment": "Or the \"Lessons\" by Tom Hess.\n\nHere's 10 practice tips that are hyper fucking obvious. 4 of which are useful to beginners, but all 10 are adverts for my services!"}, {"comment_id": "cmo7tum", "post_id": "2ok4kh", "comment": "The theory articles are worse. So much bullshit about modes, week after week. Ugh..."}, {"comment_id": "cmnyb36", "post_id": "2ok4kh", "comment": "I actually saw a post by some guy on their forum asking if he should ask that girl out. Seriously? On a guitar site?"}, {"comment_id": "cmofqwa", "post_id": "2ok4kh", "comment": "You earned this"}, {"comment_id": "cmnw41l", "post_id": "2ok4kh", "comment": "I hate Ted Nugent and his toothy grin."}, {"comment_id": "cmnw6lu", "post_id": "2ok4kh", "comment": "You mean news about the industry? Then don't tell click the articles, because maybe people actually care about what those artists have to say. "}, {"comment_id": "cmnxak9", "post_id": "2ok4kh", "comment": "My latest gripe with that site is that the popular Guitar Pro files seem to be blocked by the publisher, yet they seem to be available with their Pro Tab paid section.  These guys are shameless in their attempts to grab money."}, {"comment_id": "cmnyktt", "post_id": "2ok4kh", "comment": "They probably only get to provide those because they paid the publishers which is why you only get them if you have paid account."}, {"comment_id": "cmo0uru", "post_id": "2ok4kh", "comment": "Without starting a war, I never use that site, so I don't know, but how do people expect websites to make money?  People block ads, and don't want to pay for anything.  I'm not sure what people believe makes those sites work profitably.\n\nIt takes money to operate a website, and that money has to come from somewhere.\n\nSo again, I'm not trying to ignite a war, but I truly don't understand what people think makes business run. "}, {"comment_id": "cmnxgfj", "post_id": "2ok4kh", "comment": "I was wondering this too. I had a few tabs bookmarked which were fine and dandy.\n\nThen as of about a year ago the really popular ones are now \"blocked\" but I can get them just fine if I go with the pro tab version?\n\n What the fuck? \n\n\n**Edit:** Spelling."}, {"comment_id": "cmoin5b", "post_id": "2ok4kh", "comment": "Late to the party, but tux guitar is an alternative. On ug, go to your pro tab of choice, scroll to the bottom, click download, and open in tux guitar. "}, {"comment_id": "cmnynla", "post_id": "2ok4kh", "comment": "Have you noticed that the star rating for tabs will always be 4 or lower if there's a Guitar Pro or Pro Tab one available? "}, {"comment_id": "cmnv64w", "post_id": "2ok4kh", "comment": "I only use it for looking up real quick chords on my phone (on the app). Other than that, you should switch to Songsterr, to me it's the best free tab tool on the internet. "}, {"comment_id": "cmo37x2", "post_id": "2ok4kh", "comment": "I used ThePirateBay to download the app. Best $0 I ever spend on UG."}, {"comment_id": "cmnw453", "post_id": "2ok4kh", "comment": ">  only use it for looking up real quick chords on my phone (on the app).\n\nSame here, and I only have the app from when it was free on Amazon otherwise I'd have never bothered with it. "}, {"comment_id": "cmnvha0", "post_id": "2ok4kh", "comment": "Yeah I agree the mobile site sucks, but I have never really had an issue with ads because I contributed a tab about 7 years ago and it's ad free because of it."}, {"comment_id": "cmnww4x", "post_id": "2ok4kh", "comment": "Same here. Took me about 30 minutes to type out the chords to an obscure punk song, never had ads on the site since."}, {"comment_id": "cmobf76", "post_id": "2ok4kh", "comment": "Fuck that, their site is garbage. If you tab a song and no one votes on it and it gets approved by a moderator, no one will be able to view it. A message appears when you click on the tab saying \"the creator has removed this tab,\" which is absolutely not true. I can view it in my dashboard, but not through their search. So basically, no one will ever be able to view it unless some people vote on it blindly."}, {"comment_id": "cmoc5mf", "post_id": "2ok4kh", "comment": "WHUT."}, {"comment_id": "cmnxtge", "post_id": "2ok4kh", "comment": "yea I haven't used Ultimate Guitar in a while. I thought the site was dead? It's like the 9Gag of tab sites...\n\nIt's a pathetic cycle. People stopped using it because of the shitty advertisements and so, as a response to losing ad revenue, they've gotten more hardcore with ads. \n\nIf anyone from Ultimate-Guitar reads this, here's some advice from a web developer: users don't like intrusive ads. Your product is your user base, which you sell to advertisers. No product, no sales. Of course, you also rely on your users being willing participants. Fortunately for us, unfortunately for you, we have tools like AdBlock Plus with which we can negate intrusive ads. That said, this is used as a mechanism to protect our computers and ourselves against the aggressive, and frankly offensive, methods by which you've chosen to advertise to us. Fortunately for you, though, AdBlock Plus offers [a list of criteria that ads must meet to not be blocked by ABP.](https://adblockplus.org/en/acceptable-ads#criteria) This isn't actually a difficult set of rules to meet, or unreasonable. You are welcome to sell my page hits to advertisers if you meet the above criteria with your ads. Otherwise, though, I do not consent to being sold and so your advertisements will not reach me in any manner you could legally undertake."}, {"comment_id": "cmnzhak", "post_id": "2ok4kh", "comment": "All good points, however I can tell you that they don't give 2 bits what you think"}, {"comment_id": "cmo7x8u", "post_id": "2ok4kh", "comment": "It's got an active forum community. "}, {"comment_id": "cmnyrvp", "post_id": "2ok4kh", "comment": "It is fucking bullshit. I contributed a few tabs (all rated 5)to the site a couple of years ago when i was young and naïve. Now they want to charge me to view content i created? Ultimate guitar can fuck off."}, {"comment_id": "cmo4yrj", "post_id": "2ok4kh", "comment": "Haha fuck. I never thought of that. Asshats have heaps of mine"}, {"comment_id": "cmon6o0", "post_id": "2ok4kh", "comment": "The content that you \"created\" is illegally published transcriptions of someone else's work. You have no rights to it and the publisher's UG pays have every right to charge."}, {"comment_id": "cmnw4gm", "post_id": "2ok4kh", "comment": "Not to mention I bought their app with the tools a few years back and an update took the tools (tuner, metronome etc) and moved them to another stupidly expensive app. They'll never get another click from me. "}, {"comment_id": "cmo0hvj", "post_id": "2ok4kh", "comment": "You should try Jellynote I love it, even more than songsterr!"}, {"comment_id": "cmo4bhq", "post_id": "2ok4kh", "comment": "Just checked out Jellynote.\n\nGreat shout!"}, {"comment_id": "cmo4xnm", "post_id": "2ok4kh", "comment": "I love jelly note purely for the piano parts and the guitar music notation. Awesome"}, {"comment_id": "cmob48o", "post_id": "2ok4kh", "comment": "This needs to be higher up. The thing about UG and songsterr is that, although they teach you to play a song, they remove the notation and theory from it. With Jellynote, even if your just playing tabs, you still have the actual music thrown at you a little bit."}, {"comment_id": "cmoinde", "post_id": "2ok4kh", "comment": "Jellynote looks great.  Thanks."}, {"comment_id": "cmnv5se", "post_id": "2ok4kh", "comment": "When I was first learning it was my goto site for learning new stuff and it was awesome, but these days it's just as easy to go on YouTube with ads that you can actually skip. "}, {"comment_id": "cmnv7in", "post_id": "2ok4kh", "comment": ">go on YouTube with ads that you can actually skip.\n\n\nAd-block plus gets rid of them too ;-)"}, {"comment_id": "cmnwuei", "post_id": "2ok4kh", "comment": "Not to mention why would they put SOUND ads that activate two minutes in when they very well know we are probably playing along with a song. That site sold out so hard and it's insulting "}, {"comment_id": "cmovsn6", "post_id": "2ok4kh", "comment": "I literally installed ad block because of this. Instead of me seeing ads before, I see 0.\n\n"}, {"comment_id": "cmnwuuv", "post_id": "2ok4kh", "comment": "Damn it's a shame, ultimate-guitar used to be the shit. \n\nFUCK YOUR 'pro'-tabs! "}, {"comment_id": "cmogy4s", "post_id": "2ok4kh", "comment": "They're actually just reposts of the guitar pro submissions. "}, {"comment_id": "cmo1aam", "post_id": "2ok4kh", "comment": "What really burns me about these sites is so much of their content is just the old [OLGA](https://en.wikipedia.org/wiki/On-line_Guitar_Archive) archive. So they take the hard work of volunteers from past decades and wrap it all up in their bullshit ads and paid apps. Blah. Fuckers. All of them."}, {"comment_id": "cmnzq3l", "post_id": "2ok4kh", "comment": "I don't really understand, can someone explain? I just go to the tabs and download the guitarpro files (I use tuxguitar, which is free). Run adblock on top of that and I don't see the problem.\nedit: oh, I see this is on mobile, is that the issue?"}, {"comment_id": "cmo7blx", "post_id": "2ok4kh", "comment": "I have adblock installed on my laptop and I can't download guitarpro files without getting the ad - what am I doing wrong?"}, {"comment_id": "cmo0bih", "post_id": "2ok4kh", "comment": "NoScript. Embrace it. I've been using this site without any javascript enabled, and I barely knew this app existed, let alone see anything about it.\n\nOh, and AdBlock lets you hide sections of pages. If you don't like something, just remove it. I have 90% of Facebook's newsfeed page disabled. Almost the entire left column, the Trending bullshit, all gone. Youtube comments disabled. Reddit sidebars...disabled. The web is a much cleaner place."}, {"comment_id": "cmo1q0a", "post_id": "2ok4kh", "comment": "Guys, if you can handle a bit of foreign language, here in Brazil we have [Cifra Club](http://www.cifraclub.com.br/) and [Cifras.com.br](http://www.cifras.com.br/).\n\nJust write the song you want in the search bar and bam. Many tabs are in english too, though the sites aren't. I personally prefer Cifra Club, there's a ton of options like raising or lowering key, showing chords in the tab, autoscroll, etc. Very very useful. and they're both completely free and bullshit-less."}, {"comment_id": "cmo8gu2", "post_id": "2ok4kh", "comment": "Thank you so much for those links. I've been looking for tabs for Novos Baianos and other Brazilian artists for a while now.\n\nNice name by the way too. Viva Zapatismo! "}, {"comment_id": "cmo2b20", "post_id": "2ok4kh", "comment": "Obrigado."}, {"comment_id": "cmo4vmd", "post_id": "2ok4kh", "comment": "OLGA was once the mecca. Alas those bygone days."}, {"comment_id": "cmo5lfo", "post_id": "2ok4kh", "comment": "I hate that site for these very resons.  Boycott."}, {"comment_id": "cmovt4b", "post_id": "2ok4kh", "comment": "Ad block."}, {"comment_id": "cmo7u9a", "post_id": "2ok4kh", "comment": "Chordie.com is awesome."}, {"comment_id": "cmnw4m0", "post_id": "2ok4kh", "comment": "And it sometimes plays that random chord when you've been on a page for a while, too. That always either scares the shit out of me or interrupts the song I'm trying to play along to."}, {"comment_id": "cmo7y5v", "post_id": "2ok4kh", "comment": "What I dislike most about UG is the dumb TabPro thing. I don't mind that the service exists, I just wish it didn't leech off of other users tablature without crediting them. Just a simple ''This tab was taken from the Guitar Pro/Power Tab, submitted by <username>'' would be great.\n\nThen there's the fact that literally every TabPro tab is automatically rated at 5 stars, regardless of it's actual accuracy. According to the ratings, there isn't a single TabPro tab that isn't perfect."}, {"comment_id": "cmoec20", "post_id": "2ok4kh", "comment": "I would like to thank Ultimate Guitar's mobile site for driving me to learn how to figure parts out by ear in only a few listens. "}, {"comment_id": "crnj6i0", "post_id": "2ok4kh", "comment": "Guitarists HATE them! Use this one secret to increase your fret board size by 5 INCHES! \n"}, {"comment_id": "cmnvkml", "post_id": "2ok4kh", "comment": "When I go on it on mobile I just jump straight to the search box and start typing the song real quick, so I don't get the ad. \n\nIf that doesn't work then you might also want to try to click on the URL as soon as you go in the website then hit the x to clear the address as if you were to enter another address, I think this stops the downloading of the page whilst still keeping the search bar available and functional."}, {"comment_id": "cmnwf9x", "post_id": "2ok4kh", "comment": "Fuck yes, that site is infuriating. Just went to it to see if anything had changed. Touched the screen once and an ad popped up and then on to iTunes Store for the app. Ridiculous."}, {"comment_id": "cmnxkco", "post_id": "2ok4kh", "comment": "Songsterr. High quality tabs."}, {"comment_id": "cmoaorq", "post_id": "2ok4kh", "comment": "On mobile it sucks donkey nuts but I don't mind it *that* much on a computer. I pretty much only use it for quickly checking chords & downloading guitarpro files.\n\nSeriously, get adblock plus people. It helps a fuckton."}, {"comment_id": "cmoeafk", "post_id": "2ok4kh", "comment": "A tab takes a decade to load. Then it makes this stupid string plucking sound. Ultimate Guitar just pisses me off. However they are good for guitar pro tabs. "}, {"comment_id": "cmohrxq", "post_id": "2ok4kh", "comment": "Thank fuck, someone finally said it. Complete garbage. So much things being sold there. Asking for money on every damn click. \n\nSongsterr here i come."}, {"comment_id": "cmo0sh1", "post_id": "2ok4kh", "comment": "Hey OP, make sure after you find a alternative website you go ahead and buy the ultimate guitar pro app:\n\nhttps://plus.ultimate-guitar.com/tab-pro/\n\nWherever you are, wherever you go, we will find you fucker.\n"}, {"comment_id": "cmnvzys", "post_id": "2ok4kh", "comment": "God bless you!!!finally someone said what I have been thinking the last two years!!!"}, {"comment_id": "cmo718y", "post_id": "2ok4kh", "comment": "WE ARE THE ALTERNATIVE.  \n  \nI had the same epiphany you had about 3 years ago.  That's when I found /r/guitar, became a mod, and have done everything I can to make it an actual resource for guitar playing (short of a great tab collection - sorry about that).  \n  \nAnyway, yes.  UG has sucked the big one for a while and continues to go down the road to crap.  I left when they made all their text active for advertisements and started censoring the shit out of anything you posted.  \n  \n  \nEdit:  Saw this below, and I'll agree.  Songster is great.  I've had it for a while now, and it's amazing.  Worth the price.    \n  \n\n"}, {"comment_id": "cn8593e", "post_id": "2ok4kh", "comment": "Your ear! Seriously, once I started using that thing I truly felt like I officially passed through the beginner stage."}, {"comment_id": "crk37wq", "post_id": "2ok4kh", "comment": "Real talk my brutha! Fuck ultimate-guitar. The ads that start randomly playing as youre trying to learn a song are annoying as fuck. \n\nAlso the website's culture is horseshit and they do their best to silence anyone who who complains."}, {"comment_id": "cmnwjdf", "post_id": "2ok4kh", "comment": "I agree. I'm so sick of it. Barely use it anymore and use to use it multiple times a day. They should fire their advertising team for making their site unusable. You can make adds less obnoxious"}, {"comment_id": "cmnwqv7", "post_id": "2ok4kh", "comment": "I know right, it frustrates me so much that I just started writing my own fucking songs instead. "}, {"comment_id": "cmnxwp3", "post_id": "2ok4kh", "comment": "If you're not on mobile it's fine, on mobile it's totally unbearable. "}, {"comment_id": "cmnycoj", "post_id": "2ok4kh", "comment": "Actually, the site is mostly useless now because a huge number of tabs have been taken down."}, {"comment_id": "cmoxiwv", "post_id": "2ok4kh", "comment": "Depends where you live"}, {"comment_id": "cmoxiwy", "post_id": "2ok4kh", "comment": "Depends where you live"}, {"comment_id": "cmnzyly", "post_id": "2ok4kh", "comment": "Ohmigod - I totally, unreservedly, irrefutably, unquestionably AGREE with you!\n\nAargh!!!!"}, {"comment_id": "cmo2gke", "post_id": "2ok4kh", "comment": "I have left reddit for [Voat](https://voat.co/) due to years of admin mismanagement and preferential treatment for certain subreddits and users holding certain political and ideological views.  \n\n   The situation has gotten especially worse since the appointment of Ellen Pao as CEO, culminating in the seemingly unjustified firings of several valuable employees and bans on hundreds of vibrant communities on completely trumped-up charges.  \n\n   The resignation of Ellen Pao and the appointment of Steve Huffman as CEO, despite initial hopes, has continued the same trend.  \n\n   As an act of protest, I have chosen to redact all the comments I've ever made on reddit, overwriting them with this message.  \n\n   If you would like to do the same, install [TamperMonkey](https://chrome.google.com/webstore/detail/tampermonkey/dhdgffkkebhmkfjojejmpbldmpobfkfo) for Chrome, [GreaseMonkey](https://addons.mozilla.org/en-us/firefox/addon/greasemonkey/) for Firefox, [NinjaKit](https://github.com/os0x/NinjaKit) for Safari, [Violent Monkey](https://addons.opera.com/en/extensions/details/violent-monkey/) for Opera, or [AdGuard](http://adguard.com/) for Internet Explorer (in Advanced Mode), then add [this GreaseMonkey script](https://greasyfork.org/en/scripts/10905-reddit-overwrite-extended).   \n\n Finally, click on your username at the top right corner of reddit, click on comments, and click on the new OVERWRITE button at the top of the page. You may need to scroll down to multiple comment pages if you have commented a lot.  \n\n   After doing all of the above, you are welcome to join me on [Voat](https://voat.co/)!"}, {"comment_id": "cmo3axt", "post_id": "2ok4kh", "comment": "I had a Tab Pro (or whatever it is called) subscription as it wasnt that expensive. It fucking keeps asking you to buy lifetime subscriptions and the fucking tab player is broken, too. Everything ever made by UG or their affiliates is bad."}, {"comment_id": "cmoxm6u", "post_id": "2ok4kh", "comment": "The tab pro files are just the Guitar Pro and Power Tab files they harvested from other sites. They simply convert them to their own format. "}, {"comment_id": "cmoxm79", "post_id": "2ok4kh", "comment": "The tab pro files are just the Guitar Pro and Power Tab files they harvested from other sites. They simply convert them to their own format. "}, {"comment_id": "cmo3uy8", "post_id": "2ok4kh", "comment": "Here, try [this](http://www.songsterr.com/)!"}, {"comment_id": "cmo3x65", "post_id": "2ok4kh", "comment": "Just go to 911 tab and use the first well rated link that isn't Ultimate Guitar. "}, {"comment_id": "cmo4eq3", "post_id": "2ok4kh", "comment": "I can't prove it, but I' ve suspected for a while that they have been publishing tab pro files (their format you have to pay for) and removing the other good tabs so you have to pay to see an accurate one."}, {"comment_id": "cmoxn9o", "post_id": "2ok4kh", "comment": "The tab pro files are just the guitar pro and power tab files converted tontheiir own proprietary format."}, {"comment_id": "cmoxn9u", "post_id": "2ok4kh", "comment": "The tab pro files are just the guitar pro and power tab files converted tontheiir own proprietary format."}, {"comment_id": "cmocnyr", "post_id": "2ok4kh", "comment": "well i use songsterr.com, its pretty good!"}, {"comment_id": "cmoe3x8", "post_id": "2ok4kh", "comment": "If you want to give it a shot, you can download huge collections of guitar pro tabs from torrent websites. I haven't done it before so I don't know what kind of selection it is, but I'm guessing they're just data dumps of various sizes from different torrent sites - they're usually ~100MB in size and claim to have ~60k tabs. Unless all the tabs are utter shite, this + TuxGuitar sounds like basically all you need :)"}, {"comment_id": "f1878se", "post_id": "d881hh", "comment": "It's awesome how he speaks with such confidence about octaves and scales. You can tell he's really into it. He'd make a great instructor himself someday."}, {"comment_id": "f1896oc", "post_id": "d881hh", "comment": "Thanks heaps! I've long been fascinated by theory and am really glad he's taken to it. Again, need to give credit to our awesome teacher here who indulges us in all sorts of discussion about how music works."}, {"comment_id": "f1a8bez", "post_id": "d881hh", "comment": "[This is Sam writing  on my dad's account] Thank you so much for the praise! It's so nice to see I'm a hit, and thank you for contributing!"}, {"comment_id": "f187i0r", "post_id": "d881hh", "comment": "Wow congrats! And I'm amazed at how good he is at presenting. I know I was too shy at that age to give a good speech in front of my class."}, {"comment_id": "f189dpy", "post_id": "d881hh", "comment": "He was so excited but there was a slight undercurrent of nerves, but his enthusiasm and prep (had him practice the talk with me a couple times beforehand) really paid off. It really helps that it's something he loves, not just something I foisted on him."}, {"comment_id": "f18ozjo", "post_id": "d881hh", "comment": "Dude no kidding. Did he practice public speaking every day for a year too? Better than half the adults I encounter..."}, {"comment_id": "f1a8lro", "post_id": "d881hh", "comment": "[This is Sam writing  on my dad's account] Thanks. It didn't take a lot, but I'm glad you upvoted. Blaze On! (Phish Pun)"}, {"comment_id": "f18lmzu", "post_id": "d881hh", "comment": "That's awesome! I cracked up when he started playing first tube for his like.. 3rd grade class? haha. \n\n\"That's by a band called Phish, hippies follow them around and do loads of drugs. Anyway, this is the minor scale!\"\n\nYour kid is off on a great track, keep up the great work to the both of you!"}, {"comment_id": "f18uzkm", "post_id": "d881hh", "comment": "He knew more Grateful Dead songs than the average toddler knew Barney songs. String Cheese was his favourite for a long time, but he's been enjoying a lot of Phish lately. Had a *great* TAB experience at Lockn' this year -- one of those \"they played everything I wanted\" shows (inc. First Tube!). \n\n[Got a bit of feedback that he's really turning on to Phish](https://imgur.com/a/qtyKBmY)."}, {"comment_id": "f1a90ou", "post_id": "d881hh", "comment": "[This is Sam writing  on my dad's account] Thanks, man."}, {"comment_id": "f189c0y", "post_id": "d881hh", "comment": "Love it good job my friend!!!                               Hopefully he’ll  be hooked for life"}, {"comment_id": "f189z63", "post_id": "d881hh", "comment": "We used to wonder if he'd take to music like we did. His first show was Furthur at 2.5 (already knew UJB, KCJ, Eyes, and several others),and his first festival was the next year. We started binging when he woke up the next January asking when festival season started.... \n\nI'm so glad Matt is giving us a great foundation in theory and how things go together, because the Little Man will be able to appreciate, adopt and grow so much over the rest of his life. Thanks!"}, {"comment_id": "f1a8ry6", "post_id": "d881hh", "comment": "[This is Sam writing  on my dad's account] You Bet I will!"}, {"comment_id": "f18juyf", "post_id": "d881hh", "comment": "He's already got the locks, and he's working on the chops. Kid is golden."}, {"comment_id": "f1a9jxy", "post_id": "d881hh", "comment": "[This is Sam writing  on my dad's account] Thank you ridculously so much!"}, {"comment_id": "f186jzp", "post_id": "d881hh", "comment": "So much more fun ahead! (protect those eardrums dude!)"}, {"comment_id": "f18916b", "post_id": "d881hh", "comment": "Thanks!! We keep giggling about how awesome it is now, but just how incredible it will be once we've gotten really proficient in the rudiments. So much to look forward to! \n\n(RE: ear protection --- you're so right! I use [Dubs](https://getdubs.com/) when I'm at a show. He has over-the-ear ear protectors when we go to festivals and he wants to [head to the rail](https://imgur.com/a/89dZKXL), but usually we're far enough back that the volume is safe, but we [protect them when necessary](https://imgur.com/a/6KRtSDS).)"}, {"comment_id": "f18fi3s", "post_id": "d881hh", "comment": "I remember this post! It's been a year already? Thanks for sharing! You're seriously awesome dad and you've got pretty damn awesome kid too."}, {"comment_id": "f1a2x9a", "post_id": "d881hh", "comment": "Can you believe it? Crazy how time flies. I was going to PM people who helped out in that thread. He ended up picking out a Yamaha JR2. It was sublime experience. He picked up each one (the store had about six or seven in the right style and price range) and spent an hour or two going back and forth between them, plucking the strings, listening to them, feeling them. It really was like watching him fall in love for the first time. Thanks for your help and advice!"}, {"comment_id": "f18a3ge", "post_id": "d881hh", "comment": "That's Really Awesome! Keep Up!"}, {"comment_id": "f18ml0s", "post_id": "d881hh", "comment": "Thanks. We had a blast at last night's practice and can't imagine stopping now!"}, {"comment_id": "f18cok4", "post_id": "d881hh", "comment": "Well done Sam! Keep up the excellent progress! Remember, Practice doesn't make Perfect, *Practice makes Permanent*!"}, {"comment_id": "f18o632", "post_id": "d881hh", "comment": "> Practice doesn't make Perfect, Practice makes Permanent!\n\nThat's an awesome phrasing, thanks!"}, {"comment_id": "f18kidr", "post_id": "d881hh", "comment": "First of all, this is amazing for him to have kept up with practicing for an entire YEAR when kids have practically non existent attention spans, and it's amazing how much you've supported him and helped him to grow and learn! You both should give yourself some big pats on the back. Second of all, are you telling me that this child in elementary school already understands playing chord inversions on the guitar? That's mind blowing to me. Understanding that on piano is one thing, but being actually able to understand and play them on guitar is a serious accomplishment. I'm not sure that I even started to really understand that until the time I was getting into college!"}, {"comment_id": "f18tjmf", "post_id": "d881hh", "comment": "We love learning together, so yeah, he's got it! Well, much of it. (sometimes more than me). I think our big ah-ha moment for inversions was practicing/learning arpeggios. We started with root on E (and A and so on) and went up clock- and counterclockwise up the neck hitting the roots thirds and fifths to high E and back. Getting those down and really made the triad shapes come alive and not be just some pattern to memorize. \n\nAnd something that *really* helped: Shakedown Street. That opening D minor is very familiar, but when we barred the A on the E string along with it the 'right' sound just popped out of our guitars. Felt sooo good. [Shakedown Street!](https://www.youtube.com/watch?v=8lCMUkqpI7o)\n\n\nAnd, of course, having a great, inspiring teacher in Matt went vast distances!"}, {"comment_id": "f18djf8", "post_id": "d881hh", "comment": "This is freaking cool!!"}, {"comment_id": "f18s872", "post_id": "d881hh", "comment": "I never really managed 'cool' in my life. Turns out I was saving it all for him! Thanks!"}, {"comment_id": "f18f9dw", "post_id": "d881hh", "comment": "You both should be proud of your accomplishments.  You did this together.  It is a memory that you will both carry with you for the rest of your days.\n\nI started when I was about 10 or 11 and in about a years time I gave it up.  Looking back, I was not committed to the process.  (You both obviously are very committed).\n\nNow, 45 years later I am starting from square one.  I know that life will get in the way of practice, so I allow one day of not practicing.  I find this also helps keep me fresh.  There have been a lot of late-night practice sessions.  But I am keeping with my plan.  Only about 3 months into it, but having a blast and moving along nicely.\n\nSo major HIGH FIVES to the both of you and keep up the great work."}, {"comment_id": "f1a2dnt", "post_id": "d881hh", "comment": "Thanks! Isn't it great picking it up regardless of age?"}, {"comment_id": "f18hlci", "post_id": "d881hh", "comment": "Dude, hes gonna be a pro! It's so cool that you support him."}, {"comment_id": "f1bv9hr", "post_id": "d881hh", "comment": "I will be grateful and satisfied as long as he loves music and enjoys playing."}, {"comment_id": "f19txrp", "post_id": "d881hh", "comment": "I'm 15, and I wish my parents allowed me to get a guitar. I used to live next to a guitar center, and I'd go there everyday just to practice. Did this for 2 years, and I got pretty OK. I'd ask my parents if I could get one with my own money, but they'd say no and I'd have to concentrate on school. This was 4 years ago, and haven't touched a guitar since. It's nice to see that some parents are more encouraging. Give you and your son a pat on the back."}, {"comment_id": "f1b83dd", "post_id": "d881hh", "comment": "Had a similar situation. Moved out and bought my own finally then.. What a shame really. Is there any chance your school has guitar classes? Perhaps join those. Then you could tell your parents that you need a guitar at school too, and if they don't still want to get you one the school probably has some so you can atleast practice there. Hope you figure it out dude."}, {"comment_id": "f198lbf", "post_id": "d881hh", "comment": "Dude totally awesome. My son is in a similar boat. We got him his first guitar on his 9th birthday, we play about 6 days a week. Then on his 10th we got him an upgrade.\n\nI'm definitely at the limits of what I can teach him now and looking at getting a home tutor also.\n\nWould love to hear about your practise routine. Songs you like to play. Tools you use etc.\n\nWe have a warm-up routine. We strum to a metronome for 2 mins, then we do hammer on + pull off training 20s reach finger, and 2-3 sets. Then we do a finger spider exercise by Ben Eller, called the punisher https://youtu.be/ra_TbQGH6wg at about 6 mins. We do that until we get to 12th fret.\n\nAlso been learning a lot of whole songs. Various Iron Maiden, Metallica, Judas Priest,  etc.\n\nAlso been using Rocksmith more recently which does a real nice job of gamifying things."}, {"comment_id": "f1ad18a", "post_id": "d881hh", "comment": "[This is Sam writing  on my dad's account] That was me who gave you silver:)"}, {"comment_id": "f18femm", "post_id": "d881hh", "comment": "Dedication, something most way older than him don't have yet including myself. Jealous is an understatement!"}, {"comment_id": "f18fj00", "post_id": "d881hh", "comment": "THAT is how you become a badass guitar player."}, {"comment_id": "f1c3glb", "post_id": "d881hh", "comment": "I would object to the language except we play a lot of Borderlands together."}, {"comment_id": "f186qfq", "post_id": "d881hh", "comment": "Great job!"}, {"comment_id": "f189nqz", "post_id": "d881hh", "comment": "Thanks!"}, {"comment_id": "f185glh", "post_id": "d881hh", "comment": "Hi five!"}, {"comment_id": "f189ger", "post_id": "d881hh", "comment": "Will pass it on and he'll return the favor! (Big thing 'round here is never leave someone hanging). Thanks!"}, {"comment_id": "f18fa4q", "post_id": "d881hh", "comment": "It's great!!"}, {"comment_id": "f18fvbi", "post_id": "d881hh", "comment": "You guys should both be proud!  That's one hell of an accomplishment!  Great work.  I too practice all the time but you may have just inspired me to get back to actual lessons!"}, {"comment_id": "f18hgyf", "post_id": "d881hh", "comment": "Congratulations. Keep playing young man. It will the greatest skill of your life."}, {"comment_id": "f18i9mp", "post_id": "d881hh", "comment": "Well done. And great parenting! I just picked up guitar too and already bought a Fender Squier Mini for my little boy (about to turn 4). He has a lot of growing and maturing to do before he can make something of it, but I'm excited to take that journey with him."}, {"comment_id": "f18ibrb", "post_id": "d881hh", "comment": "fantastic!"}, {"comment_id": "f18kv9q", "post_id": "d881hh", "comment": "It means a lot that he is so excited about the theory he's learned. I would normally encourage beginners, especially kids, to start by learning some simple chords to strum in order that make a song they'd enjoy listening to. Theory can be too boring and cause someone to become frustrated and quit. This dude on the other hand thrives in the theory! He'll have such a great foundation to build off of, can't wait to see him post this video in a few years on his YouTube channel for a goof. I'm sure he'll be able to shred most of us under the table. Keep it up guys, really great to see such enthusiam and genuine passion."}, {"comment_id": "f18kyri", "post_id": "d881hh", "comment": "Awesome job. Keep it up man!"}, {"comment_id": "f18ll07", "post_id": "d881hh", "comment": "Congrats! Very impressive. Trying to get my daughter interested in learning guitar, this story and the video of your son's school presentation will help!"}, {"comment_id": "f18lnwv", "post_id": "d881hh", "comment": "Goddamn this sounds like a 10 year old played it!!!\n\nFor real though, send Sam my high five! You guys are doing great! jumping into theory and practice at such a young age, hes going to be able to just shred and rock out without having to think about it!"}, {"comment_id": "f18lonw", "post_id": "d881hh", "comment": "Keep on rockin' brother! That's dedication, and it WILL pay off!"}, {"comment_id": "f18lrfs", "post_id": "d881hh", "comment": "I wish I had parents that did this with me. Maybe I'd be in a different place. \n\nGood job op"}, {"comment_id": "f18ltjy", "post_id": "d881hh", "comment": "What a legend, takes a lot of self control to do it, good job!"}, {"comment_id": "f18mglw", "post_id": "d881hh", "comment": "Wow fantastic hair too. Looks like a thrasher to me!"}, {"comment_id": "f18n969", "post_id": "d881hh", "comment": "That vid brought a tear to my eye. When he tried showing the bar chord and thought he might mess up and did, but didn’t let it stop him from getting it right, that’s what did it for me. This kid’s gonna be great."}, {"comment_id": "f18njjn", "post_id": "d881hh", "comment": "This is awesome, plus the little dude has got the sickest hair!"}, {"comment_id": "f18o2vz", "post_id": "d881hh", "comment": "This is how I wanna raise my son some day, parenting done right my dude"}, {"comment_id": "f18oor1", "post_id": "d881hh", "comment": "Hell yeah OP, I personally wish I'd of been that adamant about my practicing habits at that age. But you can see how happy that kid is making music warms my heart."}, {"comment_id": "f18otmv", "post_id": "d881hh", "comment": "Lovely!!"}, {"comment_id": "f18vbn6", "post_id": "d881hh", "comment": "This is so great that the little dude deserves a better guitar."}, {"comment_id": "f18yzz0", "post_id": "d881hh", "comment": "What a eloquent chap you have raised well done him and well done you!"}, {"comment_id": "f194kvi", "post_id": "d881hh", "comment": "So much joy watching this video.   \nHigh fives for the both of you!"}, {"comment_id": "f196hzy", "post_id": "d881hh", "comment": "Imagine being that 10 year old in class who can shread the guitar."}, {"comment_id": "f1980gu", "post_id": "d881hh", "comment": "I’m learning too and aN does that super regular practice help. If I take a day off I come back rusty. I’m lucky because I live alone so I can sit there every night noodling as I watch TV too (in addition to practice of course) but it’s time spent mindlessly noodling and practicing chord changes again and again. A piece of advice I was given was to “learn three fingerings for every chord, and two ways to change from every chord to every other.” But best of luck to all of us!"}, {"comment_id": "f198m2b", "post_id": "d881hh", "comment": "Congrats to both of you! That’s quite the accomplishment and really impressive all that he’s learned in a year. First Tube was a nice choice as well."}, {"comment_id": "f199gwu", "post_id": "d881hh", "comment": "This is awesome! Congratulations on getting that first year done. It's a good foundation for a long journey to come."}, {"comment_id": "f19b1xj", "post_id": "d881hh", "comment": "That's awesome Rhythmdvl Jr!"}, {"comment_id": "f19b7nm", "post_id": "d881hh", "comment": "That’s discipline. Your boy is going to go far. I wish my kids did stuff like this. High five, big guy!"}, {"comment_id": "f19btsb", "post_id": "d881hh", "comment": "Cool!"}, {"comment_id": "f19e32m", "post_id": "d881hh", "comment": "Did I hear First Tube in there? Double high fives!"}, {"comment_id": "f19h51n", "post_id": "d881hh", "comment": "Take this little man to a guitar center and let him pick out anything he want"}, {"comment_id": "f19jscx", "post_id": "d881hh", "comment": "Please give him some Zeppelin albums and tell him to figure it out.... he’s already got the look!"}, {"comment_id": "dhptk6q", "post_id": "6bv27n", "comment": "I was at the concert last night.  So sad.\n\nI took this pic about 8 hours ago.  http://imgur.com/a/MzdXE\n\nEdit: Thanks for the gold stranger.  Brightens my sad state even if just a little bit.\n\nEdit 2: Here's some more pics I took last night since the first pic seemed appreciated.  http://imgur.com/a/nPv6y I'd UL the videos to youtube, but not sure on the legality on those in how youtube works.  \n\nEdit 3: Someone uploaded a lot of the concert to youtube in HD.  https://www.youtube.com/channel/UCqP8yfmFAd3yBaD0_Y7jiqA  I do not know who they are, but figured I'd link it in case someone wanted to watch the show"}, {"comment_id": "dhpz1xs", "post_id": "6bv27n", "comment": "Did he seem ok during the show?"}, {"comment_id": "dhq1b7j", "post_id": "6bv27n", "comment": "Where did they play last night?\n\nI work downtown and didn't even know they were there."}, {"comment_id": "dhq6def", "post_id": "6bv27n", "comment": "Wow! It's really cool to see him kick it on stage with a straight up Gibson LP.  Like how he used to back in 92'!"}, {"comment_id": "dhq0xtg", "post_id": "6bv27n", "comment": "/r/lastimages"}, {"comment_id": "dhptk7p", "post_id": "6bv27n", "comment": "^(Hi, I'm a bot for linking direct images of albums with only 1 image)\n\nhttp://i.imgur.com/SAguutG.jpg\n\n^[Source](https://github.com/AUTplayed/imguralbumbot) ^| ^[Why?](https://github.com/AUTplayed/imguralbumbot/blob/master/README.md) ^| ^[Creator](https://np.reddit.com/user/AUTplayed/) ^| ^[ignoreme](https://np.reddit.com/message/compose/?to=imguralbumbot&subject=ignoreme&message=ignoreme) ^| ^[deletthis](http://np.reddit.com/message/compose/?to=imguralbumbot&subject=delet%20this&message=delet%20this%20dhptk7p) "}, {"comment_id": "dhrcypt", "post_id": "6bv27n", "comment": "I was there working for the support act and walked right past him that afternoon. Sadly, I didn't stay for the show because management felt that tickets were very tight. One of the great rock vocalists. Regrets..."}, {"comment_id": "dhpwnah", "post_id": "6bv27n", "comment": "Saw Soundgarden a few weeks back in Jacksonville. My favorite album of all time is *Superunknown*, and they pretty much went down that set of songs. Something I noticed about Cornell, apart from the other acts I had seen that night, was how effortlessly he oozed rock-star charisma. It was almost like he didn't even try, but it happened anyway.\n\n[Here's a shot I got of him at that show.](http://i.imgur.com/yL8xd18.jpg)\n\nHe was someone incredibly special.\n"}, {"comment_id": "dhq2xrs", "post_id": "6bv27n", "comment": "That is a fantastic shot."}, {"comment_id": "dhqjaq7", "post_id": "6bv27n", "comment": "That shot's pretty epic"}, {"comment_id": "dhquo0c", "post_id": "6bv27n", "comment": " Chris was truly one cool mother fucker. I really fucking hate referring to him in the past tense. "}, {"comment_id": "dhqpnsy", "post_id": "6bv27n", "comment": "> oozed rock-star charisma\n\ngreat pic - but oozing rock-star charisma is his job - and he had 30 years to practice it. Human being."}, {"comment_id": "dhpr2bu", "post_id": "6bv27n", "comment": "Wait, what? "}, {"comment_id": "dhpssbp", "post_id": "6bv27n", "comment": "What the actual fuck"}, {"comment_id": "dhpsjof", "post_id": "6bv27n", "comment": "And i had tickets to see him tomorrow.\nThis is a shame, so much talent gone. The heaven supergroup just got a little better"}, {"comment_id": "dhpvtfg", "post_id": "6bv27n", "comment": "Not to be inconsiderate or insensitive but are you getting a refund or do you know?"}, {"comment_id": "dhptclk", "post_id": "6bv27n", "comment": "Aw man"}, {"comment_id": "dhr902p", "post_id": "6bv27n", "comment": "Keep that ticket in a goddamn frame "}, {"comment_id": "dhpr0ig", "post_id": "6bv27n", "comment": "Fuck"}, {"comment_id": "dhprf4y", "post_id": "6bv27n", "comment": "I know, I'm still trying to process it too :(\n"}, {"comment_id": "dhpwb9i", "post_id": "6bv27n", "comment": "Yeah :("}, {"comment_id": "dhpsu0w", "post_id": "6bv27n", "comment": "Yeah. Fuck!"}, {"comment_id": "dhptnxy", "post_id": "6bv27n", "comment": "Cobain, Staley, and Cornell all gone now, RIP"}, {"comment_id": "dhq1nef", "post_id": "6bv27n", "comment": "At least we still got Jerry Cantrell. "}, {"comment_id": "dhpv0c2", "post_id": "6bv27n", "comment": "And Scott."}, {"comment_id": "dhq12xu", "post_id": "6bv27n", "comment": "Now I'm even more depressed."}, {"comment_id": "dhpz3hc", "post_id": "6bv27n", "comment": "Back when I was a kid, my mom was a huge Elivs fan. Dad kept saying they'd go \"to the next concert\". Then he died.\n\nMy family, myself included, now never miss a concert for an artist we really want to see.\n\nWhen I learned that Soundgarden and Pretty Reckless were playing in my hometown on May 17th, a shitty Wednesday for a concert, I jumped right onto the web site to get the info. I agonized over whether to buy regular seats, 3rd row at a big premium, or 1st row for a truly insane amount of money.\n\nI was in the third row for that show last night. Close enough to see his eyes and his facial expressions for the whole show.\n\nChris Cornell was a brilliant artist. He is the foundation of the music I've enjoyed the most for 3 decades. He is a big influence on the newer bands that I enjoy listening to.\n\nToday sucks."}, {"comment_id": "dhpskyn", "post_id": "6bv27n", "comment": "Say hello 2 heaven, Chris"}, {"comment_id": "dhptwjg", "post_id": "6bv27n", "comment": "(Sheds a manly tear.)"}, {"comment_id": "dhpsgtt", "post_id": "6bv27n", "comment": "This fucking sucks. Lost one of my idols today. \n\nI have the day off so my neighbors and their neighbors are going to listen to Badmotorfinger today. Whether they like it or not."}, {"comment_id": "dhpxgbf", "post_id": "6bv27n", "comment": "I wish we were neighbors. The best I can do today is headphones in my cubicle. "}, {"comment_id": "dhptczm", "post_id": "6bv27n", "comment": "Great singer. Great song writer. Under-rated guitarist. Big loss. \n\nThe news this morning made me realize that I'm a fucking idiot. I'm 39 years old and I grew up during the heyday of grunge music, yet I've still never seen any of the classic grunge bands live. Obviously, I missed all these bands in their prime. I never saw Nirvana before Cobain died. Never saw Alice In Chains before Layne Staley died, or Stone Temple Pilots before Scott Weiland died. Now I've missed the chance to see Soundgarden. I'm stuck with Pearl Jam (my least favorite band of that era) or the replacement singer versions of STP and AIC.\n\nI need to get off my ass and see more live music. You never know when you might miss the chance forever."}, {"comment_id": "dhpvm8x", "post_id": "6bv27n", "comment": "Did you ever see blind melon? I didn't and that shit bothers me. Saw sound garden open for pearl Jam in 93. Never saw nirvana. Never saw Alice in chains. Downloaded jar of flies last night. "}, {"comment_id": "dhpu133", "post_id": "6bv27n", "comment": "Yeah, I saved the best for last on my bucket list. Now he's gone.\n\n I'm 42, was in high school when I heard Rusty Cage thinking \"This is the most bad ass song ever.\" Still is. "}, {"comment_id": "dhpuyl7", "post_id": "6bv27n", "comment": "Luckily I got to see STP with Scott a few years ago when he rejoined for 1 tour. And AIC's new guy is pretty damn good. Their latest album is actually pretty awesome too. I would recommend seeing the new AIC lineup, but if STP is still with the Linkin Park guy.... meh."}, {"comment_id": "dhq30q9", "post_id": "6bv27n", "comment": "Go see Mudhoney before Mark Arm dies"}, {"comment_id": "dhpxgyz", "post_id": "6bv27n", "comment": "New AIC singer does a pretty good job though. Explosive show they put on!"}, {"comment_id": "dhpw1tv", "post_id": "6bv27n", "comment": "> Pearl Jam (my least favorite band of that era)\n\nWow.  I thought I was the only one on the planet who thought this.  Always considered them overrated compared to the other grunge giants of the era, and if anything, Soundgarden underrated based on radio play time."}, {"comment_id": "dhpw0s0", "post_id": "6bv27n", "comment": "34 here and I was such a big Soundgarden fan. Never saw them live but did see Audioslave."}, {"comment_id": "dhq771z", "post_id": "6bv27n", "comment": "New aic is actually still pretty wicked. No one will ever be staley but the new lineup still has it. I saw them a few years back and he was very lively. Kind of a change of pace but still a great show. "}, {"comment_id": "dhpxghv", "post_id": "6bv27n", "comment": "Obviously I'm biased here, as they are now my favorite of the big four grunge bands, but I wouldn't phrase it as \"stuck with Pearl Jam.\" Do yourself a favor and go see them next opportunity you get. \n\nEven if you don't like their songs as much as their contemporaries (which was how I was, I initially preferred Nirvana and AiC), their live shows are a really transcendent experience, on par with only a handful of artists, such as Springsteen. It's actually how they became my favorite grunge band. \n\nI'm a very non-religious person, but I can't deny that PJ concerts are the closest thing to a religious experience I'll ever get. Hearing 20,000 people in Madison Square Garden singing the outro melody to Black is simply unlike anything I've ever experienced at a concert before or since. The power of it was just so palpable."}, {"comment_id": "dhq9igl", "post_id": "6bv27n", "comment": "Pearl Jam is worse than stone temple pilots?  Those guys were a bunch of poseurs."}, {"comment_id": "dhptykb", "post_id": "6bv27n", "comment": "Also 39 and came to the same realization a few years back.  Managed to catch Soundgarden and NIN in concert.  Cornell sounded incredible.  So glad I got to see them. Really wish I could have seen AiC back in the day.  Guess I'm gonna have to make a point to go see PJ.  The death of Cornell will *definitely* leave a hole in the music scene.  "}, {"comment_id": "dhqgfsx", "post_id": "6bv27n", "comment": "Soundgarden was on my bucket list and now it will never be crossed off. I saw Pearl Jam last year and it was truly an amazing show. I would definitely recommend. "}, {"comment_id": "dhpu06q", "post_id": "6bv27n", "comment": "Same here - 35 and the closest I've been is seeing Foo Fighters a couple years ago."}, {"comment_id": "dhqa5be", "post_id": "6bv27n", "comment": "You and i feel the same way! I missed out on all those bands when they were around. Either someone in the band died or they break up for good.."}, {"comment_id": "dhqa91h", "post_id": "6bv27n", "comment": ">  I'm stuck with Pearl Jam (my least favorite band of that era) or the replacement singer versions of STP and AIC.\n\nThe new guy in AIC sounds incredible, and it's a great show. Definitely recommend seeing them if you get the chance!"}, {"comment_id": "dhqb68l", "post_id": "6bv27n", "comment": "I never got to see Nirvana as they were way too big to even try to see when they toured. I had a chance to see AIC but they backed out at the last minute and were replaced by Candlebox. I did see them in the new incarnation and it was a good show. \n\nI never saw Soundgarden live. I don't think I ever got a chance to check them out as they weren't touring anywhere close to my area back when I went to a lot of live shows. I did see Audioslave and Cornell was on point for the entire set. \n\nI love Pearl Jam but I respect your opinion. To each their own. "}, {"comment_id": "dhqo0hk", "post_id": "6bv27n", "comment": "Hey man, Queens of the Stone Age are still at the top of their game. New album should be out in a year or so. Go. They are one of the few remaining kick ass rock bands in their prime for me. "}, {"comment_id": "dhqu1mw", "post_id": "6bv27n", "comment": "mudhoney might still be touring"}, {"comment_id": "dhr6ncg", "post_id": "6bv27n", "comment": "Having seen Chris twice and Scott twice, it feels just as bad. You never actually *really* appreciate it at the time :/"}, {"comment_id": "dhprc8v", "post_id": "6bv27n", "comment": "Circumstances of death unclear "}, {"comment_id": "dhpvnnp", "post_id": "6bv27n", "comment": "Multiple news sources are saying it looks like suicide in his hotel bathroom"}, {"comment_id": "dhq0esl", "post_id": "6bv27n", "comment": "He was found with a band around his neck. Has to be either suicide or erotic asphyxiation gone wrong."}, {"comment_id": "dhpttp3", "post_id": "6bv27n", "comment": "Which for otherwise healthy folks generally means heart disease or drugs. I don't think he was known to be having issues with depression or similar either. \n\nI don't like to HOPE for heart disease, but in this case I have to. "}, {"comment_id": "dhpu74b", "post_id": "6bv27n", "comment": "Guy dies out on tour, away from his family, with no majorly apparent cause. Terrible, terrible loss.\n\nMight not be realized until now that he's gone, but his contributions to music over the last roughly 30 years were pretty big. He'll be missed."}, {"comment_id": "dhqa091", "post_id": "6bv27n", "comment": "[deleted]"}, {"comment_id": "dhqadvy", "post_id": "6bv27n", "comment": "I miss him too man. Guessing from the username you're from Seattle as well.\n\nProbably one of my favorite shows the last year was seeing a Soundgarden cover band play through \"Superunknown\" at The Crocodile."}, {"comment_id": "dhpx96e", "post_id": "6bv27n", "comment": "I'm just going to copy-paste what I had put on my personal Facebook.\n\nChris Cornell was the first musician that really got me to want to be a musician. I heard tracks like Rusty Cage, Outshined, Cochise, and Show Me How To Live, and I immediately thought to myself, \"this is what I want to do in my life.\" Like A Stone was even the very first song I learned how to play on guitar. To say I'm saddened by Chris's passing is an understatement. He was the voice blasting out of my mother's car when we'd take road trips in the summer. He was, as I said before, a major inspiration to me being a musician. His music was always a constant that got me through various stages of my life so far. Even though I didn't know him or know his family personally, it feels like a great chunk of my being has been torn away from me.\n\nYou gave me life, now show me how to live."}, {"comment_id": "dhpuq5b", "post_id": "6bv27n", "comment": "Sad. Saw Soundgarden in a mid sized club in '92 and again in '93 at a big outdoor show with Pearl Jam and Neil Young. Dude had the most killer pipes. We are/were the same age give or take a few months. \n\n: ("}, {"comment_id": "dhpx09s", "post_id": "6bv27n", "comment": "his vocals in Hunger Strike still gives me chills"}, {"comment_id": "dhqk9t4", "post_id": "6bv27n", "comment": "Chris Cornell [Reddit AMA from 2013](https://www.reddit.com/r/IAmA/comments/1bxp4f/hey_reddit_im_chris_cornell_from_soundgarden_ama/)\n\n"}, {"comment_id": "dhpr44e", "post_id": "6bv27n", "comment": "WHAT. What WHAT??"}, {"comment_id": "dhrbezo", "post_id": "6bv27n", "comment": "My exact emotion when I heard.. :(\n\n\n"}, {"comment_id": "dhpsnrl", "post_id": "6bv27n", "comment": "Dude... This one hits hard."}, {"comment_id": "dhpvx1f", "post_id": "6bv27n", "comment": "Still no idea how he managed to play *and* sing Rusty Cage at the same time."}, {"comment_id": "dhqj4ci", "post_id": "6bv27n", "comment": "He was an underrated guitar player. Dude had chops."}, {"comment_id": "dhq72wa", "post_id": "6bv27n", "comment": "He was one of those guys I'd always assume would be singing past his 70's, totally unexpected."}, {"comment_id": "dhqwsw5", "post_id": "6bv27n", "comment": "I was thinking the same thing today at work. \n\n\nHis passing shook my day apart. I'll be tuning in to his music with a six pack tonight. "}, {"comment_id": "dhpsh6u", "post_id": "6bv27n", "comment": "RIP\nhttps://www.youtube.com/watch?v=RpEzPBzJRLo"}, {"comment_id": "dhpshai", "post_id": "6bv27n", "comment": ">[**\"Seasons\"  by Chris Cornell [5:21]**](http://youtu.be/RpEzPBzJRLo)\n\n>>\"Seasons\"  by Chris Cornell. Music video by Luke Cole, \n\n> [*^Luke ^Cole*](https://www.youtube.com/channel/UCBPVUBLzOPxUpySg_nzGgQQ) ^in ^Music\n\n>*^157,169 ^views ^since ^Aug ^2013*\n\n[^bot ^info](/r/youtubefactsbot/wiki/index)"}, {"comment_id": "dhpsvjc", "post_id": "6bv27n", "comment": "I just saw him with Soundgarden like two weeks ago. I honestly cant believe it"}, {"comment_id": "dhptiob", "post_id": "6bv27n", "comment": "Nooooo!\nDied in my hometown of Detroit."}, {"comment_id": "dhq0gyx", "post_id": "6bv27n", "comment": "Not the fucking news I wanted to wake up to. Fuck"}, {"comment_id": "dhqa8qs", "post_id": "6bv27n", "comment": "[deleted]"}, {"comment_id": "dhqbpyu", "post_id": "6bv27n", "comment": "I feel the same way. It sucks more because he's been sober for a long time and was seemingly doing great. He's a legend. So it goes..."}, {"comment_id": "dhpte9p", "post_id": "6bv27n", "comment": "Fuuuuuuuck"}, {"comment_id": "dhpu8dp", "post_id": "6bv27n", "comment": "This sucks.\n\nI did just find this video though. What a performance https://youtu.be/Bgsg9xfsSoc"}, {"comment_id": "dhpuq33", "post_id": "6bv27n", "comment": "I was looking forward to seeing them in Houston next week. :( RIP"}, {"comment_id": "dhpuvtb", "post_id": "6bv27n", "comment": "Say hello to heaven.. today's gonna be tough"}, {"comment_id": "dhpw398", "post_id": "6bv27n", "comment": "this is just the worst"}, {"comment_id": "dhq9gev", "post_id": "6bv27n", "comment": "Took this in Jacksonville on the 29th :( :(\n\nhttp://imgur.com/a/UliN2"}, {"comment_id": "dhq9gsp", "post_id": "6bv27n", "comment": "^(Hi, I'm a bot for linking direct images of albums with only 1 image)\n\nhttp://i.imgur.com/YxWzKEP.jpg\n\n^[Source](https://github.com/AUTplayed/imguralbumbot) ^| ^[Why?](https://github.com/AUTplayed/imguralbumbot/blob/master/README.md) ^| ^[Creator](https://np.reddit.com/user/AUTplayed/) ^| ^[ignoreme](https://np.reddit.com/message/compose/?to=imguralbumbot&subject=ignoreme&message=ignoreme) ^| ^[deletthis](http://np.reddit.com/message/compose/?to=imguralbumbot&subject=delet%20this&message=delet%20this%20dhq9gsp) "}, {"comment_id": "dhqahyu", "post_id": "6bv27n", "comment": "This just breaks my heart. He was one of the best songwriters out there."}, {"comment_id": "dhqgp7b", "post_id": "6bv27n", "comment": "They just played at Northern invasion and people were saying he seemed very odd and not himself during  Soundgardens performance at the concert"}, {"comment_id": "dhqil21", "post_id": "6bv27n", "comment": "One time I was hanging out with my dad and a couple of his buddies, and one of us would put a song on, and the other people had to guess the song/artist.\n\nWhen it was my turn, I put a Soundgarden song on, and just by hearing the guitar my dad said \"This sounds like Chris Cornell, but I don't know which band...\"\n\nLike, Chris Cornell is known for his legendary voice, but he _definitely_ had his own style on guitar (I was also pretty impressed with my dad for guessing it so quickly).\n\nI don't know. That's just a fond memory I have with my family, and I'll always remember the appreciation I had for Cornell's guitar style after that day. "}, {"comment_id": "dhqwr9h", "post_id": "6bv27n", "comment": "My all time favorite singer.... Another sad thing is Kim thayil will probably go back to being a recluse. They were a perfect combo like Cantrell and staley."}, {"comment_id": "dhr2zcu", "post_id": "6bv27n", "comment": "[Pete Thorn just put up a beautiful tribute on YouTube.](https://www.youtube.com/watch?v=j7ndyZXlYig)"}, {"comment_id": "dhrbf20", "post_id": "6bv27n", "comment": "Awful. Really awful. Pete Thorn had some wonderful things to say and some good stories about Chris. "}, {"comment_id": "dhrbj80", "post_id": "6bv27n", "comment": "I love Pete's videos... and it saddened me to see him so broken by the news.   I hope he has someone to support him through this, it's obvious that he's distraught.\n\n"}, {"comment_id": "dhptcgb", "post_id": "6bv27n", "comment": "No fucking way"}, {"comment_id": "dhpwlod", "post_id": "6bv27n", "comment": "Saw Soundgarden around 92 at Lollapalooza 2 in Vancouver. It had just rained and the crowd became steamy so I watched the set through a human fog. \n\nLouder Than Love is my favorite Soundgarden album. Slightly pre-dated the grunge movement and was stranger than anything else coming out at the time. Definitely heavy and rockin' but certainly not Guns n Roses or Metallica. Listened to that tape over and over again that summer. "}, {"comment_id": "dhqh3ck", "post_id": "6bv27n", "comment": "Yeah, that's my favourite album of theirs too, it had so much of a 70's rock vibe."}, {"comment_id": "dhpxwhs", "post_id": "6bv27n", "comment": "oof! this news felt like a punch to the gut.\nRIP Chris"}, {"comment_id": "dhpzdko", "post_id": "6bv27n", "comment": "It's a sad day for music. Soundgarden was a big reason why I wanted to play guitar back when I first picked it up.\n\nI wanted that sludgy, slow groove and I'm still working on it two decades later. I'm still inspired by Badmotorfinger and Superunknown.\n\nI saw Chris and Soundgarden a few years back when they came to LA. It was nostalgic and amazing. \n\nRest in peace, Chris."}, {"comment_id": "dhpzedd", "post_id": "6bv27n", "comment": "It doesn't get talked about very much, but Ultramegga ok is an awesome album. Very sad. "}, {"comment_id": "dhq6k9v", "post_id": "6bv27n", "comment": "Hey -I got this tape from a friend way back in the late 80's. This was so different from anything else out there. Not very accessible, but I was into bands like Sonic Youth so I liked it a lot. Smokestack Lightning was pretty powerful. Didn't see them taking off to the level that they did, but they wrote tuneful, heavy songs. "}, {"comment_id": "dhq0rho", "post_id": "6bv27n", "comment": "26 year old huge grunge junkie. The day I tried to live. "}, {"comment_id": "dhq2nha", "post_id": "6bv27n", "comment": "For fucks sake."}, {"comment_id": "dhq3r3t", "post_id": "6bv27n", "comment": "This really fucking sucks. Soundgarden is a fav for sure and they were a big inspiration to me when I started out. Hell, they still are, really. Thoughts to his family and friends. RIP"}, {"comment_id": "dhq3rqo", "post_id": "6bv27n", "comment": "Goddamn.  Out of all the hard rock bands that got big in the 90s, Cornell had the strongest, most emotionally-rich and powerful voice; he could send chills up your spine.\n\nEven my dog is a fan.  https://www.youtube.com/watch?v=EdEgHwvqHfU"}, {"comment_id": "dhq4x7q", "post_id": "6bv27n", "comment": "ooooooooooh :( RIP buddy"}, {"comment_id": "dhq57is", "post_id": "6bv27n", "comment": "Possibly the best rock singer of his generation and a huge influence on me.  RIP Chris."}, {"comment_id": "dhq5esd", "post_id": "6bv27n", "comment": "I am not your rolling wheels\n\nI am the highway\n\nI am not your carpet ride\n\nI am the sky\n\nI am not your blowing wind\n\nI am the lightning\n\nI am not your autumn moon\n\nI am the night\n\nThe night"}, {"comment_id": "eppjjlr", "post_id": "bvilpd", "comment": "Incredible work, thank you"}, {"comment_id": "eppk2ma", "post_id": "bvilpd", "comment": "Thanks 😃. It took a while but it was pretty interesting. There are quite a lot of \"same song, different title\" instances that I had to make a call on. Like \"Ships Passing Through The Night\" off Valleys Of Neptune... it was essentially another version of \"Night Bird Flying\", so didn't make the cut!"}, {"comment_id": "epptqhe", "post_id": "bvilpd", "comment": "I saw him front row center 4 months before Woodstock. Chicago opened. I caught his tone knob when he smashed his guitar. Had it taken away by a big kid."}, {"comment_id": "eppv1va", "post_id": "bvilpd", "comment": "Ahh damn 😔 You got to see the man in concert though, which is pretty great."}, {"comment_id": "epqaz0y", "post_id": "bvilpd", "comment": "Holy shit, I can't believe you got to experience that"}, {"comment_id": "epppjt4", "post_id": "bvilpd", "comment": "First of all I just want to say that I am currently tripping on shrooms. It’s my first time and it’s been nothing short of fantastic. \n\nI find it outrageous and incredible that as I lay down for the night (albeit morning), I open Reddit and this is the first thing I see. \n\nSo I feel the need to share this. \n\nLast July, my best friend and I had the absolute pleasure of recording an album with producer Ryan Freeland at United Recording (formerly Ocean Way Recording) in LA. \n\nWhile there we were told to go visit the guy upstairs in archives or records or whatever it’s called. So we all went up there on one of our breaks and the dude was so fucking cool and so jacked to show is all the shit he’s worked on over the years. \n\nHe converts tapes to digital files. One of the many records he converted was Zeppelin II. If you’ve ever listened to that record digitally in literally any way, you have him to thank. \n\nAs we were all gazing around the room at all the amazing shit he’s been involved with, he asked “you guys wanna hear what I’m workin on now?!” \n\nLike we’re gonna say no to that right? \n\nSo he rewinds a bit and says “lemme get back to this one spot I know you guys will love” then presses play... and Jimi goddamn Hendrix starts playing and singing on some jam and is ripping some solo... \n\nWe’re all legit looking at each other wide eyed knowing that this has probably only ever been heard by just the crew that tracked plus a couple others... my buddy who is a huge Jimi fan had tears in his eyes. \n\nSo Jimi is slaying and we’re taking it all in when all the sudden during his solo you hear a little whiff followed by “Ahh fuckin hell I broke a string” and we all lose our shit hahaha. \n\nThe guy was so excited to share that with us and we were so honored to experience it with him and together. What a job that guy has. Hope someone here reads this and feels some feels. \n\nI’m crying and this took me two hours to write.\n\nEdit: Wow thank you guys so much for the love and for my first awards! It was an amazing once in a lifetime experience and I’m glad you all appreciate! Also the shroom trip was great and I wrote two songs haha.\n\nEdit 2: The guy that showed us the tapes is named Dan Johnson (@dan_audioarchiving on Instagram) for anyone interested. I wrote him and asked where/how to hear the sessions and he replied: \n\n“Hey Josh!  Thanks for the kind words.  I do remember you, and I'm glad you liked the tour.  The Hendrix stuff was for the re-release of \"Electric Ladyland\" that Eddie Kramer remixed.  I believe they issued the boxset last September or October. I haven't heard it yet, but the original tapes sounded amazing.”"}, {"comment_id": "eppruau", "post_id": "bvilpd", "comment": "That's awesome dude! Also have a terrific remainder of your trip."}, {"comment_id": "epr88ae", "post_id": "bvilpd", "comment": "I just noticed the Electric Ladyland rehearsals album a few days ago. I told a group of amatuer jammers who all lack confidence, because they compare themselves to the greats, to listen to that collection because it was so sloppily played and the songwriting was so simple, but those sessions became motherfucken Electric Ladyland.\n\n&#x200B;\n\nIt was good to hear this album in the embryonic stage."}, {"comment_id": "epq1i60", "post_id": "bvilpd", "comment": "Damn what a great story. Tears of joy, sir catfish."}, {"comment_id": "epq335d", "post_id": "bvilpd", "comment": "Awesome story man, that sounds great. Have fun."}, {"comment_id": "epqbwvq", "post_id": "bvilpd", "comment": "I just lost my shit too, haha. Great story. Thanks for sharing."}, {"comment_id": "eprelfa", "post_id": "bvilpd", "comment": "I love stories like this.  This is the first authentic story I've heard in a while and this is why I love reddit.  So much of the shit posted is fake, filtered and processed and I can't thank you enough for just being real, honest and authentic in sharing your story.\n\nThere is beauty in the world."}, {"comment_id": "eprkk9h", "post_id": "bvilpd", "comment": "This is wonderful!\n\nEvery experience I've had with shrooms has been fantastic. May you venture well."}, {"comment_id": "eprw4ei", "post_id": "bvilpd", "comment": "Thanks for this!  Original Jimi knowledge is unicorn rare!  Seriously cool."}, {"comment_id": "epsh2sw", "post_id": "bvilpd", "comment": "This is awesome, how were you able to write so coherently while tripping?"}, {"comment_id": "epqz342", "post_id": "bvilpd", "comment": "Great story! Great post, thanks for taking the time to share that one."}, {"comment_id": "epr9e3e", "post_id": "bvilpd", "comment": "thanks for the great story! have a great journey!!!"}, {"comment_id": "epsc8rm", "post_id": "bvilpd", "comment": "Reminds me of when I got to listen to Michael Jackson's thriller in surround sound at blackbird studios. In studio.. a .. or b ? It has some 140k diffusers in the wall. Amazing room. All from sending them an email asking to interview the manager for a school project. From what he told us that version of the album is unreleased and very few people have heard it. Was not expecting that at all. Was a good day."}, {"comment_id": "erfefqp", "post_id": "bvilpd", "comment": "Love this"}, {"comment_id": "epqgtcx", "post_id": "bvilpd", "comment": "Dude , get the fuck off reddit and go outside"}, {"comment_id": "eppk33e", "post_id": "bvilpd", "comment": "This is amazing work thanks for this!"}, {"comment_id": "eppkxok", "post_id": "bvilpd", "comment": "Thanks! I've been tweaking it for a few months... I finally figured today that I could fit the 4th Monterey song (Rock Me Baby) on \"Disc 1\" instead of as a Purple Box Set Disc 7 track. I just trimmed some of the unnecessary crowd noise/feedback etc on a few Monterey tracks. It was finally ready!\n\n(I didn't actually make up the physical CDs, it's just how I work... constraints create challenges)"}, {"comment_id": "eppnmmo", "post_id": "bvilpd", "comment": "Some one knight this man"}, {"comment_id": "epppn6g", "post_id": "bvilpd", "comment": "I shall accept my title of Sir Nerdly of Hendrixton and Spreadsheetville"}, {"comment_id": "epresx8", "post_id": "bvilpd", "comment": "\"If i could, i would knight you ten times over\""}, {"comment_id": "epqce8e", "post_id": "bvilpd", "comment": "or woman"}, {"comment_id": "eps993h", "post_id": "bvilpd", "comment": "“Who are you, who are so wise in the way of science?”"}, {"comment_id": "eppm20z", "post_id": "bvilpd", "comment": "I came across an mp3 a while back of part of little wing. It's only 2m44s long but it's absolutely cracking. It's just called little wing outtake. DO you know of it or what album it's from?\n\nNice work."}, {"comment_id": "eppnong", "post_id": "bvilpd", "comment": "There is a 2:44 long track on South Saturn Delta named \"Little Wing\", but it's actually a printing error, it's an alternate version of \"Angel\" !\n\nMaybe that's it?"}, {"comment_id": "epqb3x9", "post_id": "bvilpd", "comment": "I have one as well that is labelled as being from the album \"The Jimi Hendrix Experience \\[MCA Box\\] Disc 3\". There's no singing on this one and it's something I downloaded like 15 years ago on some random file sharing site, so I'm not positive that it's even Hendrix at all. It also ends abruptly in the middle of the song."}, {"comment_id": "eppm0zh", "post_id": "bvilpd", "comment": "Was wondering what to listen today, I'm sorted I think. Cheers"}, {"comment_id": "eppmj1o", "post_id": "bvilpd", "comment": "Heh heh, sorry Spotify doesnt have all the Dagger Records tracks. It was kinda cool actually though, recently I bought my 3 final CD's from America... old school !"}, {"comment_id": "eppt4ey", "post_id": "bvilpd", "comment": "HERO"}, {"comment_id": "eppvoez", "post_id": "bvilpd", "comment": "I'm just an average dude with Excel 2007, a huge Hendrix collection and a WHOLE lotta spare time!"}, {"comment_id": "epph7rx", "post_id": "bvilpd", "comment": "I've kept the 3 original albums intact, plus Band Of Gypsys and First Rays. All other albums/releases appear in part only, because at least some of the tracks appear on those first 5.\n\nIt starts out chronologically, but that doesn't last long! I ended with \"First Rays\" because I figured it was better to end with an actual full album.\n\nI've listed things according to the discography from the 1990's onwards, because those are what have been available for most of the last 20 years. The 70's releases are now relatively obsolete.\n\nFINE PRINT:\nMost of the missing songs on Spotify are Dagger Records releases:\nFrom the Baggy's Sessions \"Baggy's Jam\" is missing, and there's a different \"Hootchie Cootchie Man\". \"Blue Window\" from Martin Scorcese Presents The Blues is missing, and the \"Georgia Blues\" is off Both Sides Of The Sky. The \"discs\" with the Morning Symphony Ideas, Burning Desire, and Hear My Music Dagger Records songs are all missing completely. Buy them!\n\n\"Captain Coconut\" doesn't exist digitally... and it's a whole 'nother post completely!\n\nEDIT: Amazing. Some people feel the need to correct a comment that someone else gave platinum to..."}, {"comment_id": "eppi3fm", "post_id": "bvilpd", "comment": "This is so cool! Thank you for making this. I gave your playlist a follow on Spotify!"}, {"comment_id": "epqyskh", "post_id": "bvilpd", "comment": "> \"Captain Coconut\" doesn't exist digitally... and it's a whole 'nother post completely! \n\nWould you elaborate on that?\n\nIt  happens to be one of my favourites and is on the Crash Landing CD from '75/'88 which granted  is not available unused anymore but not that obscure or expensive on the used market."}, {"comment_id": "epqevhv", "post_id": "bvilpd", "comment": "I'm confused, did he not release 4 albums?  You keep saying 3. \n\nThe Jimi Hendrix Experience:\nAre You Experienced (1967)\nAxis: Bold as Love (1967)\nElectric Ladyland (1968)\n\nJimi Hendrix/Band of Gypsys:\nBand of Gypsys (1970)"}, {"comment_id": "eppo8lz", "post_id": "bvilpd", "comment": "The first time I heard Hey Baby (New Rising Sun) I listened to it another 10 times immediately. How he plays rhythm and lead just blows my mind."}, {"comment_id": "eppobs1", "post_id": "bvilpd", "comment": "I would've loved to hear the final version... he was still working on it! One of my top 5 Hendrix songs, easily."}, {"comment_id": "epsbozx", "post_id": "bvilpd", "comment": "Me too, that shit was dope..I always skipped that song cause i hate the start. This one time i was in a bus and i felt lazy to skip it and the song takes off and i was like \" Damnnnn\". Played it on repeat the whole day. One of my favourites till this day."}, {"comment_id": "eppp59b", "post_id": "bvilpd", "comment": "'Scuse me while I kiss this guy... *points to OP*"}, {"comment_id": "eppp7j9", "post_id": "bvilpd", "comment": "Dude... they're coming through! I've got your reply 4 times! I had exactly the same problem 😕"}, {"comment_id": "eppx8i9", "post_id": "bvilpd", "comment": "aaaaaaaaaaaaaand radio plays “all along the watchtower” which isn’t even his ....\n\nhis family is ruining his legacy ..... I have 2 rock/classic rock stations in ATL and Hendrix should be played as much as anybody \n\nhe. is.  not."}, {"comment_id": "epqy5u7", "post_id": "bvilpd", "comment": "A bunch of the songs listed by OP are also covers. Blue Suede Shoes, Johnny B Goode, Hoochie Coochie Man, for instance"}, {"comment_id": "epq0edx", "post_id": "bvilpd", "comment": "I think it's the same in most cities/countries. You'd be very lucky to have a classic station that has more than 6 Hendrix songs in rotation."}, {"comment_id": "eqqe0xb", "post_id": "bvilpd", "comment": "> aaaaaaaaaaaaaand radio plays “all along the watchtower” which isn’t even his ....\n\nYes but he fucking made it his, and now owns the shit out of it in the public perception"}, {"comment_id": "eppzxr6", "post_id": "bvilpd", "comment": "Yes!! Thank you for this! And I especially love the BBC Session of \"Day Tripper\" :)"}, {"comment_id": "epq09b9", "post_id": "bvilpd", "comment": "It is good! That's the thing... cool tracks get buried among dozens of alternate and live versions of songs we already know"}, {"comment_id": "epq9wek", "post_id": "bvilpd", "comment": "This is great! One essential addition I can't for the life of me find anywhere to listen to online, is the instrumental \"New Rising Sun\" that's on West Coast Seattle Boy. I haven't heard it in sooo so so so long but it's one of the most beautiful things Hendrix did in my opinion.\n\n&#x200B;\n\nWish I could hear it as I don't have West Coast Seattle Boy downloaded on my computer, but I think it's track 18 on disc 2 here: [https://www.amazon.com/West-Coast-Seattle-Boy-Collectors/dp/B003YDZV90/ref=sr\\_1\\_1?keywords=west+coast+seattle+boy&qid=1559401930&s=gateway&sr=8-1](https://www.amazon.com/West-Coast-Seattle-Boy-Collectors/dp/B003YDZV90/ref=sr_1_1?keywords=west+coast+seattle+boy&qid=1559401930&s=gateway&sr=8-1)\n\n&#x200B;\n\nAlso possible you already have it listed but it had a different title, it's been a while!\n\n&#x200B;\n\n\\*\\* one other thing I also just thought of - I know you didn't want repeats but the 1970 Maui performance of Hey Baby / In From the Storm is absolutely killer and I think a worthy addition! (Since it's moreso a medley of the two) [https://open.spotify.com/track/0rqERJW7BLSmSrbmfPBY8U?si=56LIeLblRBO4PgCYSv7Q-g](https://open.spotify.com/track/0rqERJW7BLSmSrbmfPBY8U?si=56LIeLblRBO4PgCYSv7Q-g)"}, {"comment_id": "epqb1kf", "post_id": "bvilpd", "comment": "Hmmm... I guess that one slipped through the cracks... It is a totally different composition to Hey Baby. But since both are on the same box set, they have very similar names, and there is a LOT of material on there, it slipped through. I mightnt have given it it's due because I like the original Hey Baby (N.R.S.) so much I'm not fussed over alt versions. Well caught!\n\nOne out of several hundred ain't bad."}, {"comment_id": "epvrx8u", "post_id": "bvilpd", "comment": "Since you correctly, and diplomatically, found a missing track, here's an updated (and higher res) version for you, with New Rising Sun on \"Disc 6\". I silently added it to the Spotify playlist too\n\nhttps://imgur.com/6GVW460 \n\nThanks 😉"}, {"comment_id": "epqf6l9", "post_id": "bvilpd", "comment": "Yeah, the Maui one is a no-go, especially considering they're both full core album tracks."}, {"comment_id": "epqg6wn", "post_id": "bvilpd", "comment": "Thanks for this. I first got into Hendrix when my mom gave me a bunch of 8-track cassettes that were the only things my dad had left behind when he skipped town on her when I was five and my sis was eight. A best of Jimi Hendrix compilation was one of those cassettes (along with Led Zeppelin II, Deep Purple's 'When We Rock, We Rock and When We Roll, We Roll, Pink Floyd's Dark Side of the Moon, a best of The Beatles compilation, a best of Jethro Tull , Queen's Night at the Opera, Elton John's Goodbye Yellow Brick Road and Pink Floyd's The Wall). I'd listened to classic rock on the radio but there's something special about plugging in an 8-track and hearing that warm analog goodness. I played those tapes over and over (along with my Ozzy records) and Hendrix got put into heavy rotation. \n\nGiven just how much I've listening to Hendrix over the years you'd think I'd be a better guitar player but I still suck lol."}, {"comment_id": "eq16kfq", "post_id": "bvilpd", "comment": "That almost made me cry."}, {"comment_id": "epqgr80", "post_id": "bvilpd", "comment": "I'd hear the gold Ultimate best of CD through my brother's bedroom wall during high school. A few years later I think I bought the Experience Hendrix greatest hits in 1999 when it came out. After that I gradually started collecting. Everyone has their own introductions I guess.\n\nI suck at guitar too...!"}, {"comment_id": "epq1gdb", "post_id": "bvilpd", "comment": "Wow a real Hendrix fan. Almost as rare as a unicorn on reddit. The Hendrix sub compared to Zeppelin or Beatles is non-existent , basically. He is respected in name and concept as a acid rocker, Black guitar master and casualty of the counter-culture drugs. But how many people can hear the second verse of Highway Chile and know the lyrics? Or how many redditors know what songs Steve Windwood contributed to on ELL? Or name 3 songs on Rainbow Bridge? I hope your efforts expose many more to his genius and they are able to appreciate it with all the bombardment of Art online."}, {"comment_id": "epq28e7", "post_id": "bvilpd", "comment": "Yeah r/jimihendrix is pretty small. I posted an earlier but pretty similar version of this there a couple of months ago... it had 5 upvotes for a month, until I linked to it in a comment on another music sub and it crawled up to 20. \n\nVery surprised to be getting 100+ upvotes an hour here, and most of America isn't even awake yet!\n\nI think I found the right place to post it now. \n\nNeedless to say I'm a huge fan. Thanks!"}, {"comment_id": "epqx3x0", "post_id": "bvilpd", "comment": "Jesus gatekeep a little harder pal"}, {"comment_id": "epu90nc", "post_id": "bvilpd", "comment": "i Am A **rEaL** hEnDriX faAn!1"}, {"comment_id": "epprc8w", "post_id": "bvilpd", "comment": "Quite a few of the cuts that were released posthumously probably shouldn't have been released.  Despite this, Jimi will ALWAYS be an absolute guitar GOD to me. Sure there are plenty of guitar players who are miles past him technically, but who had his intensity, originality, soul, fire, lyricism, color, fury, passion, phrasing, dynamics and songwriting ability all in one package?\n\nI was first exposed to Jimi through my brother (more than 40 years ago) who listened to him all the time. One of my earliest memories of his music was hearing *Third Stone From The Sun* and thinking that *this is what sex sounded like.* True story. Bear in mind, I was a very young kid that knew that sex was a thing, but that it was a thing that I knew nothing about\n\nTo this day, when I listen to his version of *Machine Gun* from the Isle of Wight performance, I still hear new subtleties and new sounds. There was no on like him. Ever."}, {"comment_id": "epprvn2", "post_id": "bvilpd", "comment": "Historically most of the people that went looking for deeper Hendrix cuts kinda knew the drill... that a ton of stuff was incomplete before his death.\n\nBut yeah, the issue is if you have a service like Spotify with a shuffle artist function... if the first Hendrix song someone hears is \"Messenger\" off West Coast Seattle Boy, without any career context, it might paint him in a bad light in that instance.\n\nHe had the tone, the feel, the confidence, the innovation. I think Yngwie Malmsteen (who I don't really care about) cited the howling note at 0:19 on the Band Of Gypsys \"Power Of Soul\" as the greatest note in the history of rock. I agree."}, {"comment_id": "epsm86w", "post_id": "bvilpd", "comment": "> Quite a few of the cuts that were released posthumously probably shouldn't have been released.\n\nWhat, you're saying the Hendrix estate shouldn't have put out *The Lost Hendrix Warm-ups Volume 2: Scales*?"}, {"comment_id": "eppk68k", "post_id": "bvilpd", "comment": "Thank you so much for this"}, {"comment_id": "eppl1pm", "post_id": "bvilpd", "comment": "What can I say... big fan!"}, {"comment_id": "epplhz1", "post_id": "bvilpd", "comment": "Dude amazing work"}, {"comment_id": "epplp2q", "post_id": "bvilpd", "comment": "Thank you. I wasnt expecting so many upvotes... I just clicked over 10,000 total post karma 😎. So it was worth the many hours of nerdery !"}, {"comment_id": "eppmr2j", "post_id": "bvilpd", "comment": "Thanks for sharing this! I’ll definitely be listening to this playlist quite a bit!"}, {"comment_id": "epppu9o", "post_id": "bvilpd", "comment": "I thought this would be totally buried! Glad I could be of service 😉"}, {"comment_id": "eppnnlc", "post_id": "bvilpd", "comment": "Gave it a follow as well! I actually just listened to every song that Spotify had of Hendrix a few weeks ago. Can’t wait to listen to this playlist"}, {"comment_id": "eppolrs", "post_id": "bvilpd", "comment": "This will be a hell of a lot quicker... There won't be 8 versions of Purple Haze!"}, {"comment_id": "epqsdn0", "post_id": "bvilpd", "comment": "Why apologize for opening with “Hey Joe”? A lot of us love that song, and for those who don’t it’s probably better to be able to skip it immediately :)\n\nGreat work!"}, {"comment_id": "epriw4j", "post_id": "bvilpd", "comment": "Heh heh! Jimi kinda hated it so I try to keep that it mind"}, {"comment_id": "eps64d7", "post_id": "bvilpd", "comment": "Great post, Jimi needs more love!\n\nOne recommendation to the Spotify playlist, One Rainy Wish. The melody at the beginning of the song, really the whole song is beautiful.\n\nEdit: Bold as love as well. Incredible imagery in both songs."}, {"comment_id": "eps8vbp", "post_id": "bvilpd", "comment": "I added the whole albums to Spotify, they show here in Australia. If they don't show uo theres nothing I can do, it must be a regional thing."}, {"comment_id": "eppwjcz", "post_id": "bvilpd", "comment": "Hearing voodoo child makes me nostalgic for WCW/NWO.. Hogan's theme"}, {"comment_id": "eppwty7", "post_id": "bvilpd", "comment": "I am trying to find the playlist on the app. For some reason it isn’t showing up for me. Any help pointing me in the right direction? This is really cool of you to make"}, {"comment_id": "epqs444", "post_id": "bvilpd", "comment": "If you’re on an iPhone, from the post in the Reddit app, click the Spotify playlist link. Then when the next page opens click the “more “ icon in the top right and hit open in Safari. It should now open Spotify and take you directly to the playlist."}, {"comment_id": "eppx1ht", "post_id": "bvilpd", "comment": "Sorry, I have no idea how to use Spotify, I have a physical and MP3 collection so never use it. I literally only created an account to make the occasional playlist for Reddit. This post would be naked without an accompanying playlist in this era.\n\nI just know Hendrix and MS Excel, hopefully someone else can help out?"}, {"comment_id": "epq0t89", "post_id": "bvilpd", "comment": "Any luck?"}, {"comment_id": "epq2v5i", "post_id": "bvilpd", "comment": "I also can’t figure it out and I use Spotify everyday it’s making me feel silly."}, {"comment_id": "eppx91q", "post_id": "bvilpd", "comment": "All good thanks for even compiling a list."}, {"comment_id": "eppxbub", "post_id": "bvilpd", "comment": "Yeah that was 95% of the work! Maybe log out and back in? I had some Spotify issues adding the songs today."}, {"comment_id": "eppy8wr", "post_id": "bvilpd", "comment": "Great stuff, thanks!"}, {"comment_id": "epq9phq", "post_id": "bvilpd", "comment": "I make this shit anyway, might as well share the love!"}, {"comment_id": "eppyr5d", "post_id": "bvilpd", "comment": "In his short 27 years of life he became a god damn legend. Big respect."}, {"comment_id": "eppz8fq", "post_id": "bvilpd", "comment": "The craziest part is that ALL of that was recorded in under 4 years!"}, {"comment_id": "eppzdko", "post_id": "bvilpd", "comment": "Way cool dude!"}, {"comment_id": "epq2nd1", "post_id": "bvilpd", "comment": "Glad you like it 😉"}, {"comment_id": "epq1tgq", "post_id": "bvilpd", "comment": "I think this is great use of [Hendrix music by Coen Bros](https://vimeo.com/104193227) in a Serious Man"}, {"comment_id": "epq8p7w", "post_id": "bvilpd", "comment": "Very unexpected, but yeah it worked! Nice."}, {"comment_id": "epq3mb3", "post_id": "bvilpd", "comment": "Damn I thought I had them all but you showed me atleast 25 more songs to check out, thank you! :)"}, {"comment_id": "epq436i", "post_id": "bvilpd", "comment": "My pleasure! The Dagger Records albums are impossible to listen to legally online in Australia... not sure how you'll go where you live. Good luck!"}, {"comment_id": "epq45w6", "post_id": "bvilpd", "comment": "I like wind cries Mary"}, {"comment_id": "epq4a1g", "post_id": "bvilpd", "comment": "It's a beautiful song."}, {"comment_id": "epq5tqc", "post_id": "bvilpd", "comment": "Thank you for taking one for the team!"}, {"comment_id": "epq6emu", "post_id": "bvilpd", "comment": "Heh heh 😄. Thanks... his discography is ridiculously complicated and ...uhh... repeaty. I felt the need to streamline it!"}, {"comment_id": "epq7jxx", "post_id": "bvilpd", "comment": "I work nights, and sleep during the day, so we’re probably sort of on the same schedule lol, it’s so odd"}, {"comment_id": "epq81l8", "post_id": "bvilpd", "comment": "Ah, that makes sense! At certain times of day here a lot of people who reply are also from Australia/New Zealand, then you get the English and Europeans, then the biggest wave is obviously the Americans. It also depends on the topic... rugby and Metallica have fairly different peak times!"}, {"comment_id": "epqbw9t", "post_id": "bvilpd", "comment": "This is fantastic!  I have them all and now I can create my own Playlist!  Way cool! Thanks."}, {"comment_id": "epqc4lo", "post_id": "bvilpd", "comment": "Nice 😎 Well collected!"}, {"comment_id": "epqic1w", "post_id": "bvilpd", "comment": "Thanks for putting this together. How did you decide which songs went with which album cover?"}, {"comment_id": "epqjehg", "post_id": "bvilpd", "comment": "Not really sure what you mean, that question could go a few ways..."}, {"comment_id": "epqkji7", "post_id": "bvilpd", "comment": "Huh maybe it’s just online Spotify and not the app but that’s strange I guess."}, {"comment_id": "epqyxe6", "post_id": "bvilpd", "comment": "[deleted]"}, {"comment_id": "eprh82q", "post_id": "bvilpd", "comment": "I think it's just an \"alternate mix \". Same recording, different levels. I think labels do that sometimes to get a hit onto a rarities compilation to strengthen it... I know that technique has been used with Nirvana."}, {"comment_id": "eqr7n9p", "post_id": "bvilpd", "comment": "The bass is higher in the mix, as is the percussion, so is the solo guitar in places.\n\nThere's less delay on the guitar and it includes Jimi's pre-roll count, which for those of use who played it wrong for years thinking it started on the one was a revelation as it started on the and after 3."}, {"comment_id": "epqz65y", "post_id": "bvilpd", "comment": "This is a great bit of work, thanks! I've added it to my Spotify and will be jamming this for the foreseeable future."}, {"comment_id": "eprj29g", "post_id": "bvilpd", "comment": "Nice! I'm still shocked at how much interest this has gathered, last time I looked (it's the middle of the night in Australia) there were 300 spotify followers, it's probably 500 by now. Enjoy!"}, {"comment_id": "epqzloq", "post_id": "bvilpd", "comment": "hey that's like half a doom metal album worth of music"}, {"comment_id": "eprixbp", "post_id": "bvilpd", "comment": "😆"}, {"comment_id": "epr22df", "post_id": "bvilpd", "comment": "One interesting Hendrix point is: because he played in a 3 piece i. e. there was no rhythm guitarist so he had more freedom to go nuts on his solos.  That also meant he had compensate for the lack of a rhythm guitar to interact with."}, {"comment_id": "epriql8", "post_id": "bvilpd", "comment": "Yeah he was a beast, playing bits of bassline, rhythm and lead sometimes"}, {"comment_id": "epr35re", "post_id": "bvilpd", "comment": "Its gonna be a good weekend of music for me. First a new Kenny Wayne Shepherd album, and now this. Thank you so much!"}, {"comment_id": "eprimqu", "post_id": "bvilpd", "comment": "Damn! I haven't listened to KWS in a few years, I might have to dust off my \"Trouble Is\" !"}, {"comment_id": "epr6rxo", "post_id": "bvilpd", "comment": "Nice"}, {"comment_id": "eprgood", "post_id": "bvilpd", "comment": "😎"}, {"comment_id": "eprbfl1", "post_id": "bvilpd", "comment": "I've spent 3 years now listening to as much new Hendrix as I could get my hands on and this is like a holy grail! Thank you so much for your hard work and love in compiling this. I know I will spend many more hours listening!"}, {"comment_id": "eprgiok", "post_id": "bvilpd", "comment": "Track down the studio Dagger albums, (Hear My Music, Morning Symphony Ideas, Burning Desire). I recently imported them on CD to complete my collection, very glad I did."}, {"comment_id": "eprjxtf", "post_id": "bvilpd", "comment": "SAVED"}, {"comment_id": "eprof9y", "post_id": "bvilpd", "comment": "How do I open this in the spotify app?"}, {"comment_id": "eprouos", "post_id": "bvilpd", "comment": "I made the list but literally never use the app otherwise, I'm a collector, so can't really give any insight. It seems to be working for most people, but a few others have had issues.  If the link in the header doesn't work maybe check the other comments and see how other people rectified it. I remember seeing at least one solution somewhere in there."}, {"comment_id": "eprwkd8", "post_id": "bvilpd", "comment": "Well done. UPVOTE THIS MAN!"}, {"comment_id": "eps3yos", "post_id": "bvilpd", "comment": "This is dope! I wish Spotify had \"Wait Until Tomorrow\", which is inexplicably the only song out of \"Axis: Bold as Love\" that isn't available...."}, {"comment_id": "eps8znz", "post_id": "bvilpd", "comment": "Someone said Bold As Love isnt available where they live either."}, {"comment_id": "eps8ezm", "post_id": "bvilpd", "comment": "Band of Gypsies!!!!"}, {"comment_id": "eps8pwy", "post_id": "bvilpd", "comment": "Good album 😎"}, {"comment_id": "epseqk7", "post_id": "bvilpd", "comment": "Thank you man"}, {"comment_id": "epsf49r", "post_id": "bvilpd", "comment": "Glad you like it 😀"}, {"comment_id": "eibl3td", "post_id": "b00xdr", "comment": "If you youngsters don't know, the Harry Fox agency sued OLGA out of existence around 20 years ago (if memory serves, I'm sure someone will correct me). It was a community sourced archive of tabs for pretty much everything and it was gloriously open and free."}, {"comment_id": "eibourw", "post_id": "b00xdr", "comment": "OLGA! Trip down memory lane!"}, {"comment_id": "eibsusl", "post_id": "b00xdr", "comment": "I miss OLGA.  Shortly after they were shutdown there were full archives of the site available on file sharing sites, and somebody made an offline search program for it. Maybe it's still floating around out there somewhere."}, {"comment_id": "eibom6m", "post_id": "b00xdr", "comment": "Olga was a godsend when I started playing. "}, {"comment_id": "eiboiob", "post_id": "b00xdr", "comment": "Oh yeah I remember OLGA. But even most of those tabs came from Usenet before OLGA existed."}, {"comment_id": "eichyxa", "post_id": "b00xdr", "comment": "OLGA may very well have been the apex of the internet. Before commercial interest, pop-up ads, and privacy-shredding social media, there was OLGA. A beautiful feat of open and free exchange of knowledge long before anything like Wikipedia existed. RIP OLGA."}, {"comment_id": "eid0oot", "post_id": "b00xdr", "comment": "Copyright striking tabs is so ridiculous when you consider the fact that most of the tabs are just people doing them by ear.  So listening to music and writing down what you hear is liable to get you sued? It's so silly. "}, {"comment_id": "eibujyf", "post_id": "b00xdr", "comment": ">If you youngsters don't know, the Harry Fox agency sued OLGA out of existence around 20 years ago (if memory serves, I'm sure someone will correct me).\n\nYep, maybe closer to 15 years though. OLGA was mirrored in Poland or some other former Soviet bloc country for a while after that too, and people were downloading the entire thing for a while. If storage had been cheaper I'd have done so myself. I used OLGA a lot, and Usenet before that. Both were a godsend after starting in the early 1980s when the only way to get music at all was to buy magazines (Guitar for the Practicing Musician FTW!) or if you were lucky enough to live by a library that offered music books you could check them out and photocopy them.\n\nEdit: there are a [lot of OLGA mirrors](http://www.museweb.com/ag/music.html) mentioned here, but the dozen or so I checked are all gone. Also my memory is bad: the first shutdown of OLGA was in 1996, so almost 25 years ago now!"}, {"comment_id": "eibt3w4", "post_id": "b00xdr", "comment": "OLGA was amazing. Helped me so much. Haven’t thought about that for a lot of years. "}, {"comment_id": "eic0hkp", "post_id": "b00xdr", "comment": "Oh man I completely forgot about that site. I remember using it when I first started playing."}, {"comment_id": "eictnxk", "post_id": "b00xdr", "comment": "I lived on OLGA when I first started playing. I knew ultimate guitar would shit the bed sooner or later."}, {"comment_id": "eibteli", "post_id": "b00xdr", "comment": "Holy shit, forgot all about that place."}, {"comment_id": "eicys7t", "post_id": "b00xdr", "comment": "Those archives exist in torrents. Search around. They are findable."}, {"comment_id": "eicxx9j", "post_id": "b00xdr", "comment": "OLGA is what got me back into playing. And this represented the demise of the internet to me -- I never again took it seriously as a vehicle for open global communication. "}, {"comment_id": "eicbn5z", "post_id": "b00xdr", "comment": "“Pretty much everything” lol not. "}, {"comment_id": "et5ydwv", "post_id": "b00xdr", "comment": "so that's what happened.\n\nit was the first time i was online, via dialup, and i was so happy that i could download tabs for my favorite music and try to learn.\n\nfuck you harry fox, fuck you and your foxes"}, {"comment_id": "eibgw65", "post_id": "b00xdr", "comment": "IMO, i use songsterr, such a better tab solution and it plays midi guitar for you "}, {"comment_id": "eibjqvy", "post_id": "b00xdr", "comment": "Love that about songsterr, the midi helps a lot more than I expected."}, {"comment_id": "eibn5q7", "post_id": "b00xdr", "comment": "Just tried this thanks to your comment. NEVER going back to UG. I’ve just used UG for like 10 years, maybe more and was too lazy to look for something new. THANK YOU!"}, {"comment_id": "eibqzmi", "post_id": "b00xdr", "comment": "I like Songsterr too, but there's not nearly as many tabs as UG. \n\nI had a weird experience. I had paid for an UG special, lifetime for $5 or something. It never really worked fully, so features didnt work - that's why i went to songsterr. Then after a while when I found it didnt have the songs i was looking for I downloaded UG's new app, logged in and everything actually worked. Probably 5 years after I initially bought the lifetime. It's not as frustrating, definitely not perfect, but it works well enough now and some songs have midi too which is nice. "}, {"comment_id": "eibul8i", "post_id": "b00xdr", "comment": "Yeah, ive decided to stop using it. Even with the ads blocked, its still a really shitty advertising system. Im leaving it."}, {"comment_id": "eibszg2", "post_id": "b00xdr", "comment": "Does songsterr let you play your own tabs? I've been trying to find a mobile app that will let me load my own gp5 files. "}, {"comment_id": "eic55w6", "post_id": "b00xdr", "comment": "At the end of the day though the volume of stuff on ultimate guitar is way way better"}, {"comment_id": "eibrtx6", "post_id": "b00xdr", "comment": "got the app subscription for it and couldn't be happier. If only more people used it though, there aren't as many tabs as would be preferred "}, {"comment_id": "eic0es4", "post_id": "b00xdr", "comment": "Songsterr has so little songs though i have to end up going back to UG 3/4 times"}, {"comment_id": "eicggvu", "post_id": "b00xdr", "comment": "Well there's nothing better than  guitar pro with some tabs open , it's fast it's individual . T\nSongster feels like trying to walk with one leg"}, {"comment_id": "eic81ik", "post_id": "b00xdr", "comment": "Exactly what I did and never have to use that shit show ug again. "}, {"comment_id": "eicmecs", "post_id": "b00xdr", "comment": "The one thing I think it needs is to be able to also show the music as traditional music notation at the same time as the tabs. It should be easy since the already show what frets are to be played and the tuning so it could be done automatically."}, {"comment_id": "eiddsy8", "post_id": "b00xdr", "comment": "Thank you for this. I'll never use UG again. Songsterr is fucking great.\n\n"}, {"comment_id": "eie2k23", "post_id": "b00xdr", "comment": "[deleted]"}, {"comment_id": "eic2ety", "post_id": "b00xdr", "comment": "Jumping onto this top comment as many people have recommended Songsterr. I’ll be trying it out tomorrow. Thanks."}, {"comment_id": "eicf36w", "post_id": "b00xdr", "comment": "Songsterr is good and definitely a huge step up from UG. My favourite tabbing program has always been TabIt but the community seems to be all but dead now. Still a lot of good, fairly accurate tabs in their library though."}, {"comment_id": "eic5315", "post_id": "b00xdr", "comment": "payed or free version?  \nAlso what does it mean when you say midi guitar?"}, {"comment_id": "eibi2q1", "post_id": "b00xdr", "comment": "I use sognsterr, never touched ultimate guitar again "}, {"comment_id": "eic5o0b", "post_id": "b00xdr", "comment": "Stupid question but can I get guitar pro tabs from them? Or is at all in browser?"}, {"comment_id": "eidj6q9", "post_id": "b00xdr", "comment": "Stupid question. I just downloaded the songsterr app for iphone, there is no difference between the ultimate guitar app coz I’m still required to pay monthly subscription to be able to read the tabs. Am I missing something here?"}, {"comment_id": "eibn9d6", "post_id": "b00xdr", "comment": "Another vote for Songsterr from me.\n\n&#x200B;\n\nUltimate Guitar is going to tank themselves, they don't have a demographic like they think they do. Beginner players are just beginning, they aren't skilled enough to play an advanced tab and it wouldn't make sense to pay their way into something they're just starting. Experienced players often evolve past needing tabs and the few rare times they do use them, it wouldn't make sense to pay for a subscription to use someone you'll only access every blue moon. They would've been better off keeping everything free and just advertising on the site."}, {"comment_id": "eibnz8a", "post_id": "b00xdr", "comment": "Yup, this is an incredible way to alienate their remaining audience. Good riddance, they've been making money only decisions for a long while now and were driving themselves out of the market anyway."}, {"comment_id": "eibr8bi", "post_id": "b00xdr", "comment": "[deleted]"}, {"comment_id": "eicid2u", "post_id": "b00xdr", "comment": "As an experienced player, I definitely have no incentive to pay for tabs, but I definitely do use them to help me recall solos and intros. It's a bit faster than doing it by ear. "}, {"comment_id": "eictnpd", "post_id": "b00xdr", "comment": "Agreed. Unless the song is extremely complex, I generally learn everything by ear after 15 years of playing. I think the only tab I used recently was to relearn Jeff Buckley's Hallelujah. It's a pretty long song with many subtle changes. Didn't feel like sitting down for a few hours figuring it all out.\n\nOther than that, I rarely, rarely use tabs. They're usually very inaccurate."}, {"comment_id": "eiek3oq", "post_id": "b00xdr", "comment": "as a dude who bought his first guitar two weeks ago I can confirm"}, {"comment_id": "eibhlo4", "post_id": "b00xdr", "comment": "Were some of Ultimate Guitar’s tabs scavenged from past free services that got shut down by the RIAA and friends? I’ve seen messages in tabs on UG referencing getting uploaded to “x” FTP server, and asking someone to mirror them to “y server, which screams 1999 to me.\n"}, {"comment_id": "eiboa12", "post_id": "b00xdr", "comment": "They where taken from OLGA "}, {"comment_id": "eibo6k7", "post_id": "b00xdr", "comment": "I know a lot of them were grabbed from Usenet servers back in the day. Thats how I got most of mine in the mid to late 90s."}, {"comment_id": "eibqjpc", "post_id": "b00xdr", "comment": "I miss mxtabs.net."}, {"comment_id": "eici60r", "post_id": "b00xdr", "comment": "Mxtabs and the musiciansforums were the place to be way back in the day"}, {"comment_id": "eidy2u1", "post_id": "b00xdr", "comment": "Lemme guess, they didn't monetize and had to shut down?\n\nUG does not have an insane subscription price."}, {"comment_id": "eic2kja", "post_id": "b00xdr", "comment": "Oh my god yes. I definitely started with mxtabs, so I might have had my timeline off when I said I’ve used UG since I started (definitely been using it at least ten years or so)."}, {"comment_id": "eibth7y", "post_id": "b00xdr", "comment": "I'm in the same boat as you u/Assforbreakfast. Used UG for years (and still do - to an extent), but this UG Pro bs is just too much. \n\n&#x200B;\n\nGood tip: Try googling the song you want, and add PDF in the search bar (i.e Cliffs of Dover TAB PDF) - and you'll have a good chance of finding transcriptions from magazines, or wherever. "}, {"comment_id": "eibnfdb", "post_id": "b00xdr", "comment": "Ultimate Guitar should be the face of /r/assholedesign"}, {"comment_id": "eicbu0p", "post_id": "b00xdr", "comment": "It's sad, I used to love UG but it's garbage now. They got too big and lost their roots. The app barely even works anymore also. "}, {"comment_id": "eibrf0t", "post_id": "b00xdr", "comment": "People should know that Ultimate Guitar is just a shady, dodgy group of intellectual property thieves, ran by a crooked Russian guy named Gene. "}, {"comment_id": "eic3fqq", "post_id": "b00xdr", "comment": "Simmons? I'd believe it."}, {"comment_id": "eibg8g5", "post_id": "b00xdr", "comment": "Wow that's really grimey, especially if they aren't paying the creators for directly profiting of their work."}, {"comment_id": "eibhh7m", "post_id": "b00xdr", "comment": "My friend wasn’t notified or anything. He signed up for the pro service just to check and found his stuff available only to pro."}, {"comment_id": "eicdvkn", "post_id": "b00xdr", "comment": "We are paying song authors (through publishers). "}, {"comment_id": "eibtxtd", "post_id": "b00xdr", "comment": "Oh no. What am I going to do without 13 different incorrect tabs on how to play Layla in the wrong fucking key?\n\nLol bye Ultimate Guitar, enjoy fading into obscurity where you belong."}, {"comment_id": "eic169y", "post_id": "b00xdr", "comment": "The thing that sucks is that if beginners were to google \"<song name> tab/chords\" UG is at the top of the results"}, {"comment_id": "eid0wqp", "post_id": "b00xdr", "comment": "By far your comment is the most nostalgic for me."}, {"comment_id": "eidby6m", "post_id": "b00xdr", "comment": "Actually, Clapton is one of the few artists to get most of his stuff taken down from UG."}, {"comment_id": "eibgvk3", "post_id": "b00xdr", "comment": "Invest your money in Transcribe or amazing slow downer and learn by ear. Once your ear gets up to speed you will never deal with frustrating tabs again."}, {"comment_id": "eiblnxm", "post_id": "b00xdr", "comment": "I've done by ear a few times. I'd say practice with Blues and Reggae songs to train the ear because they stick to 1-4-5 (blues) or simple progressions like Em to D7.\n\nIf you can figure out the key of a song, thats already half the battle. "}, {"comment_id": "eibrygv", "post_id": "b00xdr", "comment": "> Once your ear gets up to speed you will never deal with frustrating tabs again.\n\nPlaying, say, Oasis by ear is just fine.\n\nBut Life on Mars? Tab me thanks."}, {"comment_id": "eibhaxs", "post_id": "b00xdr", "comment": "I learn about half my songs by ear, I still need tabs for trickier things. Is Transcribe a tab site/software, or do you mean actually transcribing the songs?\n\nEDIT: typed sounds instead of songs"}, {"comment_id": "eibvhhf", "post_id": "b00xdr", "comment": "Riffstation is free too.\n\nIt's not perfect by any means but I've found it can at least get in me in the ballpark. "}, {"comment_id": "eibsoil", "post_id": "b00xdr", "comment": "What's transcribe?"}, {"comment_id": "eic18wx", "post_id": "b00xdr", "comment": ">Can you give me the link of this Transcribe app on Google Play Stoe? I am not able to find it. Found the slow downer app btw."}, {"comment_id": "eic2fg8", "post_id": "b00xdr", "comment": "Ear and if I am totally stuck Youtube, or ill try out isolated tracks. Also, just writing down what you THINK your hearing even it’s wrong does wonders for your inner ear and ability to play by ear."}, {"comment_id": "eic4tbg", "post_id": "b00xdr", "comment": "Would Transcribe sound crap when slowing things down? I haven't use it yet. I use YouTube player and slow down the video, but I can only go .75, lower than that the sound really gets messed up."}, {"comment_id": "eibon7c", "post_id": "b00xdr", "comment": "This is exactly why i switched to Songsterr. Not to mention more accurate tabs and a much cleaner and more modern layout. UG looks like it's stuck in 2003."}, {"comment_id": "eibr1sx", "post_id": "b00xdr", "comment": "This hasn't happened to any of my submitted tabs as far as I know, but I'd be absolutely furious if it did. (Their in-browser \"Pro\" tab player is godawful. I write everything in Guitar Pro for a reason.)\n\nI also aggressively adblock that site, so it's possible that's blocking some of the more obnoxious messaging. Can you link to any of the affected tabs you've found? I'm curious to see if there are any tells so I can anticipate if any of my tabs are next.\n\nFWIW, I upload all my tabs (Guitar Pro only – I don't do text tabs) to Ultimate Guitar (and nowhere else) for a few reasons:\n\n1. It's (AFAIK) where they'll get the most eyes. I think UG still has a much bigger userbase than Songsterr and other tab sites.\n2. I get credit for my submissions. All my tabs are fairly visibly attributed to me, whereas it's pretty buried in Songsterr.\n3. I can choose to prevent edits to my tabs. I got into uploading my transcriptions because I was dissatisfied (to put it lightly) with the horrendous Guitar Pro tabs on the interwebz. The last thing I want to do is cede editorial power to the same randos that were the reason I got into making tabs in the first place. Songsterr is all about being a \"wiki\" of guitar tabs, so they're always editable. Considering how subjective ear training can be, there is no way in hell I trust that given enough edits, people, and time, we will converge on \"the truth\" in a guitar tab. TL;DR I don't like Songsterr's edit model.\n4. Ultimate Guitar lets you download the source Guitar Pro files, which are the **only** way I recommend anyone use my tabs because all of the browser tab players out there are terrible. AFAIK you can't download Guitar Pro files from Songsterr at all.\n\nIf any of these things were to change, I'd look elsewhere for a tab host in a heartbeat."}, {"comment_id": "eichzol", "post_id": "b00xdr", "comment": "\\+1 to all your criticisms of Songsterr. The idea that there is one correct version of a tab just doesn't work out.\n\nYou can download GP tabs there, but they hide the button a little."}, {"comment_id": "eic3czu", "post_id": "b00xdr", "comment": "I've just given my tabs a check and it appears they leave the GPro tabs available still. Without being able to check the UG Pro tab properly, it seems convenient that the top rated Guitar Pro tab and the UG Pro tab have exactly the same ratings. My guess is that they simply take the highest rated GPro tab and use it for their own."}, {"comment_id": "eicdu1w", "post_id": "b00xdr", "comment": ">I also aggressively adblock that site, so it's possible that's blocking some of the more obnoxious messaging. \n\nAs a Tab Author you got Lifetime access. You don't have ads and have all Pro features =) \n\n&#x200B;"}, {"comment_id": "eic5334", "post_id": "b00xdr", "comment": "Yeah I also wamt tabs to play ON my PC to open with a real program, that's why I am annyoed by songsterr, and only use it when the Song in question has not tab on UG (sometimes it is on songsterr then) "}, {"comment_id": "eibjvvb", "post_id": "b00xdr", "comment": "Ultimate Guitar is a scumbag app."}, {"comment_id": "eibs4b0", "post_id": "b00xdr", "comment": "I used to have it on my phone, and tablet even... But the infectious ads on even **it** make it next to unusable. Like the cancer that is its mobile site. "}, {"comment_id": "eid85wc", "post_id": "b00xdr", "comment": "I was astounded that it was actually less usable than the web on mobile.  Fastest uninstall ever."}, {"comment_id": "eibkv25", "post_id": "b00xdr", "comment": "I paid for a year of the pro service last year and it’s running out shortly. Honestly it was nice to use but now that I’ve discovered Songsterr I won’t be renewing the pro service. Especially if this pans out to be true "}, {"comment_id": "eibp9m9", "post_id": "b00xdr", "comment": "I guess I was lucky when I paid the one time fee about two years ago. I was grandfathered into the lifetime subscription after they removed that option. I can’t remember exactly but I think I paid less than $10, which has been well worth it for the quality pro tabs. I’m not saying that there isn’t a better and more affordable service out there, just saying that UG has worked great for my needs."}, {"comment_id": "eibql8g", "post_id": "b00xdr", "comment": "Yeah, I think I paid exactly $10 a couple years ago.\n\nEven still, I fully expect that my lifetime \"pro\" account will somehow become lesser when they decide they want more money and start doing \"pro gold\" accounts at some point."}, {"comment_id": "eibtosn", "post_id": "b00xdr", "comment": "I did the same. I paid $5 back in 2014 and have had Pro access since. uBlock Origin kills the ads on the website - for my needs it fine. "}, {"comment_id": "eicofyf", "post_id": "b00xdr", "comment": "I paid $3 for the android app back in 2015 and got grandfathered in once it went free. I pretty well only use UG for the GP tabs so hands down the best $3 I ever spent"}, {"comment_id": "eibqlkd", "post_id": "b00xdr", "comment": "Songsterr is much better imo"}, {"comment_id": "eibv5ou", "post_id": "b00xdr", "comment": "all the tab sites today suck a huge dick.  They are all trying to profit from peoples sweat and effort, given for free.  Anyone on the internet 25ish years ago remembers OLGA, the On Line Guitar Archive, which had thousands of tabs all for free, but record companies sued them into oblivion.  "}, {"comment_id": "eiby92x", "post_id": "b00xdr", "comment": "People on the internet in 1993 feel your angst."}, {"comment_id": "eico9nx", "post_id": "b00xdr", "comment": "I've said this before, but I must be the only person in the world that is okay with UG. I gave them like $5 three years ago and I have had unfettered access to their \"Pro\" and \"Official\" tabs ever since, without a hiccup. I haven't seen an ad on their website or mobile app either (though there might be other reasons for that in my regard). The tab playback utilities are at least as good as any other out there IMO and, most importantly, the library is simply the largest on the internet right now. Not to mention, their new \"Official\" tabs are great, and I use those all of the time. Songsterr is cool too, but they require a subscription to a very expensive service to use all but their most basic tab playback controls, and I think that their tab selection is relatively small (at least for now) and that tabs aren't actually any better than those I find on UG.\n\nThe only thing that I really don't like about UG is their new \"Shots\" Instagram knock-off. That shit is pretty dumb.\n\nDownvote me to hell for liking a service that I have no personal qualms with. /s ^(kinda)"}, {"comment_id": "eicz3cf", "post_id": "b00xdr", "comment": "I'm with you. No issues with it at all. Got it very cheap about 3 years ago for life, use it all the time."}, {"comment_id": "eibokol", "post_id": "b00xdr", "comment": "that site already sucked. making it premium isnt gonna help them win any new fans."}, {"comment_id": "eibqzb5", "post_id": "b00xdr", "comment": "Silver lining is that ever since UG turned to shit, I’ve been forcing myself to learn by ear. Much slower and less convenient, but I feel it makes me a better musician. Any time I need help on solos, I just YouTube a tutorial. You’re right tho, UG is pure trash."}, {"comment_id": "eibskiv", "post_id": "b00xdr", "comment": "I abandoned tab maybe 8-10 years ago when I got out of high school. I finally had some time to double down and learn to train my ear. I'm still thinking of picking up a little more music theory now because I'm really starting to grow interest in the details of what makes music tick. Learning to play by ear though really freed me in a sense that I was learning songs my way, rather than learning exactly how a song was played or written. The guitar(and music in general) is just more fun when you're figuring things out for yourself."}, {"comment_id": "eibrwqu", "post_id": "b00xdr", "comment": "Lots of people saying Songsterr, and I agree.\n\nBut I wanted to say I also recently discovered Chordify which has been extremely helpful to my personal learning style."}, {"comment_id": "eibpvps", "post_id": "b00xdr", "comment": "Unpopular opinion it seems like but I like UG. I have a pro account though so"}, {"comment_id": "eicpca8", "post_id": "b00xdr", "comment": "I use it all the time but have to keep in mind most of the charts aren’t very accurate. \n\nFor me, when I have to learn a new song it’s a jumpstart.   The best is when I can find a good vid of the original guitarist playing it live.  \n\nLearned Under the Bridge last week and there is a whole video out there of John Frusciante playing all the parts solo on a couch! \n\nSo easy to just watch and learn. "}, {"comment_id": "eibspso", "post_id": "b00xdr", "comment": "I thought UG was fine for the period of time I used it. I did eventually stop using tab altogether, but if it works for you, that's great. I haven't used the website in nearly 10 years though, so I have no clue how much it's changed lol"}, {"comment_id": "eidsrzh", "post_id": "b00xdr", "comment": "same here. ads-wise I only use it on a laptop with ad blocker. looking at the blocked ad count it's the same as here on Reddit :)"}, {"comment_id": "eibrvcv", "post_id": "b00xdr", "comment": "Get ready for downvotes."}, {"comment_id": "eibu1nz", "post_id": "b00xdr", "comment": "I use the Ultimate Guitar Tabs mobile app and I personally think it's pretty well formatted. It was a ten dollar one-time purchase, and I've learned dozens of songs using it, so I'd say it was worth the money. I've never used their website, but I stand by the app."}, {"comment_id": "eic5asc", "post_id": "b00xdr", "comment": "I use UG Pro Tabs on my phone and honestly it can't be any better. I haven't used UG on PC since 2012 so I dunno what's happening there.\n\nOn mobile, it's definitely worth it.  Actually I think it's necessary."}, {"comment_id": "eic6exu", "post_id": "b00xdr", "comment": "I can't agree more. I don't know why so many people are ripping on it. Like $14 isn't much for an entire year of enjoying everything the app has to offer. "}, {"comment_id": "eibqt5w", "post_id": "b00xdr", "comment": "So... back to Olga.net then?"}, {"comment_id": "eibt16w", "post_id": "b00xdr", "comment": "That's fucking greasy"}, {"comment_id": "eibt34q", "post_id": "b00xdr", "comment": "Holy shit I wasn't the only one! I've also noticed tons of tabs I've used for years disappear (have the app on my ipod and had an account with many favourited tabs). Many have just vanished and when looking for them again all I found were Pro tabs.\n\nGlad I mostly use songsterr or my ear now. "}, {"comment_id": "eic4pao", "post_id": "b00xdr", "comment": "The Pro tabs are really good and a great way to learn and practice songs. Sounds like shilling, but it is genuinely a great product."}, {"comment_id": "eic9pz7", "post_id": "b00xdr", "comment": "I miss MX Tabs, back in the old days :("}, {"comment_id": "eicf4cs", "post_id": "b00xdr", "comment": "That's why I just downloaded a hacked version of the UG app off of AC Market. Locking everything behind pro is dumb as hell and it fucking sucks. "}, {"comment_id": "etyimge", "post_id": "b00xdr", "comment": "Holy cow tysm! I just did this today and it works flawlessly!!"}, {"comment_id": "eicuobi", "post_id": "b00xdr", "comment": "I use UG pro, i think it was $20 for a lifetime membership.  It has been well worth the price and i have only used it for just over a year, still have many years left.  I believe that they have in-house musicians creating the \"official\" tabs, which have all instrument parts tabbed out, a backing track feature, and the tonebridge app is linked as well.  You should try it.\n\n&#x200B;"}, {"comment_id": "eicyjub", "post_id": "b00xdr", "comment": "UG is an amazing resource. I paid for the lifetime Pro membership when it was on sale a couple of years ago and it is worth every dime. If you use it, pay for it. I wish that concept wasn't so hard to understand for some people. Wait for a sale if you don't want to pay full price."}, {"comment_id": "eid17ha", "post_id": "b00xdr", "comment": "So UG is paying users who upload new tabs? UG is *using* them to make money, would only be fair to *pay* for that."}, {"comment_id": "eid1xqg", "post_id": "b00xdr", "comment": "I have to be honest, I was always pretty anti-Ultimate Guitar - not a good mobile experience, tons of ads, bad tabs - name your complaint.\n\nOne day, during a weak moment, I was trying to figure out a solo for a song that was only on the pro version.  I saw they were having a sale, something like $39 for a lifetime subscription to their Pro service.  I figured, why not, I'll bite and try it out.\n\nI haven't turned back.  It's been 100% worth it.  Their Pro product is excellent.  I know it sucks that you have to pay for it, but honestly, if you can get it on sale, in the grand scheme of things it's small dollars if you play as much as I do.  I've gotten more than my money's worth.\n\nJust one person's opinion."}, {"comment_id": "eid7e7f", "post_id": "b00xdr", "comment": "THANK YOU!"}, {"comment_id": "eid2ku9", "post_id": "b00xdr", "comment": "I have the paid version for me and my band. It’s like $15 per year and we use it all the time. It’s iPad friendly and you can transpose, use an autoscroll function to play in real time, and there’s a YouTube video of the original song by the artist attached for reference on 90% of the songs listed. Finally, I can make playlists of my sets. I don’t use it as much for my older material as it’s committed to memory, but learning new covers has been great with it. I used the free version for years and finally paid for PRO. It was a world of difference in functionality. "}, {"comment_id": "eidedm7", "post_id": "b00xdr", "comment": "Songsterr works great . Friendly tip: Using the site from a web browser and not the app you can actually get full song tabs and not have to pay "}, {"comment_id": "eie8d2e", "post_id": "b00xdr", "comment": "yep if you don't own guitarpro, Songsterr is where it's at."}, {"comment_id": "eido8rm", "post_id": "b00xdr", "comment": "Ultimate Guitar does not care about guitar players."}, {"comment_id": "eibgemn", "post_id": "b00xdr", "comment": "I use the pro service, and here's why- when it comes to certain less popular or more international (read: non-US) bands, the UG pro tabs often has what I'm looking for while regular UG and Songsterr dont. Also, the pro tabs are usually the best version they could find, so there may be 8 versions of tabs for a song, but the Pro Tabs version is usually the best. That's just my experience, and what made it worthwhile for me."}, {"comment_id": "eibh39w", "post_id": "b00xdr", "comment": "I should have mentioned in my post that I’m sure the pro service is worth it for some people. That’s great that it works for you - but my issue is that they’re making tabs that used to be available to everyone only available to pro users. That and the ridiculous ads, and (to my knowledge) not paying or notifying the creators."}, {"comment_id": "eibsirz", "post_id": "b00xdr", "comment": "The tabs aren’t very accurate anyways. Least from my experience. "}, {"comment_id": "eibqh9x", "post_id": "b00xdr", "comment": "That’s wack. At least the only tab I ever (Studying Politics) contributed is still up and for everyone."}, {"comment_id": "eibtadz", "post_id": "b00xdr", "comment": "It was a few years ago where they made it sound like you got \"Pro\" by spending like $5 on their app, but then would force you to buy more and more things or else theyd spam you with 3-4 ads every launch of your $5 app. It was terrible but it's gotten better."}, {"comment_id": "eibzijv", "post_id": "b00xdr", "comment": "It’s fuckin lame but it also forces us to use our ears and our brains.  Ultimately, it will make us better.  Fuck ‘em."}, {"comment_id": "eibznmx", "post_id": "b00xdr", "comment": "honestly, since purchasing a premium account i've used it heaps- whereas previously I would avoid at all costs. They need to fix the free tier UX if they want to successfully convert their users."}, {"comment_id": "eic0hhm", "post_id": "b00xdr", "comment": "Dope username "}, {"comment_id": "eic2dl5", "post_id": "b00xdr", "comment": "Joe Rogan would approve."}, {"comment_id": "eic2w6f", "post_id": "b00xdr", "comment": "Sad to see the greats fall like this , UG used to be something special"}, {"comment_id": "eiccdj2", "post_id": "b00xdr", "comment": "Turns out I had a pro account. Must've paid for a lifetime on ages ago and forgot. I was using it without signing in and I agree, it's pretty full on with the hard sell."}, {"comment_id": "eiccoy9", "post_id": "b00xdr", "comment": "UG is always doing something to bone it’s users.  "}, {"comment_id": "eiccq79", "post_id": "b00xdr", "comment": "Brigade their Facebook page. They've initiated plenty of internet brigades so it'd be delightfully ironic if this came back on them by hijacking their facebook page."}, {"comment_id": "eicdj5m", "post_id": "b00xdr", "comment": "I found so many errors in their charts that I stopped bothering with their site all together."}, {"comment_id": "cg08vsa", "post_id": "206b29", "comment": "http://instagram.com/p/lVlgYcEKLc/\n\nThink I found a pic from that night, all credit to this lady on Twitter.  Rock on!\n\nAlso, did you know Robert Randolph tweeted/instagram'd about you???\n\nhttp://instagram.com/p/lTAXJVJWnF/\n\n\n"}, {"comment_id": "cg08y90", "post_id": "206b29", "comment": "That's it#!! Omg!!!! I love yoouuuuuuuu"}, {"comment_id": "cg09lfo", "post_id": "206b29", "comment": "> I should ask him to sit in tonight\n\nHaha, now *that* seams surreal!"}, {"comment_id": "cg0uyi8", "post_id": "206b29", "comment": "This is really incredible.  To be honest I was kind of skeptical, but you'd have to have some balls to fake a story like this when it could easily be proven false."}, {"comment_id": "cg08z2d", "post_id": "206b29", "comment": "Please tell me he got your contact info and that he'll keep in touch?"}, {"comment_id": "cg0abdm", "post_id": "206b29", "comment": "Yup, we're connected on FB and I have his tour manager in my phone. :)"}, {"comment_id": "cg08nm5", "post_id": "206b29", "comment": "As a frequent visitor of Denver (I live in Boulder) I bet I've seen you play. Do you have a little tiny amp, set up like 15 feet deep into the alley off 16th street? It's been a few years but I recall a shredder with a SRV style hat on. Is that you? Also, have you posted in here about playing on 16th before?  "}, {"comment_id": "cg08r3y", "post_id": "206b29", "comment": "Yes, yes and yes!!"}, {"comment_id": "cg0ho6y", "post_id": "206b29", "comment": "This thread has been linked to from elsewhere on reddit.\n\n\n - [/r/bestof] [Busker on /r/guitar writes about opening up for Robert Randolph in Denver after Randolph heard him play on the street the night before the show. Another redditor chimes in, remembers seeing OP play in the same alley a few years ago.](http://np.reddit.com/r/bestof/comments/207g5a/busker_on_rguitar_writes_about_opening_up_for/)\n\n\n*^I ^am ^a ^bot. ^Comments? ^Complaints? [^Send ^them ^to ^my ^inbox!](http://www.reddit.com/message/compose/?to=totes_meta_bot)*\n\n"}, {"comment_id": "cg093o3", "post_id": "206b29", "comment": "[Here](http://www.youtube.com/watch?v=gt5BVuIv4t8) is Robert Randolf for those of you who were wondering. Thats a crazy story too, something you will probabbly never forget."}, {"comment_id": "cg0a8ap", "post_id": "206b29", "comment": "I saw these guys live a couple of times. Just so everyone is aware how good these guys are: at one point in the middle of a song they start switching instruments. They all can play every instrument on the stage equally as well as the next guy. They just happen to play what they prefer most and Robert has the best voice. These.guys.are.amazing.  "}, {"comment_id": "cg0g9v9", "post_id": "206b29", "comment": "I've never seen him before.... Holy fucking SHIT that was great!!! "}, {"comment_id": "cg0lpv3", "post_id": "206b29", "comment": "I was listening to Voodoo Child right before I watched this. Crazy coincidence."}, {"comment_id": "cg0q83x", "post_id": "206b29", "comment": "Wow!"}, {"comment_id": "cg0tsuq", "post_id": "206b29", "comment": "The title and description say \"Voodoo Chile - Not to be confused with Voodoo Child (Slight Return)\", but they got them confused (they're actually playing Child)"}, {"comment_id": "cg0g4ew", "post_id": "206b29", "comment": "For anyone wondering, here is a video of OP playing in the alley that I found on youtube:\nhttp://www.youtube.com/watch?v=d89-vNfBxgQ\nhttp://www.youtube.com/watch?v=bB_NLRoUykg\nhttp://www.youtube.com/watch?v=HZ5hlGir9LM"}, {"comment_id": "cg1v4zs", "post_id": "206b29", "comment": "That's seriously fucking cool the way you stand in the alley and jam like that with your shadow in the background."}, {"comment_id": "ch96s55", "post_id": "206b29", "comment": "That's fantastic. "}, {"comment_id": "cg0fvb4", "post_id": "206b29", "comment": "I was at that show and you absolutely killed it. I saw the tweet previous to the show, but never expected you to play three songs and crush the solos. With all the shitty stuff in the world it's great to see someone rise to the occasion like that. It was amazing. Congratulations."}, {"comment_id": "cg0mgh7", "post_id": "206b29", "comment": "This comment makes me very happy.\n\nThank you. "}, {"comment_id": "cg0i1mm", "post_id": "206b29", "comment": "way outside the line cool"}, {"comment_id": "cg0737y", "post_id": "206b29", "comment": "So very cool. Glad you nailed it. I was nervous for you just reading this.\n\nAwesome job, dude."}, {"comment_id": "cg06vos", "post_id": "206b29", "comment": "Congrats man! Awesome story. A literal dream come true no doubt. "}, {"comment_id": "cg09qdm", "post_id": "206b29", "comment": "I think I have found 2 videos of that day unfortunately you dont seem to be in them, but maybe you can contact the uploaders and see if they have any footage of you on stage to upload :) \n\nhttps://www.youtube.com/watch?v=DNRIeBgY-CM\n\nhttps://www.youtube.com/watch?v=0zUio9iMAAE\n\nCongrats by the way its an awesome fucking story!"}, {"comment_id": "cg0a9hg", "post_id": "206b29", "comment": "I am on it, and thank you!"}, {"comment_id": "cg07oyu", "post_id": "206b29", "comment": "How was security when you told them you were invited to play?  Anyway, congrats man.  Stories like this literally warm my heart.  Also, you must have nerves of steel."}, {"comment_id": "cg08w5j", "post_id": "206b29", "comment": "Regarding the nerves...being a street musician requires a kind of courage, anyway.\n\nI channeled it and it served me well. "}, {"comment_id": "cg08ue3", "post_id": "206b29", "comment": "Security were skeptical. They wanted a name. So, I gave them the tour managers'.\n\nThey radioed him, he came out and in I went. "}, {"comment_id": "cg0dc7s", "post_id": "206b29", "comment": "OH my gosh Robert Randolph pulled me on stage too! I was amazed he was that generous.\n\nhttps://www.youtube.com/watch?v=vxiI_SAlfeU"}, {"comment_id": "cg0tbe2", "post_id": "206b29", "comment": "Happened to me too. I was a little drunk and nervous so I was disappointed in how I played but it was still cool. "}, {"comment_id": "cg079hg", "post_id": "206b29", "comment": "You lived every player's fantasy, my man. And it sounds like you did us all proud."}, {"comment_id": "cg07t1i", "post_id": "206b29", "comment": "I hope somebody was there with a camera, and filmed it.  I'd love to watch.  Sounds absolutely surreal."}, {"comment_id": "cg08sox", "post_id": "206b29", "comment": "I know right!! \n\nIn all my excitement, I didn't even think to ask someone to record it. :("}, {"comment_id": "cg089hw", "post_id": "206b29", "comment": "Try and find a recording of the night.  Youtube?  etc.."}, {"comment_id": "cg08rtv", "post_id": "206b29", "comment": "I am trying so hard. If anyone finds something it would just make me giddy to watch. "}, {"comment_id": "cg0913m", "post_id": "206b29", "comment": "Found, see my other comment!"}, {"comment_id": "cg0bit6", "post_id": "206b29", "comment": "This was an incredible story.  I smiled through the whole thing.  This is the kind of thing I would dream about as a kid...  Wait, I still dream about this.  How awesome that you did it and rocked it at that.  \n  \nThanks for sharing this and congrats on realizing the dream.  \n  \n"}, {"comment_id": "cg07mz8", "post_id": "206b29", "comment": "Dude, I got pulled onstage to play with Relient K once in college, and it was only for half a song, but it was the coolest feeling ever, so I can only imagine how unbelievable it must have felt for you. Congrats man! Awesome story."}, {"comment_id": "ck9iw89", "post_id": "206b29", "comment": "I was in Denver back in the summer of 2012, and I'm pretty sure I saw you jamming with another guitarist as well. I also took a picture that has been my cover page on facebook ever since. You mind confirming for me?\n\n[Imgur](http://i.imgur.com/DuHV5o3.jpg)"}, {"comment_id": "ck9vnht", "post_id": "206b29", "comment": "Yes! That is me! Great picture. This made me smile really big. \n\nI still play in that same alley, every weekend. :)"}, {"comment_id": "cg0afjq", "post_id": "206b29", "comment": "This is dream come true territory. Congrats dude, must have been an amazing experience."}, {"comment_id": "cg0akdh", "post_id": "206b29", "comment": "It's funny...now that a few days have passed, my normal day-to-day life seems kinda dull. \n\nI was a star for 20 minutes. \n\nNow I'm back to just being Bret. \n\nBut you know...that's OK. :)"}, {"comment_id": "cg07c4y", "post_id": "206b29", "comment": "Holy shit that sounds amazing.  I love Galactic.  Also, pics of your warmoth?"}, {"comment_id": "cg0a8op", "post_id": "206b29", "comment": "Congrats! So lucky to have all your hard work pay off like this.\n\nKeep an eye out here - \n\nhttp://bt.etree.org/index.php?cat=149&sort=added\n\nA recording of the show may pop up.\n"}, {"comment_id": "cg0aitf", "post_id": "206b29", "comment": "That's a great link, thanks. Saving it. "}, {"comment_id": "cg0efpn", "post_id": "206b29", "comment": "Hey, I was at that concert!!  No, it was just a dream.  But you were great!"}, {"comment_id": "cg07bib", "post_id": "206b29", "comment": "Congrats man, sounds amazing!!"}, {"comment_id": "cg08121", "post_id": "206b29", "comment": "Robert Randolph is *the man!* So is Galactic- Stanton Moore is amazing. Super jelly of this story."}, {"comment_id": "cg084st", "post_id": "206b29", "comment": "Randolph is amazing. What he does is unreal. Great story to hear and I'm glad you did well man."}, {"comment_id": "cg07ltm", "post_id": "206b29", "comment": "As a musician who has never played to more than maybe 120 people at once, I commend you on how you handled yourself. I woulda been a complete nervous wreck. Congrats on killing it out there! Awesome story."}, {"comment_id": "cg08864", "post_id": "206b29", "comment": "Just simply...wow!"}, {"comment_id": "cg0b398", "post_id": "206b29", "comment": "This is probably the most awesome story I've read on here .. ever.\n\nKudos dude, way to live a dream (you didn't even know you had)!"}, {"comment_id": "cg0cp6m", "post_id": "206b29", "comment": "Best post ever on this subreddit. Incredible. Sad that I have only one upvote to give."}, {"comment_id": "cg0dlqd", "post_id": "206b29", "comment": "I got chills reading your story!! What an awesome experience you had! "}, {"comment_id": "cg0irql", "post_id": "206b29", "comment": "I got chills and almost teared up reading this. You got to live out every bedroom-shredder's dream. Wishing you the best and hoping this is a permanent step up for you. "}, {"comment_id": "cg0auoy", "post_id": "206b29", "comment": "Awesome story! I have a similar story from '07 when my band opened for his. They are a great band. I'm sure you will find audio of it.\n\nHere's a pic:\n\nhttp://i.imgur.com/KlzgTcz.jpg\n\nHere's a clip:\n\nhttp://www.frankdenigris.com/rrfb2007-02-15d2t04MyPart.mp3\n"}, {"comment_id": "cg0gnvk", "post_id": "206b29", "comment": "Whoa, he's good.  Very unique style, but totally accessible and technically proficient.\n\nGood job, OP."}, {"comment_id": "cg08lmo", "post_id": "206b29", "comment": "Love Robert Randolph & the Family Band, that's fucking amazing dude. I've never heard of Galactic, so I'll have to check them out - CONGRATS. Can't imagine..."}, {"comment_id": "cg08pzj", "post_id": "206b29", "comment": "Hell yeah man!! That is badass, and I love that venue, seen many a good show there. "}, {"comment_id": "cg0a5oh", "post_id": "206b29", "comment": "Holy shit, man, that's the best story I've ever heard. Thank God for social media - that sounds like a story no one would ever believe without proof!"}, {"comment_id": "cg0bjcz", "post_id": "206b29", "comment": "I don't comment on these types of stories often, but this is just amazing.  You pretty much just lived my dream, especially since I'm a huge huge huge RRTFB fan.  I've seen them 3 times and every time I always imagine myself up on stage jamming with them.  Way to go man!"}, {"comment_id": "cg0buhz", "post_id": "206b29", "comment": "Unreal story. Thanks for sharing. Robert Randolph is indeed the man. One of my favorite ACL shows ever. \n\nhttp://www.youtube.com/watch?v=8F8PLsV2dVk\n\nhttp://www.youtube.com/watch?v=PtxYAQt8Fhg\n\nHe railed at Crossroads too. "}, {"comment_id": "cg0cgew", "post_id": "206b29", "comment": "Holy shit. Robert Randolph and Galactic. You motherfucker. "}, {"comment_id": "cg0d1ss", "post_id": "206b29", "comment": "Randolph is the man! Saw him pull a dude out of the crowd to play guitar with the band for a song when I saw them at Randall's Island a bunch of years back.  RR is a freakin virtuoso and seems like the most grounded dude ever.  Awesome job sitting in!  Takes some balls to deliver like you did. "}, {"comment_id": "cg0dm80", "post_id": "206b29", "comment": "Holy shit dude! Congratulations on such an amazing gig! I'm pretty jealous but very happy that you nailed it!"}, {"comment_id": "cg0t1e0", "post_id": "206b29", "comment": "It sounds to me like you could look into playing venues other than street corners."}, {"comment_id": "cg0tbcu", "post_id": "206b29", "comment": "Yes. You're right; I could.\n\nBut to be honest, my music is for the unsuspecting stranger - the person who didnt see it coming, and who feels like he/she just 'found' something in coming across me. \n\nI want to give my music to the broadest demographic possible. As close to 'all' people as possible. \n\nPlaying in a club or bar sequesters the sound...suddenly it becomes inaccessible to most.\n\nThat's why the street is my preferred venue. "}, {"comment_id": "cg0uhy6", "post_id": "206b29", "comment": "I was at this show! you killed it man congrats, I can't even imagine what that must've felt like"}, {"comment_id": "cg0ut7s", "post_id": "206b29", "comment": "I suck at the guitar, but I find this story inspiring! :)\nCongrats bro! Amazing."}, {"comment_id": "cg0zc30", "post_id": "206b29", "comment": "Holy shit! Just by reading your experience, I could feel weakness in my fingers and butterfly in my stomach. Cheers, man! I'm happy for you."}, {"comment_id": "cg1bj8h", "post_id": "206b29", "comment": "What an amazing opportunity, and an equally amazing response. You did it right. You played a packed, famous house, with an incredibly awesome band, got to see ANOTHER incredibly awesome band for free, and fucking destroyed on top of all of it. \n\nhttp://blakesnow.com/wp-content/uploads/sites/2/2013/10/url-1.gif"}, {"comment_id": "cg098gp", "post_id": "206b29", "comment": "[deleted]"}, {"comment_id": "cg0amii", "post_id": "206b29", "comment": "That is quite commendable, I <3 Slaughter, and I actually shook Mark Slaughter's hand once at a show in Atlanta. \n\nAnd thanks!"}, {"comment_id": "cg08rqr", "post_id": "206b29", "comment": "That is an awesome story. "}, {"comment_id": "cg098me", "post_id": "206b29", "comment": "Awesome story man! As an aspiring guitarist myself, i hope to have the luck one day to experience something like that firsthand!"}, {"comment_id": "cg0eflc", "post_id": "206b29", "comment": "I really think it takes a lot more than just luck to get in that situation. :)"}, {"comment_id": "cg09hg4", "post_id": "206b29", "comment": "very cool!"}, {"comment_id": "cg09m8o", "post_id": "206b29", "comment": "Awesome story. I'm going to New Orleans Jazz Fest and already have my tickets to see [The Word](http://en.wikipedia.org/wiki/The_Word_(band)). Can't wait. How awesome for you! I saw Galactic a month ago in Cincinnati they're so good. What a dream come true."}, {"comment_id": "cg09upw", "post_id": "206b29", "comment": "This is THE DREAM. Congratulations and may such awesome things continue to flow into your life. \n\nReminded me of that kid who was picked to fill in for Keith Moon at a Who concert. "}, {"comment_id": "d4hfqxs", "post_id": "4p24i2", "comment": "Running the tubes hard like that will limit their lifespan, but it won't damage them per se."}, {"comment_id": "d4hg35q", "post_id": "4p24i2", "comment": "Thank you. Now, I'm really going to show my ignorance here. Does it matter of I run my amp at 60 vs 120w (switchable) in that regard? "}, {"comment_id": "d4ik18f", "post_id": "4p24i2", "comment": "How about this hypothetical: is the circuitry in the fuzz up to the task of handling the boosted signal from the preamp section?"}, {"comment_id": "d4hmumj", "post_id": "4p24i2", "comment": "> *Is there any truth to this*\n\nNot that you have to worry about;  For gods sake, tubes can handle square waves.  So fuzz away. \n\nHere's a quick read on failure mechanisms if you know something about tube composition: http://www.w8ji.com/vacuum_tubes_and_vaccum_tube_failures.htm\n"}, {"comment_id": "d4hhrv5", "post_id": "4p24i2", "comment": "What amp is it?"}, {"comment_id": "d4hhszb", "post_id": "4p24i2", "comment": "Egnater Vengeance "}, {"comment_id": "d4hsj3r", "post_id": "4p24i2", "comment": "> Please don't upvote.\n\nDon't do this."}, {"comment_id": "d4ht5sp", "post_id": "4p24i2", "comment": "Ah, the famous don't upvote ploy"}, {"comment_id": "d4hxmxt", "post_id": "4p24i2", "comment": "does it count at all for text based posts though?  thought it was only counted on link based posts?"}, {"comment_id": "d4hgbua", "post_id": "4p24i2", "comment": "[removed]"}, {"comment_id": "d4hssf3", "post_id": "4p24i2", "comment": "Seriously, what's the point of \"Please don't upvote\"?"}, {"comment_id": "d4hgre3", "post_id": "4p24i2", "comment": "MONSTER"}, {"comment_id": "d4i0j0a", "post_id": "4p24i2", "comment": "You got played."}, {"comment_id": "d4hl3sk", "post_id": "4p24i2", "comment": "WAKE ME UP INSIIIIDE"}, {"comment_id": "d4hycu2", "post_id": "4p24i2", "comment": "Fuck you, I won't do what you tell me!"}, {"comment_id": "d4icrk4", "post_id": "4p24i2", "comment": "But... he said please. "}, {"comment_id": "d4im4hv", "post_id": "4p24i2", "comment": "Don't give me Reddit Gold."}, {"comment_id": "d4hx1vr", "post_id": "4p24i2", "comment": "You sonofabitch "}, {"comment_id": "d4hh11r", "post_id": "4p24i2", "comment": "No problem with running it in an effects loop. You're just bypassing the preamp. Pretty sure it won't put any more load on the speakers than it would be going through the front. Here's an upvote."}, {"comment_id": "d4hhb2p", "post_id": "4p24i2", "comment": "Thank you, I really appreciate the feedback (no pun intended?). I just got this crazy idea that it would just hammer the hell outta the power tubes, but I guess you're right in that it wouldn't be anywhere near what the pre amp is pushing. Cheers. "}, {"comment_id": "d4ifxyv", "post_id": "4p24i2", "comment": "i just love how reddit upvoted the crapperonni out of this ahahah"}, {"comment_id": "d4iriur", "post_id": "4p24i2", "comment": "Welcome to r/all. In all my years on reddit (no not this account) I'm not sure I have ever seen an /r/guitar post make it this high on r/all. Currently sitting at #83 for me."}, {"comment_id": "d4iuaa2", "post_id": "4p24i2", "comment": "Trust me, I'm just as surprised as you are. This single post has more action than my 5 year old real account. I made a throw away because I thought it was such a dumb question... "}, {"comment_id": "d4ho9v6", "post_id": "4p24i2", "comment": "\"Don't upvote\" the indirect way of begging for upvotes\n"}, {"comment_id": "d4htm1b", "post_id": "4p24i2", "comment": "Have you tried turning it to 11?"}, {"comment_id": "d4huajo", "post_id": "4p24i2", "comment": "Does that mean it's... Louder? "}, {"comment_id": "d4hm9pg", "post_id": "4p24i2", "comment": "As others have said, it will shorten the life of your power tubes, but not really damage them per se. I would also add that if you're doing something to shorten your tube life, you're doind something right. :) \"If you didn't break something, you're not running hard enough!\""}, {"comment_id": "d4hjnt5", "post_id": "4p24i2", "comment": "Downvoted for telling me not to upvote."}, {"comment_id": "d4hof3g", "post_id": "4p24i2", "comment": ">Please don't upvote\n\nnice reverse psychology my man"}, {"comment_id": "d4i3z0s", "post_id": "4p24i2", "comment": "Unless you have a post-loop volume, the pedal is now your volume control. No worries there. \n\nI'd worry more about the lifespan of your fuzz pedal than your tubes, as you are putting line level into your instrument level effect. No doubt, that's effecting your gain structure in unusual ways, which you might find pleasing, but it wasn't designed for that, so be aware. Depending on the value of the pedal, the trade off might be worth it."}, {"comment_id": "d4i4sqy", "post_id": "4p24i2", "comment": "Very interesting. Since I am just beginning to learn about the circuitry of effects, what specific types of issues could I potentially run into by running a hard signal into the pedal? "}, {"comment_id": "d4icby2", "post_id": "4p24i2", "comment": "No, nothing to worry about, won't hurt anything. Regardless of what effects you plug in, it's still the same analog signal that gets sent to the amplifier.  You can see this with a voltmeter if you're interested. Hook the leads to the patch cable that you'd normally plug into the jack on the amp, and experiment. It's just an analog signal until it hits the amplifier, nothing more. At least not with any effects pedal I've ever used (distortion, flanger, chorus, echo, etc). Most of the distortion pedals work by overdriving the signal with their own internal circuitry that causes the signal to sort of \"square\" off the top/bottom of the amplitude, which is what makes it sound fuzzy and distorted, but the signal going to the amp doesn't increase in voltage or anything like that.  I'm an engineer, but this isn't my area of expertise, so my apologies if the details are a bit off. Again - check it with a voltmeter. Touch one lead to the tip, the other to the shaft below the collar, and set it to DC. You may see a slight variance due to added resistance when you turn pedals on and off, but it should stay relatively the same.  I have an old tube head that I've been using since the 80's, never had an issue, have never had to replace any tubes (mine uses GE-6L6's). I do notice differences in sound when changing the order of the pedals. For example, I like to put my distortion in front of an old analog Morley wah-wah. It just sounds better when it's in front as opposed to behind.  That's probably because the wah-wah is from the 70's and 100% analog. Most stuff these days are digital. The old wah-wah is essentially a tone pot with a light-absorbing potentiometer. There's a flap of black felt that covers or uncovers its lens as you operate the pedal. That in turn operates the tone lot. Pretty ingenious, really.   "}, {"comment_id": "d4ikn5g", "post_id": "4p24i2", "comment": "Thank you for the technical answer. I am just starting down a path of learning electronics, as I'd like to start building pedals. One of the most important things I think people miss is WHY to do things. I'm sure I could learn very quickly how to build a guitar pedal, but I'd like to understand why to do things and how things actually work. "}, {"comment_id": "d4hm583", "post_id": "4p24i2", "comment": "[deleted]"}, {"comment_id": "d4hql6f", "post_id": "4p24i2", "comment": "upvote for, rage."}, {"comment_id": "d4houhk", "post_id": "4p24i2", "comment": "With some fuzz pedals, too much input can cause then to temporarily conk out. I did this same set up - I found I had to watch the preamp gain very carefully. "}, {"comment_id": "d4ibkgy", "post_id": "4p24i2", "comment": "I need to try this...."}, {"comment_id": "d4iciof", "post_id": "4p24i2", "comment": "I think you got a bit upvoted."}, {"comment_id": "d4if1qo", "post_id": "4p24i2", "comment": "I'm an electronics tech, and have designed and built tube amps. The voltage levels of (most) audio signals will not damage anything.\nMost tube amps today are designed with massive amounts of distortion coming from the pre-amp to the power amp. As long as you don't send 120ac through the effects loop, your fine.\n(Personally, I prefer power tube distortion over pre-amp distortion anyday.)"}, {"comment_id": "d4iiyf6", "post_id": "4p24i2", "comment": "\"Please don't upvote\" haha"}, {"comment_id": "d4ilxmc", "post_id": "4p24i2", "comment": "I use a tube pre-amp ( set to < 1! lol ) as the last stage in my Modelling/FX chain to soften up the digital edges. My amp is solid state, running clean. Gets loud as fuck.  Been running the same tubes for > 10 years, so I think you're good. "}, {"comment_id": "d4inkq8", "post_id": "4p24i2", "comment": "I'm a little noobish by what this all means. When u use my pedals I have a chord that goes from my guitar, into my pedals, then my pedals are all connected by cables, and those cables go into when my guitar would go if it was solo. Is this considered my \"effects loop?\""}, {"comment_id": "d4iqszl", "post_id": "4p24i2", "comment": ">Please don't upvote\n\nGood luck with that"}, {"comment_id": "d4irwpk", "post_id": "4p24i2", "comment": "Nothing to worry about, especially if your volume is fairly close to the same with the pedal on/off. If its like, MASSIVELY boosting the volume when its on, that'd be the only way it could even possibly hurt anything, and even at that you'd have to be really hammering the tubes with a lot of power, probably more than the pedal can even put out.  "}, {"comment_id": "d4iu7nd", "post_id": "4p24i2", "comment": "I was hoping so. Seems like such a dumb question, but overthinking it I was able to convince myself that it made sense it could be harmful. "}, {"comment_id": "d4iwv8b", "post_id": "4p24i2", "comment": "goddamnit not again"}, {"comment_id": "d4i0e4r", "post_id": "4p24i2", "comment": "Bullshit.  Running a fuzz in the loop doesn't harm anything "}, {"comment_id": "d4hw34c", "post_id": "4p24i2", "comment": ">Please don't upvote.\n\n1000 upvotes."}, {"comment_id": "d4hws83", "post_id": "4p24i2", "comment": "So glad my idiocy is trending "}, {"comment_id": "d4huh6e", "post_id": "4p24i2", "comment": "Ahh the old \"Please don't upvote\" upvote"}, {"comment_id": "d4iv7eh", "post_id": "4p24i2", "comment": "lol he sed dont upvote but i upvoted xD so funny so clever lol reddit silly :P xD"}, {"comment_id": "d4hu2wi", "post_id": "4p24i2", "comment": "[deleted]"}, {"comment_id": "d4iajdm", "post_id": "4p24i2", "comment": "*Cringe*"}, {"comment_id": "d4hks14", "post_id": "4p24i2", "comment": "Uhhhhhh......\n\n*Turns to the camera*\n\n\"We're being trolled. Right? That's what this is? Come on guys, you can tell me. Am I being trolled?\""}, {"comment_id": "d4hqewy", "post_id": "4p24i2", "comment": "\"You mean to tell me that there are people who don't know as much as me? Better make fun of them!\"\n\n-/u/Sla5021 "}, {"comment_id": "d4i4sfn", "post_id": "4p24i2", "comment": "Hey man, why can't I use more than two tie rods in a universal pipe expansion joint designed for 5 degrees of angulation?\n\nOh, you're not familiar with that relatively simple answer extremely specific to my particular set of interests or hobbies? What a dumbass."}, {"comment_id": "cjo0fp4", "post_id": "2dbw15", "comment": "If you've never played before, just start hitting random parts of the fretboard.  I'm sure you'll sound autistic."}, {"comment_id": "cjo1zbn", "post_id": "2dbw15", "comment": "I was going to suggest getting it vaccinated."}, {"comment_id": "cjo5zxq", "post_id": "2dbw15", "comment": "That what we call playing \"August Rush\" style. "}, {"comment_id": "cjo1fa1", "post_id": "2dbw15", "comment": "Auto correct is a bitch sometimes."}, {"comment_id": "cjohd4o", "post_id": "2dbw15", "comment": "I love the internet's point of view on autism which is basically autistic people are awkward and stupid."}, {"comment_id": "cjp0z8a", "post_id": "2dbw15", "comment": "Thanks, I just spit out my coffee, bastard.\n"}, {"comment_id": "cjojulv", "post_id": "2dbw15", "comment": "[deleted]"}, {"comment_id": "cjo4txc", "post_id": "2dbw15", "comment": "I recommend getting a Real Book, which is a big book of jazz standards. \n\nThen memorize the page number, key, time signature and year of composition of each song. Once you have that down, sit in the corner with your arms wrapped round your knees, while rocking back and forth and muttering the aforementioned details to yourself."}, {"comment_id": "cjob852", "post_id": "2dbw15", "comment": "Real book is love. Real book is life. "}, {"comment_id": "cjoarhy", "post_id": "2dbw15", "comment": "Damn."}, {"comment_id": "cjoftdl", "post_id": "2dbw15", "comment": "*Real book in C"}, {"comment_id": "cjontyf", "post_id": "2dbw15", "comment": "Problem is you need to know each song in the key it is written, and then all other keys.  "}, {"comment_id": "cjosoqe", "post_id": "2dbw15", "comment": "Serious question: will the Real Book teach me how to play jazz?"}, {"comment_id": "cjo0ov3", "post_id": "2dbw15", "comment": ">autistic guitar\n\nlol\n\nYouTube has some great beginners lessons and song guides, try looking up justinguitar. Once you know a few chords, try looking up the chords/tab to a song you like and give it a go. "}, {"comment_id": "cjo1gme", "post_id": "2dbw15", "comment": "Thanks, will definitely check him out!  \n  \nAlso, auto correct"}, {"comment_id": "cjo2q5i", "post_id": "2dbw15", "comment": "Aside from the jokes and the \"where to go to get lessons\" information, I have one piece of advice for you. \nWhatever acoustic guitar you buy... Budget in a proper setup.  Likely you will not be buying a high-end instrument to start with, and most entry-level guitars are shipped with notoriously high actions.\nThis will make your learning experience doubly hard.\n\nHaving the instrument set up properly by a decent technician will make a world of difference in terms of playing ease."}, {"comment_id": "cjo80i7", "post_id": "2dbw15", "comment": "The action on my first acoustic was so high it was like trying to press power lines down. Ended up serving me well, cause I got these callouses to brag about now. Never played an F on that thing, though."}, {"comment_id": "cjogt42", "post_id": "2dbw15", "comment": "i was under the impression that there isn't much you can do for an acoustic's set up"}, {"comment_id": "cjohlkl", "post_id": "2dbw15", "comment": "I've literally just bought my first acoustic having played electric for 10 years and can't get a decent barre chord. Is this possibly why I can't get by top three strings ringing properly? I know my technique isn't amazing (I'm a bad practiser) but my left hand is fucking *killing* from pushing so hard on the barre."}, {"comment_id": "cjohmdw", "post_id": "2dbw15", "comment": "Yup. My first acoustic was a diamond in the rough as far as action goes. My sub-$200 Cort acoustic has better action than a lot of electrics. It was so easy to learn on!"}, {"comment_id": "cjol1cd", "post_id": "2dbw15", "comment": "I learned to play on a classical guitar set up with steel strings. I winced my way through six months of excruciating pain. When I finally felt confident enough to take the two or so songs I'd learned out of my basement, my friend (and first guitar teacher) told me what I was doing to myself. I then bought my first electric guitar and it was like heaven. I don't think I would still be playing today if I hadn't learned to hard way. \n\nTl;dr: I have sick calluses, too! "}, {"comment_id": "cjoskre", "post_id": "2dbw15", "comment": "FYI, monoprice now has autistic guitars and the action is great. "}, {"comment_id": "cjobkpz", "post_id": "2dbw15", "comment": "I already have a decent guitar, just need to set it up."}, {"comment_id": "cjo9enm", "post_id": "2dbw15", "comment": "My autistic guitar knows **everything** about dinosaurs."}, {"comment_id": "cjoabb8", "post_id": "2dbw15", "comment": "Mine knows everything about swears and politics.  \nIt's a *genius* really."}, {"comment_id": "cjo72bk", "post_id": "2dbw15", "comment": "As a guitar player diagnosed with some sort of autistic spectrum disorder, I would recommend skipping guitar and buy a MOOG. I find synth and electronic music to be quite calming. "}, {"comment_id": "cjok984", "post_id": "2dbw15", "comment": "<slow clap so as not to disorient>"}, {"comment_id": "cjo4mxp", "post_id": "2dbw15", "comment": "You've come to exactly the right place to find autistic guitarists."}, {"comment_id": "cjo33lm", "post_id": "2dbw15", "comment": "[deleted]"}, {"comment_id": "cjo4m53", "post_id": "2dbw15", "comment": "I didn't know he had advanced lessons. Didn't it stop at intermediate?"}, {"comment_id": "cjobiex", "post_id": "2dbw15", "comment": "I hope this site will bring me good knowledge :)"}, {"comment_id": "cjob0gz", "post_id": "2dbw15", "comment": "Most of the stuff is free, from what I remember. I believe there is premium content only sold on his DVD's, or in private lessons. "}, {"comment_id": "cjo0yn5", "post_id": "2dbw15", "comment": "4chan /mu/ are the biggest autists on the internet, you should probably go there "}, {"comment_id": "cjoa1hh", "post_id": "2dbw15", "comment": "It's a hell of a lot better than /r/music anyway"}, {"comment_id": "cjo52yh", "post_id": "2dbw15", "comment": "What is /mu/ like?  I know /b/ and /pol/ are widely considered shitshows.  Never heard much about /mu/."}, {"comment_id": "cjo1l97", "post_id": "2dbw15", "comment": "I wouldn't know.  \nAuto correct is a bitch."}, {"comment_id": "cjoobe1", "post_id": "2dbw15", "comment": "[deleted]"}, {"comment_id": "cjobz68", "post_id": "2dbw15", "comment": "autistic guitar isnt easy man, but its a very noble choice. you clearly have a big heart!\n\nStart off by introducing yourself slowly to the autistic guitar, it may take weeks, even months before your autistic guitar will familiarise itself enough with you before you can even touch it. \nOnce you have the autistic guitar's trust, make sure the guitar is in tune to the optimum possible tuning. Never tune it without asking. even when tuning, constantly re-assure the guitar that soon he will be in another tuning , one he is comfortable with. \n\nIt is imperative that before and after playing with your autistic guitar that you clean the neck methodically and religiously. Do it the same every time to avoid upsets.\nIf your autistic guitar needs reset or repaired (after a tantrum the average autistic guitar can cause a considerable amount of damage to itself and others, making it one of the most volatile of the special need's instruments, aside from the downs syndrome banjo), I know of a special needs luthier who may be able to help.\n\nAbove all else though, never EVER play a wrong note or break a string. You will pay the price if you do.\n\nI have been playing autistic guitar for around 4 years now, but I had previous experience with an ADHD Uke so I wasn't new to it exactly.\n\nFor autistic tabs look at www.assbergertabs.com\n\nHope this is of some help dude. And can I just be the first to say that I think it`s great that you are picking up the autistic guitar, not many guys like you in the world left!\n"}, {"comment_id": "cjohy23", "post_id": "2dbw15", "comment": "I really hoped that assbergertabs.com was a legit site :("}, {"comment_id": "cjorvrn", "post_id": "2dbw15", "comment": "My side literally hurt after \"Downs Syndrome Banjo\""}, {"comment_id": "cjot1j2", "post_id": "2dbw15", "comment": "Why does this not have more upvotes?"}, {"comment_id": "cjri4qo", "post_id": "2dbw15", "comment": "| aside from the downs syndrome banjo\n\nI was already laughing like a tard and then this.. I just woke up the whole neighborhood"}, {"comment_id": "cjo0s6q", "post_id": "2dbw15", "comment": "Excellent question.  I've only learned to play Tourettes guitar, which mostly involves learning a few power chords to play out of rhythm while yelling and cussing.  It's sort of like hip hop but with actually playing music in the background."}, {"comment_id": "cjo1h3u", "post_id": "2dbw15", "comment": "Man, I hate that guitar forums can't stop that tired awful joke about Hip-Hop."}, {"comment_id": "cjo6dxi", "post_id": "2dbw15", "comment": "omg rap sux XD im 12 and i listen 2 real music"}, {"comment_id": "cjoab1i", "post_id": "2dbw15", "comment": "I feel bad for you, there are many beautiful pieces of hip hop music that sound great with and without vocals. Just as all other music though, the good stuff is usually obscured by popular crap. "}, {"comment_id": "cjo2hr0", "post_id": "2dbw15", "comment": "DAE LE RAP ISN'T REAL MUSIC???\n\nThis subreddit has the most homogenous music taste of all time."}, {"comment_id": "cjo4mh6", "post_id": "2dbw15", "comment": "so...Punk rock?"}, {"comment_id": "cjo3vz1", "post_id": "2dbw15", "comment": "It's punk rock."}, {"comment_id": "cjoba1n", "post_id": "2dbw15", "comment": "So it must sound almost like Death Grips then..."}, {"comment_id": "cjohd9s", "post_id": "2dbw15", "comment": "I think it was officially called Nu Metal actually."}, {"comment_id": "cjoln22", "post_id": "2dbw15", "comment": "> I've only learned to play Tourettes guitar\n\nIs this you? https://www.youtube.com/watch?v=Vms_6_TSQuc"}, {"comment_id": "cjoboa9", "post_id": "2dbw15", "comment": "/r/Djent \n\n^^^^^^^hehehehe"}, {"comment_id": "cjo044w", "post_id": "2dbw15", "comment": "On a serious note though, there are many YouTube lessons of super basic things, these can help alot as they can just point you in the right direction; It will give you a decent framework to follow and slowly progress. \n\nDepending on what type of player you aspire to be, look up songs you enjoy in that genre, and slowly slowly progress as both a player and a musician. (Don't forget to try and learn the theory of the guitar, as boring as it may seem, it will honestly help you later on.) \n\nEDIT - What I mean about the \"theory\" of guitar; I mean try to learn major scales - These are the basis of becoming a great player. - It will help you understand the basic make up of a chord, its structure and what notes will be able to be played with the chord.\n\nI understand you have no prior knowledge about the instrument so as mentioned earlier my advice is;\nLearn basic open chords (C,D,E,F,G,A,B)\n**Try** to learn your major scales. These are strenuous when you first begin, but I promise they will help out.\nand be as open you can to advise from others, the stuff I have learn't here on Reddit is amazing, there are so many people who are always keep to help out. "}, {"comment_id": "cjo0bna", "post_id": "2dbw15", "comment": "Wow! Thanks!  \nI will definitely check out some of the tutorials when I come home and give a try to the basic theory.   \nWould you mind if I pm you sometime to show you my progress and ask for advice?  \nYou seem like a great guy/lady."}, {"comment_id": "cjo8yki", "post_id": "2dbw15", "comment": "This has been my approach, and it's been a total blast. YouTube has some really great stuff on it, and learning to strum a few chords opens doors for some real playing gigs. Playing gigs, not paying.\n\n+1 about practice. The hardest part of any instrument is working out a practice regimen that is both enjoyable to work on, and that helps you progress on things that are important.\n\nFinding someone to play with can be quite helpful. There are lots of little jam sessions floating around that are welcoming to total beginners. Just play quietly, and nobody will care.\n"}, {"comment_id": "cks7iph", "post_id": "2dbw15", "comment": "Start by understanding the guitar's disability and that is probably really good and 1 note but may struggle with others. http://www.autism-society.org/"}, {"comment_id": "cjoqoj9", "post_id": "2dbw15", "comment": "Oh Comely"}, {"comment_id": "cjoxks4", "post_id": "2dbw15", "comment": "That entire album is good for beginners. \n\nAlso I'm pretty sure Jeff Mangum is somewhere on the spectrum. "}, {"comment_id": "cjo4qzc", "post_id": "2dbw15", "comment": "What a hilarious and totally accidental typo!"}, {"comment_id": "cjoaslu", "post_id": "2dbw15", "comment": "Yup haha."}, {"comment_id": "cjo602q", "post_id": "2dbw15", "comment": "I am scrolling thru the comments and can barely type because I am giggling like an idiot!"}, {"comment_id": "cjo9rcz", "post_id": "2dbw15", "comment": "Try the metal hospital."}, {"comment_id": "cjob88v", "post_id": "2dbw15", "comment": "It's a great hospital but it's hardly worth joining the metal militia for."}, {"comment_id": "cjo0vk6", "post_id": "2dbw15", "comment": "Start learning some Jack Johnson. Great rhythmic guitar player who uses the most basic of chords. "}, {"comment_id": "cjo8gq9", "post_id": "2dbw15", "comment": "Breezy strummin' man, that breezy strummin'"}, {"comment_id": "cjo1kqa", "post_id": "2dbw15", "comment": "Will definitely check him out!  \nThanks."}, {"comment_id": "cm9bzwr", "post_id": "2dbw15", "comment": "First off, take it to a repair man and have it looked over. At the very least it probably needs a set up. Don't overlook this as a poorly set up guitar will discourage you. \n\nMake sure the stings are light enough to fret without too much discomfort, but heavy enough to move the top. I use 12 gauge on my working guitars and 13's on my practice stuff. What I mean by move the top (if you don't know) is the soundboard. The top of your acoustic is a soundboard. The strings vibrate the board and the vibrations are amplified in the chamber by the board. If you strings are too light it'll take more effort to get the top \"moving\" or vibrating in a way that produces a round tone. \n\nNext, learn 5 chords. C A G E D (learn the G with your pinky on the G and ring on the D, it just sounds better). Practice switching between them, making sure not to lift your fingers off the board more than you need to. In other words, don't let your fingers fly up in the air when you switch chords. Its VITAL that you practice this way from  the very start. I can;t tell you how many guys that have been playing for decades come to me because their poor finger posture has put an artificial cap on their playing. Its hard to get right a a beginner, but 10X as hard to unlearn as a veteran player. Take the time and get it right now. \n\nWhen you have the chords down hit me back and we'll continue this conversation. "}, {"comment_id": "cmzu9nv", "post_id": "2dbw15", "comment": "You brought this upon yourself OP xD"}, {"comment_id": "cjo32yx", "post_id": "2dbw15", "comment": "In my first few lessons my teacher did something I thought was very helpful - and to this day I am glad he did it.\n\nI focused on the fingering of the chords (placement of fingers).  Once I got those down, I would pick two chords to focus on for a day or a week or whatever and simply practice changing my finger positions from the two. Eventually I was able to transform my fingers between chords, I then focused on rhythm and changing chords in time with a beat in my head. once i got those two things down I then picked a few simple songs to play and just ran from there. good luck."}, {"comment_id": "cjo5d1t", "post_id": "2dbw15", "comment": "Yes, this is probably what you will end up doing most. Depending upon where your skill lie, chord transitions are probably the hardest thing to learn early on. It's okay to look for shortcuts when doing transitions too (e.g. keeping a finger planted on a shared note, changing which fingers go where on a chord to make it easier to transition to/from). \n\nIt's also a good idea, once you start practicing chord transitions, to find one particular song to focus on learning. Something very simple, using chords you know, and get it down pat. I learned \"Sanctuary\"; it's nothing fancy and only uses D, A, and G. Once you are confident with that and ready to learn a new chord, find another song that has it and other chords you know, and use that to practice."}, {"comment_id": "cjobjkn", "post_id": "2dbw15", "comment": "Thanks!  \nWhat's a good song to begin with?"}, {"comment_id": "cjodidz", "post_id": "2dbw15", "comment": "Too many people assume their guitar is autistic when it probably isn't, don't define it as such without professional advice."}, {"comment_id": "cjosjqy", "post_id": "2dbw15", "comment": "My spruce-top spent too much time on the internet and has now self-diagnosed itself with Aspergers."}, {"comment_id": "cjnzzi2", "post_id": "2dbw15", "comment": "[deleted]"}, {"comment_id": "cjo05lc", "post_id": "2dbw15", "comment": "Thanks!  \nHow much does an average lesson cost?  \nWould I be able to play a full song in a few months or does it take alot of time to just learn the basics?"}, {"comment_id": "cjomsip", "post_id": "2dbw15", "comment": "Be sure the guitar always has a safety helmet on. "}, {"comment_id": "cjo4cxu", "post_id": "2dbw15", "comment": "/r/titlegore"}, {"comment_id": "cjodao5", "post_id": "2dbw15", "comment": "Well, first you gotta make sure you get a guitar with lots of flames. Look at Guy Fieri's wardrobe if you're confused. Then you've gotta carry your axe around with you literally everywhere and show off your single track set list (featuring \"Wonderwall\" by Oasis and literally nothing else, of course) to everybody. \n\nPro Tips:\n\n* Real rock stars don't shower and use deodorant, and neither should you.\n\n* A fedora makes your playing approximately 63% funkier.\n\n* If somebody says, \"Hey, good job.\" (they won't, they'll be too intimidated by your skills), make sure to politely respond, \"Y-you too.\" It makes you seem humble.\n\n* Make sure that your mom doesn't have anything else going on so she can pick you up and make you some PB&J once you're all tuckered out.\n\n\nAnd *that* is how you play the autistic guitar. \n\n___\n\nEdit: Really though, look up some tabs of songs you like and I recommend watching Marty Schwartz on YouTube. That's how I got started. I think the first song I learned was Iron Man."}, {"comment_id": "cjoe34y", "post_id": "2dbw15", "comment": "I haven't had shower since 5th of july, so I think im on the right track."}, {"comment_id": "cjo4cwb", "post_id": "2dbw15", "comment": "G-C-D, you're good for a long time. then learn Am and you've added another 1000 songs....\n\nSerioulsy, the one big mistake I've made is to try to do too much too fast. Learn something **well** and then move to the next skill. "}, {"comment_id": "cjohzuz", "post_id": "2dbw15", "comment": "I started to learn Eruption 2 months after I got my first electric guitar. Don't make the same mistakes I did, I absolutely suck at tapping."}, {"comment_id": "cjos6kv", "post_id": "2dbw15", "comment": "FOUR chords?  Aren't we posh!"}, {"comment_id": "cjollbx", "post_id": "2dbw15", "comment": "I play mostly aspergers guitar. They're basically the same but it's a much more serious instrument."}, {"comment_id": "cjpcyfs", "post_id": "2dbw15", "comment": "[Oh like Craig Nicholls of The Vines](https://www.youtube.com/watch?v=xBKm966ACdQ)."}, {"comment_id": "cjo4k8b", "post_id": "2dbw15", "comment": "I taught myself how to play, which began with chords and simple 3-4 chord songs. It allows you learn to switch between them quickly and play by ear. I them learned the the major and minor chord scale figuring theyd help me travel up the fretboard and discover cool sounds. You might find help doing the same"}, {"comment_id": "cjo4rpc", "post_id": "2dbw15", "comment": "Are there any music shops near you that offer lessons?  Might be a decent way to get you going in the right direction, if you have a little extra money.  There are a lot of resources online, too, if you want to go that route.  Doing it online will be slower and more difficult than with a good teacher, and you'll need to supply your own discipline, but it is free and you can schedule your lessons really easily!"}, {"comment_id": "cjoas5d", "post_id": "2dbw15", "comment": "No extra money :(."}, {"comment_id": "cjo52zr", "post_id": "2dbw15", "comment": "I wanted to learn so bad for so long, and I tried YouTube videos of all kinds. Then a neighbor I had, who was one of those shredder types taught me the intro to Fade To Black. Something about the picking and hand placement really helped me get a feel for actually playing guitar. After that, I squires a copy of Gibson's Learn and Master Guitar series, and I've been at it ever since... Granted, I'm still not good or anything, but it was a good starting place for me."}, {"comment_id": "cjoaog7", "post_id": "2dbw15", "comment": "So your recommendation is to start with books?  \nSadly in my country there is only one or two in the library and those are very uhh...unedicutatual"}, {"comment_id": "cjo5ecc", "post_id": "2dbw15", "comment": "[deleted]"}, {"comment_id": "cjoam1x", "post_id": "2dbw15", "comment": "Thanks, any recommendations for first song to play?"}, {"comment_id": "cjo5ni6", "post_id": "2dbw15", "comment": "First learn Open chords. Just learn a couple at a time and start practicing changing between them. Try to remember to play in time and as slowly as you need to to keep the change in time. A metronome will help with that. From there you could apply these chords to learning some songs you like.\nTry out different strumming patterns and eventually fingerpicking patterns. And stay with an idea until you have it under your fingers. \n Maybe after you get a bit more comfortable doing that you take a look at barre chords. "}, {"comment_id": "cjoakp3", "post_id": "2dbw15", "comment": "Would you recommend starting with a pick or freehand?"}, {"comment_id": "cjo6ejz", "post_id": "2dbw15", "comment": "JustinGuitar.com is great and free. The intermediate lessons even get somewhat difficult. \n\nI'm a sloppy self-taught rhythm guitarist. I just learned the chord shapes and started playing... for 13 years with bad habits. When I decided to \"start over\", I found tons of valuable lessons and exercises in his lesson plan, and hopefully corrected my worst habits! ie I definitely wish JustinGuitar.com had existed in 2000!"}, {"comment_id": "cjoaio7", "post_id": "2dbw15", "comment": "Damn!  \nA whole alot recommendations for this site!  \nI hope it will be good enough for me to not get a music teacher since my English is quite sloppy."}, {"comment_id": "cjo6idw", "post_id": "2dbw15", "comment": "Daniel Johnston is one of my favorite autistic guitar players."}, {"comment_id": "cjo6o5g", "post_id": "2dbw15", "comment": "This thread has been linked to from elsewhere on reddit.\n\n\n - [/r/titlegore] [\\[Guitar\\] Want to learn to play an autistic guitar. Where do I start?](http://np.reddit.com/r/titlegore/comments/2dcjv4/guitar_want_to_learn_to_play_an_autistic_guitar/)\n\n\n - [/r/guitarcirclejerk] [This one doesn&#x27;t even has to be altered... read the title.](http://np.reddit.com/r/guitarcirclejerk/comments/2dcloa/this_one_doesnt_even_has_to_be_altered_read_the/)\n\n - [/r/shitpost] [Guy puts autistic guitar instead of acoustic guitar in his title. Becomes most upvoted post this month.](http://np.reddit.com/r/shitpost/comments/2ddajr/guy_puts_autistic_guitar_instead_of_acoustic/)\n\n - [/r/bestof] [/u/CheezyGentleman wants to learn how to play the autistic guitar.](http://np.reddit.com/r/bestof/comments/2ddkng/ucheezygentleman_wants_to_learn_how_to_play_the/)\n\n - [/r/LIY] [Want to learn to play an autistic guitar. Where do I start? • /r/Guitar](http://np.reddit.com/r/LIY/comments/2ehp6f/want_to_learn_to_play_an_autistic_guitar_where_do/)\n\n*^If ^you ^follow ^any ^of ^the ^above ^links, ^respect ^the ^rules ^of ^reddit ^and ^don't ^vote ^or ^comment. ^Questions? ^Abuse? [^Message ^me ^here.](http://www.reddit.com/message/compose?to=%2Fr%2Fmeta_bot_mailbag)*\n\n"}, {"comment_id": "cjo8hv1", "post_id": "2dbw15", "comment": "Lol, do people really post without reading what they typed?\n \n[justinguitar.com] (http://www.justinguitar.com/) is a great place to start."}, {"comment_id": "cjoaei4", "post_id": "2dbw15", "comment": "Lots of recommendations for this site, will definitely check it out."}, {"comment_id": "cjo9ebx", "post_id": "2dbw15", "comment": "Just hold it close and stare blankly into the eyes of the audience without playing anything"}, {"comment_id": "cjoacog", "post_id": "2dbw15", "comment": "Ah hand the guitar to someone from the audience and expect them to play."}, {"comment_id": "cjoadds", "post_id": "2dbw15", "comment": "Ah hand the guitar to someone from the audience and expect them to play."}, {"comment_id": "cjo9iha", "post_id": "2dbw15", "comment": "This is a good opportunity to learn about posture, form and technique before you get in a lot of bad habits. \n\nFirst, feel the difference it makes between putting your guitar on your left leg and resting it on your right leg. Notice how on your left leg that your left arm has so much more agility and freedom of movement. Maybe that wouldn't matter to you because of your physical characteristics, but for most people, they are going to feel less stress if they place it on their left leg instead of their right while sitting. \n\nNext, notice how much more power you have in your fingers if they are placed perpendicular to the guitar. You don't want to hit the the strings at an angle, it creates wasted energy. \n\nAlso, think long and hard about how you want to hold your pick the rest of your life. Most people will hold the fattest part and apply the pointy part to the strings. Is that the best way for you? Experiment with holding the pick sideways and hitting the strings with the round/fat part and see if it makes playing faster and see how it changes the tone when there is more pick in contact with the strings. The less the pick digs in between the strings, the quicker you can be running fast-picking leads. \n\nAlso, think about picking technique. Some great teachers recommend *always* alternating pick strokes; others say that you alternate except when you change strings in which case you want to pick in the direction of the new string. So, going down from, say, the G string to the B string you would use a downward stroke. \n\nAs far as standing posture goes, notice that the higher you hold the guitar, the easier it is to get around the neck. That's why you see so many hipsters rejecting the rock-n-roll stance of keeping the guitar as low as possible. Yes, it does look more cool, but it limits your speed. Of course, longer arms is going to mean more comfort and ease when you wear it low, but it's still a trade-off between looking cool and utilizing better technique. \n\nedit: grammar/typos"}, {"comment_id": "cjoa9w5", "post_id": "2dbw15", "comment": "Woah!  \nI never knew ANY of these things!   Thank you so much!  \nI will definitely pay attention to how these little things now."}, {"comment_id": "cjpepsh", "post_id": "2dbw15", "comment": "Playing on your left leg.....cool never thought of this or heard of it. Ive been playing for three years. Ima give this a try when i get home.\n"}, {"comment_id": "cjo9nt1", "post_id": "2dbw15", "comment": "Just start definitely definitely."}, {"comment_id": "cjo9t9n", "post_id": "2dbw15", "comment": "hahaha this is great"}, {"comment_id": "cjoc3e8", "post_id": "2dbw15", "comment": "Esteban guitars are considered autistic, right?"}, {"comment_id": "cjodlco", "post_id": "2dbw15", "comment": "1) You have friends who play guitar, no? Have them check out your instrument and see is it needs work. It's usually not much, some filing on the bridge or nut, and perhaps a neck adjustment. However, I've seen many guitars that cannot play well because the bridge is in the wrong location. You can tune it fine, but if the bridge is too close to the nut, notes further up the neck will sound sharp, too far away and they will sound flat. I worked in a music store back in the day, and a guy brought in these beautiful expensive looking instruments, at a very low cost, but we turned him away because the bridges were placed wrong. \n\n2) New strings. Strings that have gunk on them or have blackened will not vibrate evenly, and you will not get good intonation. You'll want a combo peg winder and pin puller to change strings. I got one that also has a string cutter built in. It's worth it.\n\n3) Tuner. The clip on tuners are okay, but you'll become a much better player if you learn to tune trusting your ears for the final adjustments. Even a well formed chord can sound wrong if your tuning is off. You should be able to do E and A forms up the neck (3rd, 5th, 7th, 9th frets, for example) and have it sound good.\n\n4) Now the good news is that there's a ton of free TABs available online, and chord charts, and videos that will help you learn, in just about any style that might appeal.\n\n5) Now the bad news. It's a lot of work, and your fingers will hurt. A lot. You'll learn to like that.\n\n6) Learn songs. THE WHOLE SONG, EVERY TIME. Not just the fun bits. Not just the bits that are easy to play, but sound cool. Learn the whole dang song. This will make jamming with other folks a lot more fun. (Oh -  and sing if you've got it.)\n\n7) If you start to loose interest, shake it up. Get a capo and explore with it on the 3rd Fret. (Lots of Jethro Tull 'round there, but Mother Goose is on the 5th. You'll find John Barleycorn on the 7th, with Hotel California)\n\n8) If that gets old, try alternate tunings. It's a great way to teach you fingers NOT to automatically go for the standard chord forms.\n\nHave fun."}, {"comment_id": "cjodxe7", "post_id": "2dbw15", "comment": "I actually don't know anybody who plays a guitar  haha.  \nThank you for friendly advice, saved and noted :)."}, {"comment_id": "cjodzys", "post_id": "2dbw15", "comment": "Well, I'm way too late for the easy joke, aren't I?"}, {"comment_id": "cjoeg8d", "post_id": "2dbw15", "comment": "Maybe, maybe not."}, {"comment_id": "cjog15c", "post_id": "2dbw15", "comment": "Justinguitar is easilly the best I've found.  It's honor system paid, so you can access the whole course and decide how much it was worth to you.\n\nMarty Schwartz is a good person on youtube that can teach you individual songs.\n\nBetween those two, there is tons of information and enough to get you going for a long while.\n\nI'm going through Justin's course right now, and am at the end of the beginners stuff he has.  It's great."}, {"comment_id": "cjog6o3", "post_id": "2dbw15", "comment": "Awesome.  \nThanks."}, {"comment_id": "cjojcv7", "post_id": "2dbw15", "comment": "It's funny because I read it as \"acoustic\" until I saw the edit. Then I had to look back and read carefully. I knew what you meant!"}, {"comment_id": "cjotnfi", "post_id": "2dbw15", "comment": "Thank you :)."}, {"comment_id": "cjokkrg", "post_id": "2dbw15", "comment": "Buy yourself a Seagull, or an Ibanez. You'll have an instrument you can play for years."}, {"comment_id": "cjoky6k", "post_id": "2dbw15", "comment": "Turn off autocorrect."}, {"comment_id": "cjoo69f", "post_id": "2dbw15", "comment": "Top kek"}, {"comment_id": "cjotglj", "post_id": "2dbw15", "comment": "damn right m8"}, {"comment_id": "cjop8vz", "post_id": "2dbw15", "comment": "According to Jenny McCarthy, you just need to have yours immunized."}, {"comment_id": "cjoqomu", "post_id": "2dbw15", "comment": "First slice the large russet potato longways and deepfry till crispy. Hollow or the middle and use another deep fried potato for the neck. Now coat with epoxy and attach the strings\n\n\n\nIt'll be small and more like a mandolin but it'll be the most autistic guitar the world has ever seen.\n"}]