[{"comment_id": "esi2o84", "post_id": "c7x8mm", "comment": "I don't really like their labelling it 'dissonance' *or* 'consonance'.\n\nLike a major 2nd has a more 'open' airy feel to it than does a minor 3rd; but this chart would imply the opposite.  \nI'd sooner say the majors are *more* consonant"}, {"comment_id": "esi8gp1", "post_id": "c7x8mm", "comment": "There is certainly more nuance to these classifications! For example, a minor sixth is an imperfect consonance, to be very precise. \n\nHowever, this is a chart for beginners to learn the basics (hence the 101 in the title) of musical intervals. You should definitely move on to more advanced concepts after these are well understood. Also, the “feel” of an interval and its classification are not always the same thing.\n\nBoth minor and major seconds are dissonances, even if a major second feels smooth in some circumstances (such as a major chord with an added 9th, which is quite beautiful).\n\nBoth minor and major thirds are consonances, otherwise we wouldn’t be able to write any piece in a minor key. The root chord of a key (in classical harmony) cannot be a dissonant and unstable chord."}, {"comment_id": "esi8dee", "post_id": "c7x8mm", "comment": "Without a doubt. The only truly dissonant intervals are tritones and pitches separated by half steps."}, {"comment_id": "esl76yv", "post_id": "c7x8mm", "comment": "also it seems helpful for people that have keyboard or piano, not 'musicians'"}, {"comment_id": "esknsd4", "post_id": "c7x8mm", "comment": "The fourth is also a dissonance, depending on context."}, {"comment_id": "eskpa9h", "post_id": "c7x8mm", "comment": "True, the perfect fourth is an interesting case. Depending on the context and style it can be a consonance or a dissonance. A sixth is another strange one. \n\nBut by itself, as a pure interval, a perfect fourth it is stable and interpreted first as a consonance helps beginners understand the relationship of inverted intervals: thirds - sixths and fourths - fifths.\n\nIt also appears pretty soon in the harmonic series (right after the perfect fifth), which is another reason for it to be considered a stable interval by itself."}, {"comment_id": "eslgw3i", "post_id": "c7x8mm", "comment": "Thank you!!"}, {"comment_id": "eslh10t", "post_id": "c7x8mm", "comment": "You’re welcome, hope it will be helpful!"}, {"comment_id": "dllu5ae", "post_id": "6tltp7", "comment": "Looks very useful, subscribed!"}, {"comment_id": "dlm4nmr", "post_id": "6tltp7", "comment": "Rick's a great guy, his knowledge of music is vast and I feel like we're lucky he even gives the time of day to bestow is knowledge. The topics he talks about vary greatly but forewarning you need to have at least a basic understanding a theory to really follow along"}, {"comment_id": "dlmxcqw", "post_id": "6tltp7", "comment": "Rick is great. His recent Apple rant was a lot of fun."}, {"comment_id": "dlntrtz", "post_id": "6tltp7", "comment": "lol I was watching it and I could tell right away he was pissed, thought to myself \"this is going to be great.\" Did not disappoint "}, {"comment_id": "dln3fr1", "post_id": "6tltp7", "comment": "Wow, this looks awesome.  Thanks for sharing!"}, {"comment_id": "c2seu3a", "post_id": "lfux0", "comment": "I really want to add to that chart after \"Don't Stop\", then \"Believing\", then a line back to \"Don't Stop.\""}, {"comment_id": "c2sd2zv", "post_id": "lfux0", "comment": "This actually inspired me to start practicing again. \nThanks!!"}, {"comment_id": "c2scbj3", "post_id": "lfux0", "comment": "I like it because its true. :)"}, {"comment_id": "c2sdj6h", "post_id": "lfux0", "comment": "I wish... I have midterms in Political Ecology tomorrow. "}, {"comment_id": "c2seud8", "post_id": "lfux0", "comment": "Pick up your instrument right after your midterm and before reddit :P, or maybe after sleep and before reddit."}, {"comment_id": "c2sj581", "post_id": "lfux0", "comment": "This is Awesome because over the weekend i was playing out and some random person came up to me while I was taking a break and asked if he could play.  And went up there and knocked out some of the hardest stuff that I know. And it just made me want to practice more and be a better musician.\nLater I found out that he was actually a professional musician and had opened up for big name country stars and was just visiting the area."}, {"comment_id": "c0joyal", "post_id": "aw2o6", "comment": "[removed]"}, {"comment_id": "c0jpdsn", "post_id": "aw2o6", "comment": "roll your own."}, {"comment_id": "c0k3a29", "post_id": "aw2o6", "comment": "**THANK YOU!!!!**"}, {"comment_id": "c0jopak", "post_id": "aw2o6", "comment": "Awesome!"}, {"comment_id": "c0joxaj", "post_id": "aw2o6", "comment": "Thank you so much for this. This is so so great. I have singing experience but really want to take it to the next level, especially with my upper range. I'm a bass/baritone so this is just perfect.\n\nRock on."}, {"comment_id": "c0jp7hh", "post_id": "aw2o6", "comment": "You're amazing. Thanks for taking the time to put this together for us."}, {"comment_id": "c0jonu1", "post_id": "aw2o6", "comment": "\\m/ \\m/"}, {"comment_id": "c0jsta2", "post_id": "aw2o6", "comment": "Thank you so much! Demystifying the art of singing!!!!"}, {"comment_id": "c0kh3wg", "post_id": "aw2o6", "comment": "how much whiskey n smokes do i have to use to sound like tom waits"}, {"comment_id": "c0r5dhh", "post_id": "aw2o6", "comment": "the only way to sound like tom waits is to be tom waits\n\nor man man"}, {"comment_id": "c409nyd", "post_id": "qt9wm", "comment": "Thanks to [this post](http://www.reddit.com/r/musictheory/comments/qrix5/in_all_my_years_of_trying_to_learn_music_theory/) for discovering this woman's material.  I just went through afterwards to separate all of her teaching videos and arrange them somewhat in order as one playlist."}, {"comment_id": "c40br36", "post_id": "qt9wm", "comment": "Thanks for doing the bit I didn't want to! haha"}, {"comment_id": "c40bq0l", "post_id": "qt9wm", "comment": "Thanks, this is really great."}, {"comment_id": "c41yzdd", "post_id": "qt9wm", "comment": "wow greath thx mate!"}, {"comment_id": "c45174r", "post_id": "qt9wm", "comment": "thanks so much"}, {"comment_id": "c40aeo4", "post_id": "qt9wm", "comment": "You rock! I really enjoyed the videos, but couldn't bear to slog through all the miscellaneous videos to find the relevant ones. Thanks, this is greatly appreciated. "}, {"comment_id": "c40c5ny", "post_id": "qt9wm", "comment": "You're missing out.  Some of those jokes were actually pretty good! (Ok, not really.)"}, {"comment_id": "c0jnsaa", "post_id": "avvp5", "comment": "I'm not a singer by any means but have a few questions for when I'm singing in my car:\n\nHow can I learn to sing in key consistently?\n\nWhere can I learn to expand my vocal range? Particularly when it comes to yeling/scream notes like you find in grunge bands from the 90's.\n\nWhat vocal techniques and exercises do you find to be the most useful? Links, books, or resources to learn said techniques?"}, {"comment_id": "c0jnua5", "post_id": "avvp5", "comment": "I am a musician, but not a singer.  I can hit pitches well, I know a few breathing exercises, and I can hear lots of harmony, but I hate the sound of my voice.  From what I've heard, you're pretty much stuck with your voice as far as tone goes, but are there any exercises to change it a bit?  Is this something that singers focus on the way a saxophonist might?"}, {"comment_id": "c0jnvg3", "post_id": "avvp5", "comment": "Sing in cartoon voices and affectations. This gets you used to the many different colors of your voice and the different placements you do to create them.\n\nIf you're looking to have a more performance-esque voice, working with a voice teacher is the way to go. They can show you trick and tips that are specific to your voice to make the maybe-less-appealing-voice into something more palatable."}, {"comment_id": "c0jnttu", "post_id": "avvp5", "comment": "How much do voice coaches charge to train someone?  On average.  What credentials should I look for?"}, {"comment_id": "c0jnud6", "post_id": "avvp5", "comment": "Depends on where you live and how much professional experience they have. Honestly. Take a lesson, and if you get along and you feel comfortable working with them, its a question of how much that person is worth to you. Voice is a very personal thing. You have the one you're born with, whether you like it or not. You need to trust the person you're working with. I know voice teachers, masterclass teachers, clinicians and coaches who have incredible credentials, but honestly should never be unleashed on vocal students.\n\nCredentials don't mean much. Their ability to connect with people means much more, and you can't get a sense of that from a resume."}, {"comment_id": "c0jnt60", "post_id": "avvp5", "comment": "There are a few people who have asked about scream singing, so I'll just talk about it in a reply that is not to a single comment.\n\nMy training is in classical technique, so I'm not as well versed in such severe vocal affectations.\n\nThat being said, I believe the trick to getting good clarity and focus in screaming has to do with placement. Since vocal muscles are all intrinsic, visualization plays a large part in vocal technique. Imagine that the sound is coming out of a very forward placement, like the space between your teeth and lips."}, {"comment_id": "c0jo90a", "post_id": "avvp5", "comment": "There is a DVD, called [Zen and the Art of Screaming](http://www.amazon.com/Zen-Screaming-Vocal-Instruction-Breed/dp/B000AVZVTY), which is pretty good.  I bought it as kind of a primer for non-traditonal types of singing, but the voice lessons in it are fairly \"classic\" as far as I could tell."}, {"comment_id": "c0jorsp", "post_id": "avvp5", "comment": ">Imagine that the sound is coming out of a very forward placement, like the space between your teeth and lips.  \n\nI read something similar to this in the comments on Tay Zondays \"Chocolate Rain\" video. Someone was telling this to him. It is by far the advice that has had the most profound effect on the quality of my vocals when I do it. It has tightened up my pitch enormously. I don't know what physical effect it has had (maybe you could explain that) but it has really brought confidence to my performances. \n"}, {"comment_id": "c0jpbus", "post_id": "avvp5", "comment": "2 questions...\r\nHow come somedays I can sing right along with a song and hit the notes. Some times I can't get it even close?\r\n\r\nFor instance, \"Fall to pieces\" Velvet Revolver.\r\nSometimes I hit the beginning and soemtimes just all over the place.\r\n\r\nAlso, how do I find my voice? \r\nWhen I sing along to a song, I seem adopt the singers style? Like the velvet revolver song... all throaty and if I sing to jackson Browne, all clean?\r\n\r\nWhenever I try to just sing, I feel I fall into a singers style, even if i try to go clean and let it go, it just comes off like a famous singer singing it. Like a crutch. Make sense?"}, {"comment_id": "c0js0r3", "post_id": "avvp5", "comment": "First Question: A few people have asked me this. It's really a question on ear training. Fortunately, I was blessed with a really good musical ear. This makes me an awful teacher for those who aren't because I have a lack of firsthand experience with it. Without hearing you, I would point to breath support as being the most likely culprit.\n\nSecond question: I have known some pretty good singers in my time who were imitative. You may just sound like a famous singer :) Seriously though, try singing folk songs, and other tunes that aren't associated with one particular artist. It may help to get the sound of someone else out of your head."}, {"comment_id": "c0jnryw", "post_id": "avvp5", "comment": "How do I became pop star? LOL\n\nOk, j/k\n\nFor real, is there anyway to improve my vocal range?  Is there any way to improve my \"shout-singing\" so that I can sing-scream better?"}, {"comment_id": "c0jntg6", "post_id": "avvp5", "comment": "Seconding the question about vocal range."}, {"comment_id": "c0jnuoa", "post_id": "avvp5", "comment": "I need this too! I'm not looking for a classical training, but I would like tips on how to shout-sing without doing long-term damage to my throat. "}, {"comment_id": "c0jnryt", "post_id": "avvp5", "comment": "I do death metal growls. What part of my vocal apparatus am I using? I can't find any reliable information on this online because there's so many different inconsistent explanations that I can't get a clear answer.\n\nSo...are false vocal chords even a thing and is that what does it?"}, {"comment_id": "c0jnu69", "post_id": "avvp5", "comment": "Phonation - the creation of sound in the larynx - only occurs one way. Your vocal folds (often mislabeled vocal chords) are made up of several different muscles that stretch, thicken, and contract to control pitch and timbre. As I understand metal growling, you are merely changing the way air passes through the vocal folds to create sound.\n\nIf you look at this [video](http://www.youtube.com/watch?v=9kHdhbEnhoA) you can see how sound is produced. Its hard to tell, but the part that is actually touching together are your vocal folds. the thick part between the folds and the edge of the larynx are your false folds. It seems that in scream singing, the false folds are more engaged in phonation.\n"}, {"comment_id": "c0jnsb5", "post_id": "avvp5", "comment": "What are the absolute basic things a person can practice daily to improve his/her voice?"}, {"comment_id": "c0jnsvn", "post_id": "avvp5", "comment": "breathing. learning to take good low breaths is essential to singing properly. Stand against a wall and breathe in. You should feel and see expansion first as your stomach expands. Put one hand flat behind your back. You should feel expansion on the back, and on the sides. Your ribcage will go out and raise a bit, however, your shoulder should stay level. If you shoulders go up, your ribcage isn't creating as much space as it can to let your lungs expand."}, {"comment_id": "c0jnsnz", "post_id": "avvp5", "comment": "I sing in a band, and lately I've been having a lot of trouble coming up with melodies. I think my problem is that I haven't properly familiarized myself with timing and staying in key. Are there any vocal exercises that will help me with this?"}, {"comment_id": "c0jnuxe", "post_id": "avvp5", "comment": "It's hard to say without hearing you. Intonation (staying in key) can be due to lack of good breath support, or tension somewhere in the singing mechanism. Singing should be just as easy as speaking. Nothing should be strained or stretched (that is except for your vocal folds)."}, {"comment_id": "c0jntxt", "post_id": "avvp5", "comment": "I work parttime for my college as a piano accompanist for one of our voice teachers, and one day he mentioned something that I found really interesting. He said that voice was different than playing an instrument in that the age you start at doesn't have a strong impact on how good you can become. That is, someone who's studied voice from 10 years old to 20 years will be roughly as good as someone who studied from 20 to 30, whereas someone who studied piano (for example) from 10 to 20 will be significantly better than someone who studied from 20 to 30. In your experience, is that true? Do people progress at approximately the same rate regardless of their age?"}, {"comment_id": "c0jnulx", "post_id": "avvp5", "comment": "Yes and No. Just like learning an etude, you're still training muscle memory. The more you practice, the more quickly you develop that muscle memory. Development of the voice depend on many things. The male voice takes something like 15 years to fully mature. You can develop good technique at any age, but your body will mature at whatever rate it damn well pleases."}, {"comment_id": "c0jo4at", "post_id": "avvp5", "comment": "I have a slight nasally voice because I have a long nose ( assume) , but I have a pretty great ear, so I know when I'm singing well or not and in tune etc, but Is there anyway short of surgery or something, to have my singing voice lose some of it's \"nasal-ness\" ? "}, {"comment_id": "c0jo5o6", "post_id": "avvp5", "comment": "Do you have a nasally voice naturally or just when you sing? You may have a deviated septum if it's a natural part of your voice."}, {"comment_id": "c0jo8xj", "post_id": "avvp5", "comment": "I don't wish to sing for a living. I am just a regular guy. I like to sing in the showers and along songs I listen to. The problem is: I suck at it. What can I do best to improve my pitch and range?\n\nI've noticed a few times, that when I think I am singing at a pitch (the way I hear myself), it's not the same pitch that's heard outside. I've also in fact noticed that when I listen to recordings of my own voice, I sound nothing like what I hear myself while talking.\n\nIs this common? And if it is how do I battle it?\n\nI am a musician and am really well ear-trained, so I have no problems distinguishing between notes and pitches.\n\nSo, what should I do to extend the range of pitches I can sing/make sounds in? And how do I precisely know what pitch I am at?"}, {"comment_id": "c0jokyc", "post_id": "avvp5", "comment": "Well, there are a couple of reasons your intonation (staying in key, matching correct pitch) might be bad. I hate to start on such a contradictory note, but if you were really well ear-trained, you should not have a problem telling when you're not matching pitch. If this really is the case, you may be suffering from an auditory processing issue, and should consult an ENT. Only a doctor can properly diagnose any issues in auditory processing.\n\nI will shorly be posting a list of exercises dealing with range extension and tone development.\n\nThe only way to know precisely what pitch you are singing is to sing along with an instrument like piano or guitar, or sit there with a tuner in front of you. I would discourage the latter, it will drive you nuts since no one every sings perfectly from note to note. Also, things like harmonic overtones can sometimes throw tuners for a loop."}, {"comment_id": "c0jnxeo", "post_id": "avvp5", "comment": "I used to be a really, really bad singer. The concept of singing in key was entirely unknown to me. Music just never came naturally to me. I've practiced a lot since then but I still feel it's hard to hit all the notes consistently. I can definitely hear when I'm off now, which is a huge improvement. What can I do to become better at this?  \n\nSecretly, being able to sing well is my biggest dream. I don't seek to become a star - not at all! I just want to be able to sing and record the songs that I love. I feel most of the songs are just way too high :( I don't understand how the singers manage to sing them while maintaining a \"full\" voice - mine just disappears into a whimper."}, {"comment_id": "c0jnxt1", "post_id": "avvp5", "comment": "It's hard to say without a few examples of the songs you're talking about, but I know what you mean. I'm a baritone, and most of the songs I love to sing are sung by tenors. They just are out of your tessitura (comfortable singing range). Your voice is just drifting into falsetto, which is the only way your voice can hit those notes.\n\nAs far as getting better at intonation (hearing when you're off), there are several computer programs that do ear training. Auralia is what I was trained on."}, {"comment_id": "c0jnuda", "post_id": "avvp5", "comment": "What are the absolute no-no's for singers as far as food and drink?"}, {"comment_id": "c0jnv8j", "post_id": "avvp5", "comment": "Pre-gig: Anything dairy based or that create layers of mucus in your throat. This can be helped with consumption of citric acid. I always do a shot of lemon juice before I sing.\n\nIn general: Foods that cause acid reflux. Stomach acid hitting the back of your vocal folds is very bad."}, {"comment_id": "c0jnusq", "post_id": "avvp5", "comment": "Vibrato: How the fuck do you do that?! I can kinda make it so my voice wavers, but it's always very fast. How can I learn to control the speed/intensity of my vibrato?"}, {"comment_id": "c0jnv66", "post_id": "avvp5", "comment": "Controlling your vibrato is a very bad bad thing. Vibrato is a completely natural muscular response to strain.\n\nExample. You're lying on your side, supporting yourself with one arm. If you stay like that for long enough, your arm will start shaking. What is happening is your muscle is rapidly contracting and relaxing so that it won't tire out too quickly. When you sing, the same thing is happening.\n\nThe first step is to make sure you're not trying to control anything. Let your vibrato come naturally. You can control it by stopping it and singing straight tone (i.e. Renaissance Polyphony and chant) but you can not control anything to create it.\n"}, {"comment_id": "c0jnvjq", "post_id": "avvp5", "comment": "how do i know if i'm staying on key?"}, {"comment_id": "c0jnvw2", "post_id": "avvp5", "comment": "Well, sing along with a recording first, and if you're not in unison with the lead vocalist, you're probably not in the right key.\n\nIt's really hard to explain. This question relates more to ear training than it does to vocal technique or health."}, {"comment_id": "c0jnwi2", "post_id": "avvp5", "comment": "I used to sing in musicals and I would consider myself to be decent, as in I would occasionally get a really small solo but otherwise I was chorus. The problem I had was that it would take me a hell of a long time to get warmed up to where I could really feel myself singing (as opposed to singing and needing to pay attention to my voice).\n\nWhat can I do to improve my warm up time? Is this just something that improves with practice?"}, {"comment_id": "c0jnwom", "post_id": "avvp5", "comment": "I'm not really sure I understand the question. What do you mean that you could \"really feel yourself singing\"?"}, {"comment_id": "c0jnzcw", "post_id": "avvp5", "comment": "Question about singing and smoking\n\nI used to smoke cigarettes on a pretty regular basis and as a result of this, I have lost some ability to sing the way I used to.  I have recently quit smoking and now I would like to know ways to make my vocal chords healthy again.\n\nalso, I realize very well may be a stupid question"}, {"comment_id": "c0jnzsx", "post_id": "avvp5", "comment": "Just sing. like any muscle, if you don't use it, it atrophies. Any damage done by smoking will either heal itself, or remain permanent."}, {"comment_id": "c0jo1ea", "post_id": "avvp5", "comment": "I have a hard time singing when people around me are singing other parts.  For example, in choir when I was with the other basses I was find, but as soon as I was placed next to a tenor or alto it all went to hell.  I've learned music primarily by ear and have always gone by ear when it comes to singing.  Now I've had a decent amount of theory, band, choir, and have been playing music for about ten years now.  Any suggestions on how to deal with the automatic need to match the pitches around me?  "}, {"comment_id": "c0jo1zw", "post_id": "avvp5", "comment": "Harmonize with recordings. Get some friends together and sing rounds. Record yourself and sing a round with yourself. It's all about just being independent on your part."}, {"comment_id": "c0jo3cf", "post_id": "avvp5", "comment": "[deleted]"}, {"comment_id": "c0jo5xj", "post_id": "avvp5", "comment": "do some research on musicians plugs. A lot of band guys I know use them in loud trumpet sections, or for loud gigs. You need to get them custom fitted, but everyone says they're amazing.\n\nAs for the voice, just try and give yourself some time to rest before and after shows.\n\nDrinking water during a show is a creature comfort. It just makes you feel better. In reality, any hydration that you want to feel in your throat needs to be consumed about an hour before hand. Water never touches your vocal folds unless you inhale steam. The only way to make sure your folds are properly lubed up for a show is to drink before hand. I used to drink at least two full bottles before I went on stage, especially if the hall is really dry. But if you're screaming/singing for a whole set, you definitely want to lube up before the show :)"}, {"comment_id": "c0jo50q", "post_id": "avvp5", "comment": "Is falsetto considered \"cheating\" when singing your own or others' material? You don't hear a lot of it; is that because it isn't considered skillful singing, or because it is actually a skill that some do not have? My falsetto sounds better than my normal range, which is alright on its own. Should I keep working on my lower register to be taken seriously, or would it be in my best interests to keep it up with the falsetto?"}, {"comment_id": "c0jo66d", "post_id": "avvp5", "comment": "Its generally not considered a desirable vocal color, but that doesn't mean it's not completely valid. There is a gorgeous song in Carmina Burana called Dies Lux et Omnia which is sung by the baritone soloist mostly in falsetto. There is no reason not to work on both ends of the range. As you develop into your falsetto, there exists something called mixed falsetto, or cover voice. It allows you to bring some of the power of your mid-register into the top. It also depends on what you want to do with your voice."}, {"comment_id": "c0jog6o", "post_id": "avvp5", "comment": "Whats your advice for staying in key?  Im a singer with a terrible problem of falling in and out of key "}, {"comment_id": "c0joixo", "post_id": "avvp5", "comment": "Sing Jazz!"}, {"comment_id": "c0jol88", "post_id": "avvp5", "comment": "As I've said to some others with the same issues, it's difficult to know what your specific problem is without hearing you. Teaching voice is alot about listening to the student and trying to diagnose issues by tone quality.\n\nThat being said, 80% of the time with people I work with, it's usually poor breath support. See the answers that I've given on breathing practice and look for a future post with more detailed explanations on how to improve breath support."}, {"comment_id": "c0jojek", "post_id": "avvp5", "comment": "Some advices for actors who don't know a lot about their voices, please? "}, {"comment_id": "c0jol6o", "post_id": "avvp5", "comment": "What would you like advice regarding?"}, {"comment_id": "c0jols9", "post_id": "avvp5", "comment": "First of all, thank you so much for this thread.  Seriously, again just like most people here, I am an average dude with silly little daydreams of doing duets with my favorite singers.  \n\nSince most of my other concerns have been answered here, I should ask, when going low to high, and high to low,  is it ok to go in to falsetto range, and how do I defeat that little...\"bump\" that makes it obvious that I;m going from my diaphragm to my throat?"}, {"comment_id": "c0jomix", "post_id": "avvp5", "comment": "Hate to sound repetitive, but yawn sirens ftw again. They do a really good job of helping to connect the bottom range to the top. But I caution bout about going \"from the diaphragm to the throat\". Singing should never happen in your throat. You should always be supporting your tone from your diaphragm. If you need to think of a higher space, think of your lower register happening from your diaphragm, and your falsetto coming out of this hole at the top of your head. Focusing too much on your throat can cause lots of problems with tension in the vocal mechanism."}, {"comment_id": "c0mg68y", "post_id": "avvp5", "comment": "[deleted]"}, {"comment_id": "c0mgedx", "post_id": "avvp5", "comment": "Imitate it."}, {"comment_id": "c0ovrpy", "post_id": "avvp5", "comment": "It's been a while since this was posted, but maybe you'll reply.  \n\nI have noticed that when I'm singing something (usually in chapel) I just try to copy what I hear other people singing (makes sense), but I end up sometimes singing in a really low voice and sometimes singing in a much higher voice, without any real consistency of which I would be using when. I can't switch between them in the middle of singing, only in big gaps like between songs or verses.  Can you offer your help here?"}, {"comment_id": "c0ovv9z", "post_id": "avvp5", "comment": "Are you singing the melody in unison with the people around you? or are you in a different octave?"}, {"comment_id": "c4lyhqh", "post_id": "tdw3l", "comment": "This is really neat!\n\n::bookmarks::"}, {"comment_id": "c4lxz7c", "post_id": "tdw3l", "comment": "way useful.  passing it on to my other guitar friends"}, {"comment_id": "c4lt65d", "post_id": "tdw3l", "comment": "Give this a repost over to /r/guitar and /r/musictheory great concept!"}, {"comment_id": "c4ltege", "post_id": "tdw3l", "comment": "r/musictheory downvoted it so I thought I'd see if you guys liked it. Thanks!!"}, {"comment_id": "c4lww1o", "post_id": "tdw3l", "comment": "The UI feels kind of weird on my laptop, with the input box all the way in the far left corner. Maybe center all the text in the middle and put the input box on top :p"}, {"comment_id": "c4lzbc6", "post_id": "tdw3l", "comment": "When I was making it, the formatting for the input boxes looked strange with the background picture and header when I tested in internet explorer (surprise surprise) so I decided to keep the index page left"}, {"comment_id": "c4mhlbx", "post_id": "tdw3l", "comment": "I'm glad you guys like it!"}, {"comment_id": "dz1j9wy", "post_id": "8joknp", "comment": "Nice!  I made one too, but mine's playable, not just an image:\n\nhttp://www.offtonic.com/theory/applets/circleoffifths.html\n\nThere's more playable stuff at [http://www.offtonic.com/theory](www.offtonic.com/theory) if you want to check it out."}, {"comment_id": "dz1katq", "post_id": "8joknp", "comment": "Dope"}, {"comment_id": "c2l4e2h", "post_id": "kkx4s", "comment": "Good share. Thank you. : )"}, {"comment_id": "c2l5hb2", "post_id": "kkx4s", "comment": "You're welcome. I thought it was really easy to understand, and the information built upon itself. I feel like that's something that's missing from a lot of music theory videos."}, {"comment_id": "c2l7iu0", "post_id": "kkx4s", "comment": "This is great! You have a good teaching style. I'm looking forward to more. Thanks for posting."}, {"comment_id": "c2l8q88", "post_id": "kkx4s", "comment": "This is my cousin."}, {"comment_id": "c2l2vgi", "post_id": "kkx4s", "comment": "There's also a [part two](https://www.youtube.com/watch?v=3tbK2jtVRM8&feature=related) introducing seventh chords."}, {"comment_id": "c2l82om", "post_id": "kkx4s", "comment": "This is really good! Is this you?"}, {"comment_id": "c2qb7qp", "post_id": "kkx4s", "comment": "DUDE thank you so much. This is exactly what I needed. (I taught myself piano/keyboard.)\n\nI dont know jack. Like reading... or anything. Took lessons for like a week. Like 17 years ago.  So this stuff really helped out with basics. (i usually just sound things out)"}, {"comment_id": "c2s3b23", "post_id": "kkx4s", "comment": "this is great, but he kinda sounds like he's out of breath."}, {"comment_id": "dl0twbf", "post_id": "6qvikt", "comment": "Neat!"}, {"comment_id": "dl2396u", "post_id": "6qvikt", "comment": "dis is my fast reference tool on anything!"}]