[{"comment_id": "e56otj3", "post_id": "9bvo3b", "comment": "[most definitely](https://www.moma.org/collection/works/127627)"}, {"comment_id": "e56kxpl", "post_id": "9bvo3b", "comment": "To be fair the answer is almost always yes."}, {"comment_id": "e570aa1", "post_id": "9bvo3b", "comment": "[deleted]"}, {"comment_id": "e5730xl", "post_id": "9bvo3b", "comment": "Well, professor, that depends on how you’re using the term “music.”"}, {"comment_id": "e2dkdel", "post_id": "8yqdbw", "comment": "I like to think Gandalf was a Hurdy-Gurdy master."}, {"comment_id": "e2d1v2g", "post_id": "8yqdbw", "comment": "Interesting.\n\nHave you ever seen Forbidden Planet? You can actually just google it and \"Krell Music\" and get a good idea of what a husband and wife team of composers thought music of an alien culture would sound like.\n\nI think most of your \"fantasy\" genre stuff tends to be connected pretty well with our history, and as such a lot of times the music will just sound like \"Early Music\" - Renaissance music, Troubadours and things like that.\n\nI think music-makers are within their rights to assume that any culture that evolves similarly to us (since usually in movies the characters have to be played by actors, at least pre-CGI days) will also evolve instruments similar to us.\n\nThough it may certainly be a little \"western centric\" to assume that they'd develop music less like Africa or Asia, and more like Europe. But since they usually model clothing and everything else again it seems like the logical course.\n\nIt also makes it easier to compose because you don't have to be historically accurate ;-)\n\nI've always found the few examples in the Star Trek universe interesting - Spock's lyre-like instrument - in some of the newer things Klingons sing/chant, and there are references to the music of other species - Klingon Opera I think is mentioned. In Voyager, the Doctor becomes a virtuoso singer for a culture. In a DS9 episode they had a player who played an instrument kind of like what we'd consider Clarinet-like.\n\nBut, Strings, Drums, Pipes, and Metal/Wood - what do we have, Chordophones, Membranophones, Ideophones, Aerophones...am I forgetting one...? Anyway, those sort of basic \"sound making\" physical objects would be likely in any culture.\n\nBut it would be intereting to see how far away you could get from tradition. Wouldn't it be cool for a culture to have a plant with a seed pod that when blown into, produces a note and rattles the seeds at the same time!\n\nOf course I suppose it also depends on how advanced your culture is.\n\nIt would be even more fun to do like alien cultures where they have 3 legs so their \"marches\" are in 3/4 and their dances are in 3! or something."}, {"comment_id": "e2dnep2", "post_id": "8yqdbw", "comment": "The local arts group broadcast an abridged reading of A Wizard of Earthsea and asked me to create some background music for it.\n\nTo a certain extent, I had to do what I was told, but they didn't give me a lot of instructions: they wanted something similar to the Enya songs in LOTR and that there's an overarching concept of light/dark balance, so the music had to portray that somehow.\n\nThe attemps to clone Enya were deleted.\n\nFor the \"balance\" concept, I made rhythms in 7/4. A common thing I noticed in progressive rock music in 7/4 is that if you divide the measure in half, you get two 3.5 beat measures so you have something that sounds syncopated but is balanced at the same time. Then I can represent imbalance by doing something else.\n\nAbridged results:\n\nhttps://soundcloud.com/chunter/a-visit-to-earthsea-medley\n\nThe Legend of Zelda always has a flute/recorder/ocarina as a usable item, so I'd expect they play a lot of wind instruments, if we don't presume their music sounds like the BGM."}, {"comment_id": "e2hq5lu", "post_id": "8yqdbw", "comment": "Think about the spaces and situations where they'd be playing and listening. Do they dance outside around the fire, where loud, booming percussion would carry across the landscape but subtleties would be lost? Do they gather in intimate rooms, where soft string plucks and bends could punctuate conversations? Do they gather in grand halls, where sounds need to ring and reverberate? Where did they first start to listen to it? Did they used to have booming drums but then began listening in halls, keeping the drums because of tradition but dampening their volume to suit the change in venue? Is music a communal activity in their culture? Or is it only played by professionals?\n\nedit: I think what I'm trying to get at is that music is an element of culture, so you should consider the cultural context of the music and its development."}, {"comment_id": "e2dg692", "post_id": "8yqdbw", "comment": "I think that in order to create an accurate music culture of a fictional world, you have to go to the beginnings of your species, long before civilization, especially if it's a space-faring race. Are your characters herbivorous, carnivorous, scavengers, primary producers, other? What are their social interactions like? Gregarious or solitary? What's their society's hierarchy like? Are they a sexed species? How many sexes? What is their equivalent of courtship? And, importantly, what is their anatomy? How do they breathe? If they do breathe! What kind of limbs they have? That would be important to know their possibilities and limitations when it comes to musical instruments. And, again, what is their environment like? Also consider the diversity of environments on Earth, and that planets that do have life on them will likely show the same kind of diversity of habitat. So you can already forget one-habitat planets: desert planet, forest planet, ocean planet, etc. They \\*can\\*, probably, exist, but they are the least likely scenario. But I digress. So, you'll probably not have \\*\\*one\\*\\* music for one species, just as you don't have one \"human music\" genre or sound, but countless and always-evolving musical genres from many different cultures and subcultures. Obviously, I think if we were to present our species' music to an interstellar gathering, it would probably be classical music, so you could say that's the staple of our music, and other species should also have their \"crowning achievement\", one type of music that they are particularly proud of as a civilization, but keep in mind that it can be the tree that hides the forest."}, {"comment_id": "e2di0wk", "post_id": "8yqdbw", "comment": "Most fantasy worlds like Westeros and Middle Earth tend to imply music that is similar to music from the Middle Ages of this world."}, {"comment_id": "e2dt2bl", "post_id": "8yqdbw", "comment": "For Hyrule I’ve watched videos by GameMusicTheory on YouTube. His videos on Zelda are really cool you should check it out! He even has a four part series on Breath of the Wild"}, {"comment_id": "e2g2x0b", "post_id": "8yqdbw", "comment": "Have you thought about concept albums with narratives in fictional worlds? I know that isn't exactly what you're talking about but albums like Janelle Monáe's, for example, has a very present narrative with somewhat fleshed out \"descriptions\" (sonic, lyrical, or visual) of the music culture(s) of her story world."}, {"comment_id": "ebvjbae", "post_id": "a6k2w6", "comment": "So this is the graphical visualisation of a theoretical framework i have had over these last years of how sociology of music broadly works in the modern world. \n\nA particular musical style normally rises, achieves a certain degree of social hegemony and then fades into history. There are two sets of opposite tendencies that act on that particular musical style, and when that style is in the middle, it arrives at the top.\n\nThe first set is one of chaos versus order applied to sociology, so marginalised groups and central institutions. The second set is one of complexity versus simplicity, again applied to sociology, which means music specialists versus the masses.\n\nEach type of the eight types of music shown in the graph has its explanation and a few examples.\n\n[The full post detailing each explanation can be found here] (https://yohaciendomeelculto.wordpress.com/2016/12/02/social-hegemony-of-musical-styles/)\n\nThis is the explanation for Industrial Music:\nIndustrial music, on the other hand, is comprised of a set of musical styles that don’t have a social base naturally attached to it. It can acquire it with time, though. It’s comprised by forms of music that are created mainly for the purpose of making money, or providing a service. Musical scores for movies or video games are the main examples. Music for television shows, announcements, or trailers. Sometimes, if the institutions and atmospheres that comprise this way of music making are sane and powerful enough, they can attract individuals from the creator minority that produce music of great quality able to connect to a wide audience. Examples of this kind of phenomenon are great and famous film composers like Hans Zimmer or John Williams, whose compositions are able to transcend their primary capitalist functions and become cultural icons, like the Star Wars themes, between many other movies. Another example is the style of what was known firstly as ‘industrial’ music per se, and now called popularly ‘epic’ music, which is a style that existed in the shadows for a long time, comprised of production tracks and sounds sold to movie trailers and TV series. They took classical music harmony and orchestral wisdom and applied it very successfully with modern techniques, creating a very advanced and genius style of music, which caught on with lots of music-loving people outside the entertainment industry. The main example of this style is the group Two Steps From Hell."}, {"comment_id": "ebw3o45", "post_id": "a6k2w6", "comment": "Cool. I would love to know what 'industrial' musics have in common throughout history, I mean what qualities in common musics from the popular to historical spectrum have in common. And exactly what those styles are (as far as known)."}, {"comment_id": "ebxn76m", "post_id": "a6k2w6", "comment": "Does your theory treat the notion of “popular music” in some way that would be applicable across the same breadth of history that your description implies? Doesn’t popular culture (cf Adorno/Horkheimer, Dahlhaus) more or less require a literate middle class? And does your theory more generally acknowledge that these categories are not really “of a kind”? In any society where there’s a literate middle class, there will be plenty of opportunities to commercialize/industrialize folk music or historical music. Not that your graph requires any category to be mutually exclusive, of course, but it’s hard for me to imagine how this becomes a theory of everything, that is, a theory of how these forces interact with one another generally, if it has to work in Paris in 1810, but also for rural post-Soviet musics in the age of the internet. I’m guess I’m not sure how much mileage this particular geometry will get you across that range of circumstances?"}, {"comment_id": "ebyltgn", "post_id": "a6k2w6", "comment": "I’m looking forward to reading the linked post in detail— but I will say your image indicates that you’ve thought this out pretty thoroughly. If I might ask, though— does your post include historiographic analysis of a network of pieces, to kind of simulate the pattern of relationships you’re arguing for here? And does your post include a bibliography? \n\n"}, {"comment_id": "ebzj86u", "post_id": "a6k2w6", "comment": "Check out “Noise: the political economy of music,” by Jaques Attali. At face value some of his ideas seem pretty crazy, and they are worded rather morbidly. But after some consideration I think there is some merit to what he argues. \n\nI’ll have to check out your post, as I expect I’ll find my answer there, but if you are able to examine a number of pieces of music (or collections of music) and insert them into the appropriate places in your graphic it may help to establish credence for your ideas. (I’ve already said that this seems pretty well thought out, and I don’t know if you are deeply engaged in academia, but things like that go a long way.)"}, {"comment_id": "ecj6cgb", "post_id": "a6k2w6", "comment": "I wouldn't say that popular and experimental music are necessarily antonyms. A within pop music there are certainly varying degrees of experimentation - after all, elevator music is much more mundane that most songs that top charts."}, {"comment_id": "f3ozoyz", "post_id": "dhfwn7", "comment": "Sounds really interesting, would love to know what your thesis is about."}, {"comment_id": "f3syvcq", "post_id": "dhfwn7", "comment": "Nice to see some works about one of my favorite kind of metal. I thought on doing something in that area too - but our profs are rather ‚old school‘ minded. \n\nMay I ask in which city you study?\n\nBut im really wondering on which BM concert  you saw such greeting. Ive never experienced that yet.\n\nBest Wishes"}, {"comment_id": "f593szs", "post_id": "dhfwn7", "comment": "A bit late to the party but this is very cool! I'm doing a PhD in Australian metal, so it's always cool to see things like this pop up on reddit. Are you able to share your thesis? I'd love to read it!"}, {"comment_id": "e3njaoy", "post_id": "94qeph", "comment": "Not necessarily musicology, but I really enjoyed [Meet the Composer](https://www.newsounds.org/shows/meet-composer)."}, {"comment_id": "e3n2zpn", "post_id": "94qeph", "comment": "I see that you speak Danish. \n\nIf you’re fine with listening to Swedish there is an excellent award-winning podcast called [*Den svenska musikhistorien*](https://sverigesradio.se/densvenskamusikhistorien) that goes through the history of music in Sweden in 3 seasons: pre-1800, 19th century and 20th century music with Swedish folk musician Esmeralda Moberg and musicology Professor Mattias Lundberg.\n\nI’ve listened to the first two seasons and I think it’s really well made, interesting and funny. They often invite musicology researchers as well and let them talk about their area of expertise.\n\nIf you’re Danish it might not be exactly what you’re looking for, but I would imagine that a lot of the things they talk about is also applicable on Denmark."}, {"comment_id": "e3op5mc", "post_id": "94qeph", "comment": "Classical Classroom with Dacia Clay is really fun and also well informed. She's done some cool interviews and there was a great episode where they talked about Sorcerer's Apprentice. It's really accessible and not particularly academic but it's an enjoyable podcast!"}, {"comment_id": "eaud7xc", "post_id": "94qeph", "comment": "The only two actual musicology podcast I know of are New Books In Music ([android](http://www.subscribeonandroid.com/newbooksinmusic.com/feed/)|[itunes](https://itunes.apple.com/us/podcast/new-books-in-music/id425448670)), which interviews authors of a wide range of academic books on music, and Notes On Bach ([android](http://www.subscribeonandroid.com/bachsocietyhouston.libsyn.com/rss)|[itunes](https://itunes.apple.com/us/podcast/notes-on-bach/id1165571617)), which talks to scholars about Bach or other music in his general time period and area. Other than those two, although it's not a musicology podcast, I also like Early Music Sources' [youtube channel](https://www.youtube.com/channel/UCJOiqToQ7kiakqTLE7Hdd5g/) which talks about 16th and 17th century European music and music theory."}, {"comment_id": "ebylfov", "post_id": "94qeph", "comment": "There is the Soundtrack Show which I enjoy, it goes into music analysis, history, theory...I enjoy it, and it’s great when you’re trying to explain to someone what it it is that you do"}, {"comment_id": "dbmpg20", "post_id": "5k73zd", "comment": "Wow, this is horrendous. Anybody who has analyzed much pop music at all knows how absurdly common IV -> IVm6 -> I is (and of course this motion is hardly unique to pop music). Add to that all of these ridiculous adjectives (\"spicy\"??). Tempted to make a list of clearly *non*-Christmas songs that use this. His article isn't much better (and has an even more ridiculous adjective soup)."}, {"comment_id": "dcjajmg", "post_id": "5k73zd", "comment": "I found the Leonard Cohen reference hilarious: \"I heard there was a secret chord, that Vox explained and it roared the musicologists.\" The twitter-er (...) forgot to add the obvious: \"But you don't really care for music, do you?\" "}, {"comment_id": "eanrzwr", "post_id": "a14kmn", "comment": "I took a class on the history music theory. It was really interesting however I had a drop that class did you some personal issues. I still thumb through the text book every so often. "}, {"comment_id": "eapam4f", "post_id": "a14kmn", "comment": "Very much so! I can highly recommend The Cambridge History of Western Music Theory ed. by Thomas Christensen"}, {"comment_id": "eamxg9k", "post_id": "a14kmn", "comment": "Yes, have you heard of Hugo Riemann?"}, {"comment_id": "eaox33r", "post_id": "a14kmn", "comment": "There  a lot of fabulous music theory history in Harry Partch's book Genesis of a Music.  Fabulous book all around from an unparalleled musician."}, {"comment_id": "ekxa5kd", "post_id": "a14kmn", "comment": "I think one of the most interesting chapters in music theory history was Johann Joseph Fux's *Gradus ad parnassum,* an 18th Century treatise on species counterpoint.  Even though this was written in the late Baroque, it was an attempt to codify the practice of polyphony dating back to the late Renaissance, particularly that of Palestrina.  Many of the compositional trends of the Baroque (opera and the concertato style) actually repudiated complex polyphony, but counterpoint was kept alive largely because of its pedagogic usefulness.  Composers like Schutz recognized the need for a firm grounding in counterpoint, even if one's compositional efforts were more homophonic.  This sentiment would survive even into the late 19th Century, when Brahms's most common suggestion to would-be students was to study counterpoint thoroughly."}, {"comment_id": "d2q6egi", "post_id": "4hjhcb", "comment": "You might get additional answers over in /r/classicalmusic \n\nA lot of film composition pulls in a very \"Wagnerian\" sound world. So I think that anyone who was a contemporary of Wagner or who came later could hear movie themes and feel fairly comfortable with the musical language. \n\nHowever, 18th century musicians would have had a much different idea of what a melodic line should do, how it should be harmonized, and what instrumentation would work well with it. As an example, let's think about the [\"Force Theme\"](https://www.youtube.com/watch?v=1gpXMGit4P8) from Star Wars. Now there's a lot about the melodic line that would work in an eighteenth century context, but a lot would need to change about how the line is treated to bring it in line with eighteenth century aesthetics. \n\nTo illustrate what I mean, I have turned the basic melodic line of the force theme into an idiomatic eighteenth century \"ritornello\" (which is the music that an orchestra would play before a singer's entrance in an aria).\n\n[[midi mockup](https://soundcloud.com/nmitchell076/force-theme-ritornello) | [score](https://drive.google.com/file/d/0B9wYtm5NwTTVc3FoX0pRV1kyejA/view?usp=sharing)]\n\nThe first 7 seconds I pulled from the first 7 seconds of the force theme, though I alter the melodic figuration, give a full orchestral harmonization rather than the \"eerie strings\" of the recording, and repeat the last bit.\n\nThe next bit (from :7-12) is wholly my own. I just couldn't find a way to work the stuff from :7-:12 of the actual force theme into something that sounded convincing and stylistic.  An eighteenth century musician would have most likely moved onto a new idea here, whereas Williams lingers on the first idea a bit more. So I decided to try to stick with the eighteenth century mindset and do something new.\n\nThe rest of it is all Williams' melody, which I harmonized and repeated in certain ways that makes more sense to the eighteenth century.\n\nHopefully that example gives you a good sense of where eighteenth and 20th century \"thinking\" in music is similar and where it is different."}, {"comment_id": "d2qilly", "post_id": "4hjhcb", "comment": "Short answer: No. \n\nA modern orchestra does use mostly (not all) of the instruments that Mozart would have had available. Modern players also use many (not all) similar techniques. However, our musical language is much broader than that which existed in the 18th century. EDIT: I would, however, suggest based on the complexities and innovations in Mozart's later works that he would have a better shot at adapting to our new styles better than, say, Pleyel or Gluck or most of his contemporaries. Mozart in his 30s was beginning to break amazing ground in harmonic language for his time.\n\nI could write a thesis on this. If I had time tonight, I happily would. See the other replies about the style of Wagner, etc. as a good starting point."}, {"comment_id": "d2qnwbi", "post_id": "4hjhcb", "comment": "Definitely not. Music like the star wars soundtrack would probably blow his mind. \n\nNot because it's so technically superior or anything, but because it's so different.\n\nIts the same instuments, but the music is very different nonetheless. "}, {"comment_id": "d2qrxvt", "post_id": "4hjhcb", "comment": "Not sure why you chose Mozart as your example...is he just your best idea of a \"classical\" composer? I think the composer whose language is most strongly reflected in the music of Williams (Star Wars) and Elfman (Batman) is Stravinsky and possibly Debussy--freedom of tonality, shifting between diatonicism and chromaticism, and use of novel consonances/\"diatonicisms\" (modes of different kinds) in terms of the harmonies are characteristic (also freedom of meters). There are passages of Williams' music for, e.g., \"Close Encounters of the Third Kind\" that sound strikingly similar to passages in the Rite of Spring. So the musical language was developed about 150 years after the period you're talking about.\n\nJust one example of Star Wars differing from Mozart: listen to the part of the main theme called the \"Rebel Fanfare\" (the blaring trumpets part)--the harmonization here is what is known as \"parallel major triads\"--this type of harmony would've been considered totally incorrect by Mozart and his contemporaries."}, {"comment_id": "cftrkxm", "post_id": "1zhq1x", "comment": "That's my professor or was. I love Dr. Clark he's a badass and doesn't take any shit and uses the words, \"Ape-shit\" on a constant basis. I love the man, he's one of many who steered me into the musicological field. \n"}, {"comment_id": "d0p7dl4", "post_id": "494qgl", "comment": "Well, there's [*diabolus in musica*, aka the interval of a tritone](https://en.wikipedia.org/wiki/Tritone) for starters, first explicitly prohibited by Guido d'Arezzo sometime in the 10th century.  While it wasn't actually called diabolus in musica likely until the 18th century and the stories of people being excommunicated from the church for writing or singing a tritone are probably crap, the banning of an interval by the church clearly shows concern for what music could do to people.  The interval was used occasionally in Baroque and Classical music but it wasn't used freely until the Romantic era."}, {"comment_id": "d1q54f0", "post_id": "494qgl", "comment": "I you look at the Devil through the bible, he was originally the Angel of music, before he was thrown from heaven..."}, {"comment_id": "d1w5lb0", "post_id": "494qgl", "comment": "One example I have found is specifically Niccolò Paganini as he was said to have skills that were unworldly."}, {"comment_id": "d7fp156", "post_id": "51mcj7", "comment": "In the meantime I did found this https://blogs.city.ac.uk/music/2016/06/10/debate-on-are-we-all-ethnomusicologists-now-reports-and-responses/"}, {"comment_id": "d7lyq9r", "post_id": "51mcj7", "comment": "Hey there,\nI think that an excellent article on this topic is David Huron's The New Empiricism: Systematic Musicology in a Postmodern Age. It's very didactic and clear on each side of this debate you're interested in. I believe it'll bring you a lot of insights. It's available on http://musiccog.ohio-state.edu/home/data/_uploaded/pdf/LabPublications(DanEdit)/empiricism_postmodern.pdf :)"}, {"comment_id": "d9wfvx2", "post_id": "51mcj7", "comment": "Hi. I would be interested in whether or not you pursued this further, and what you came up with. I think there's a lot of questions raised here (especially about analysis), as well as some good points to be made."}, {"comment_id": "es7vm5o", "post_id": "c6bcj7", "comment": "These are \"koron\", quarter flat, and they look exactly as they should.\n\nThey are from Persian classical music. The scales are \"dastgah\", and are essentially modal music. (The names are mentioned; there are many more.)"}, {"comment_id": "es7qzw7", "post_id": "c6bcj7", "comment": "I'm not sure what they are but half flats are when they are flipped over horizontally so it might be a variation of it or it's been replaced by another symbol"}, {"comment_id": "e8ht2b1", "post_id": "9rc28c", "comment": "This is a cover for their experiments with powerful quantum sonic waves that they plan to use to destroy Trump's wall with harmonics and resonance frequencies. We have to stop them! "}, {"comment_id": "e2bpibr", "post_id": "8w3fwf", "comment": "If you find one let me know. I am a popular music scholar and most of the research is really in its infancy compared to Western art music, so it makes sense that there isn't really yet a definitive encyclopedic text. I would suggest picking up The Cambridge History of Twentieth-Century Music, which is a wonderful collection of essays on everything from Schoenberg to the Punk, to start with. There are, however, many great articles and academic books on individual genres that I could steer you towards. PM me if you have any questions or would like some recommendations especially on hip-hop, punk/new-wave, and metal. "}, {"comment_id": "dy6yxxj", "post_id": "8fu8h1", "comment": "A very good (and I think generally accessible) place to start as an intro into musicology is [*Rethinking Music*](https://books.google.com/books?id=HXNhnGW7hG8C&printsec=frontcover&source=gbs_ge_summary_r&cad=0#v=onepage&q&f=false). It gives you introductions to a lot of the issues that musicologists deal with today, and is generally just kind of interesting. There isn't a ton of ethno- in it, but there is an essay by Bruno Nettl, who is one of the titans of that field. You could certainly use his essay as a launchpad for other things.\n\nIt'll be controversial, but you could also read Joseph Kerman's [*Contemplating Music*](https://books.google.com/books?id=3l5_RnxYzlkC&printsec=frontcover&source=gbs_ge_summary_r&cad=0#v=onepage&q&f=false). It came out right at about the time that the field had really turned a corner toward cultural studies (it had been happening for some time, and this book is an essay on that)."}, {"comment_id": "dy87pwz", "post_id": "8fu8h1", "comment": "Adorno's 'Aesthetics' "}, {"comment_id": "dy831jc", "post_id": "8fu8h1", "comment": "[An Introduction to Music Studies](https://www.amazon.co.uk/Introduction-Music-Studies-J-Harper-Scott/dp/0521603803) offers short introductions to many of the different aspects of musicology and is an excellent place to start."}, {"comment_id": "dy6rc4y", "post_id": "8fu8h1", "comment": "Schonberg’s Lives of the Great Composers is a good overview of classical music from the late Renaissance/early Baroque music of Monteverdi and going up to as recent as the 1970s-80s, however it may have been updated since I only have the first edition. Easy to read and does not get technical with music theory too much. Definitely a good read for someone who isn’t necessarily a music student but interested in the subject! The Lives of the Great Composers https://www.amazon.com/dp/0393038572/ref=cm_sw_r_cp_api_i_NOL5Ab9HFARNC"}, {"comment_id": "dy7kywd", "post_id": "8fu8h1", "comment": "Musicology is a very broad field, with many niches and specialties. A good way to start is by reading small papers from different journals. If you have access to Jstor or any other kind of database, search for topics that interest you inside various musicology journals and from there you can find references to books that may interest you."}, {"comment_id": "dystk28", "post_id": "8fu8h1", "comment": "*The Cultural Study of Music: A Critical Introduction* Is pretty good."}, {"comment_id": "e4ig8oa", "post_id": "8fu8h1", "comment": "I would suggest the reading list provided by KCL's MMus Musicology & Ethnomusicology:\n\n* Beard, David, and Kenneth Gloag, *Musicology: The Key Concepts* (New York: Routledge, 2005).\n* Bergeron, Katherine, and Philip Bohlman, eds., *Disciplining Music: Musicology and its Canons* (Chicago: Chicago University Press, 1992).\n* \\*Cook, Nicholas, *Music: A Very Short Introduction* (New York: Oxford University Press, 2000).\n* Harper-Scott, J. P. E. and Jim Samson, eds., *An Introduction to Music Studies* (Cambridge: Cambridge University Press, 2009).\n* Sampsel, Laurie J., *Music Research: A Handbook* (New York: Oxford University Press, 2008).\n* Stobart, Henry, ed., *The New (Ethno)musicologies* (Lanham, MD: Scarecrow Press, 2008\n* \\*Stone, Ruth, *Theory for Ethnomusicology* (Upper Saddle River, New Jersey: Prentice Hall, 2008)."}, {"comment_id": "datiul5", "post_id": "5gm6g3", "comment": "Books are a good idea! Haruki Murakami has a new book out about music she might enjoy (I've not read it). For something lighter and (perhaps more) popular, Ben Ratliff's *Every Song Ever* is a new take on an old type of book. \n\nShe might also like to read fiction after the semester ends, I know I do. Is there something you loved reading that she's not familiar with? "}, {"comment_id": "dautfr6", "post_id": "5gm6g3", "comment": "I would give her Milan Kundera's book called The Curtain - a collection of essays in 7 parts, about the art of the Novel, evolution of artwork and style and such. Kundera is himself a musicologist, and an amazing writer, and this book is enlightening about art in general, without being too academic but obtusely related to the field of work :)"}, {"comment_id": "db3ftxs", "post_id": "5gm6g3", "comment": "Can't believe I forgot this——Julian Barnes's novel *The Noise of Time*. It's about Shostakovitch, sounds like a good fit."}, {"comment_id": "dauq1s5", "post_id": "5gm6g3", "comment": "The rest is noise is a great book though she probably knows much of it already. There is also Modern Music And After which is similarly good. If you're looking for something academic you could find the Cambridge Companion to one of her favourite composers, if she doesn't already have it "}, {"comment_id": "czxcdly", "post_id": "3x461a", "comment": "Hey, I looked a bit into this since I've moved here to Norway and there are very very few sources about how Viking music would have been. The only sources are pretty much hundreds of years ago. A few Norwegian musicians do say they have kept the old shamanic traditions (such as Wardruna) although I would take what they say with a grain of salt. \n\nYou might be interested in checking out sami music though, such as the joik which is better documentated. "}, {"comment_id": "cy2b5h6", "post_id": "3x461a", "comment": "Maybe check askhistorians?"}, {"comment_id": "d04prua", "post_id": "3x461a", "comment": "Joik! I know nothing about music really, but i've found korpiklanni to be semi-close. Semi. They're metal and pretty fun to listen to."}, {"comment_id": "d0z7ndm", "post_id": "3x461a", "comment": "https://youtu.be/FBS-oS723qI  Forndom is very good modern viking music \n\nhttps://youtu.be/GWjPOMANdUU?t=1 Folket Bortafor Nordavinden\n\nhttps://youtu.be/wsl-KHGe4Kk?t=1 Eivør Pálsdóttir\n\nhttps://youtu.be/0k01zY822dk?t=4  valravn\n\nhttps://youtu.be/5RStnppJfWs?t=5 ruhr hunter\n\nhttps://youtu.be/Cy44ocuoWhE?t=4  Garmarna - Herr Mannelig\n\nhttps://youtu.be/LgGIOZiVCVU?t=2 modern style nordic\n\nhttps://youtu.be/MNsjsEate-Y?t=14 slavic / tundra stule modern\n\nhttps://youtu.be/aNf-kYzM9Dk?t=2 Norwegian flute folk\n\nhttps://youtu.be/D6-kylaf5vI?t=11  Norwegian Munnharpe\n\nhttps://youtu.be/tq4seuBFxIM?list=PLE9C7B5E6AD55C587&t=1 iceland folk \n\nhttps://youtu.be/KNSt2qc7Ayk?list=PLE9C7B5E6AD55C587&t=4\nfrom iceland \n\nhttps://youtu.be/KNSt2qc7Ayk?list=PLE9C7B5E6AD55C587&t=4\nfrom Norway calling animals home for night\n\nhttps://youtu.be/DQbgwFd-doI?list=PLE9C7B5E6AD55C587&t=1\nNordic folk instruments \n\nhttps://youtu.be/uruBjSGwp6M?list=PLE9C7B5E6AD55C587&t=2\nNigel Pennick Music and Songs No.10 Grindonrigg norwegian style\n\nhttps://youtu.be/3pGsx9KLJxw?t=2\nSecret Garden - Nocturne - winner Eurovision 1995\nhere you can see level of todays nordic music \n\nhttps://youtu.be/eNt82XUoozk?t=9    Listen to this and your there\n\n"}, {"comment_id": "cteraks", "post_id": "3efis8", "comment": "Since the 1990's the field of popular music studies has embraced several other academic fields of study, because prior to the 90's there had been a narrowed focus on the analysis of music as only a work of art, and when applying the usual analytical tools to examine works of popular music artists, the general consensus was that popular music was not of any significant creative or cultural value, that it was, as you put it, written to be easily receptable to the general public. Though since the 1990's a vast amount of scholars have taken a different and largely sociological/anthropological approach and generally accepted, that we simply did not have the neccessary set of terms to describe the creative/cultural value of popular music. The result of these post-90's writings have produced extensive writings about for example how popular music was a major player in the creation of gay and queer identity in the 70's or how woman used the masculine power of rock-music as a feminist tool. To discuss the value of popular music usually requires one to extend your thoughts further than a classic empirical analysis of the music in question. I'm really glad that my university offers a lot of classes to discuss the aesthetics and value of popular music, because I have had the exact same thoughts as you, and I have really been challenged to try and think differently about how I discuss music. Here are some introductional writings on the topic (sorry for long links, these chapters aren't always easy to find) \n[Simon Frith, towards an Aesthetic of Popular music](https://books.google.dk/books?id=ZFBUsDpDTx4C&pg=PA257&lpg=PA257&dq=simon+frith+towards+an+aesthetic+of+popular+music+online&source=bl&ots=OVXnbYW675&sig=KtBF2FyqJ40wd0oZSyUxgjOel_Y&hl=da&sa=X&ei=KAZjVaygH4H1Ur6QgKAD&ved=0CDEQ6AEwAg#v=onepage&q=simon%20frith%20towards%20an%20aesthetic%20of%20popular%20music%20online&f=false)\nor\nCarl Wilson, \"Let's talk about love: Why other people have such bad taste\". I was only able to find excerpts online, but if you could find it, it talks about how popular music usually exists in a different field of discussion than just the work of art in question"}, {"comment_id": "cy7fg0b", "post_id": "3efis8", "comment": "I think it's impossible to draw a clear line.\n\nWhen thinking about this, I think it's helpful to use analogies outside of music. One of my favorites is comparing it to food. \n\nPop music would be the equivalent of McDonalds, while high art composers would equate to a 3 Michelin Star restaurant. Can we really say that one is better than the other? No. We can't. There is no objective measurement by which we can compare them. However, I think most people in their right mind would say that a fine restaurant is better than fast food. So what makes it better?\n\nFast food is cheap and made for quick assembly. The aim of fast food restaurants is to feed as many people as possible as efficiently as possible. The food is oversaturated with salty flavors, as they know that this is what we crave, and thus it makes the food much more marketable and appealing to almost everyone. Not only that, it lacks care. I don't think any upcoming chefs who are passionate about food are working in the kitchen of a McDonalds right now. \n\nIn a fine restaurant, the ingredients are all very high quality. The recipes take time, effort and attention. In this food the flavors are much more subtle and sophisticated. Not every dish is meant to appeal to every person. And most of all, there is a sort of craft-like care that goes into making every dish.\n\nFor me, these features carry over into music. Popular music tends to lack care, and is cheap, made from the same sounds that we are shown to like, and its aim is to appeal to as many people as possible. Art music is for a narrower audience, but provides an experience that pop music can't. \n\nHowever, this is just my opinion, and it is different for everyone!"}, {"comment_id": "ctfcptn", "post_id": "3efis8", "comment": "This type of debate is usually referred to in important music circles as \"total shitty elitist bullshit\". \n\nWTF does \"artistic\" even mean? \n\nThis is the kind of debate had by people who have zero real experience in one or the other field. Plenty of \"art music\" is made for profit, plenty of popular music is made for art, and who cares? It's a stupid distinction. \n\nI refuse to believe that \"The Juliet Letters\" is inherently superior to \"This Year's Model\" just because one sounds like \"art music\" and one doesn't. And it's a silly debate to have in the first place because the very distinction that underlies the debate is misguided and false."}, {"comment_id": "cwmexon", "post_id": "3efis8", "comment": "I can rant about this for a bit. I often wonder about this distinction too. One main split between the two is what the audience is most likely to do while the music is playing. Art music is, to me, music that has a lot of subtle and hidden moments that would not be heard if you weren't giving it your attention. There are plenty of pop songs like this so it's not a hard division. Music that is meant to be listened to in an intimate setting is Art music to me. That can be lots of different kinds of music of course. But think about yourself sitting in the dark listening to the music in question, is it touching or hilarious? Chances are if it is hilarious that you would be listening to it by yourself then its not art music. "}, {"comment_id": "ctejiyz", "post_id": "3efis8", "comment": "Why make a distinction at all? Music is music, and one type of music is not inherently better than any other.  You might have your preferences, and you might appreciate the complexity of the craft in composing \"art music\", but I don't think that you can say that any type of music is superior without being much more specific.\n\nYou say that Native American tribal dances are superior to most pop... In what way?"}, {"comment_id": "emua1m3", "post_id": "bm69ux", "comment": "I can't refer you to what you're looking for, partly because i've never come across it, but also partly because I don't think it's a thing that happens a lot. \n\n&#x200B;\n\nHistorically informed performance is more than just playing on old instruments. In order for your comparison to work, you would have to find people who are using instruments from a certain period, fx. the 50s, in order to perform music written during the 50s, on instruments from the 50s, with 50s technique, in order to get as close as possible to the sound of that era. Which is not a common thing, to put it mildly.\n\n&#x200B;\n\nUsing guitars from the 50s to make modern music is no different from playing modern music on a harpsichord or a violin from the 1600s. That's just a matter of preference and sound."}, {"comment_id": "emud9h0", "post_id": "bm69ux", "comment": "I talked about this in the final chapter of my masters thesis where I discussed “authenticity”. In the HIPP movement, attempting to recreate historically accurate (or at least informed) performances is considered authentic.\n\nIn popular music, recreating someone else’s sound is quite the opposite. I used to play in a Beatles cover band in high school, and we attempted to use “original instruments” (rickenbacker guitars, hofner violin bass, vox amps, etc) which was a lot of fun. \n\nBut had we ever tried to book a real show imitating the Beatles, we’d only be seen as a cute novelty, and certainly not a “real” band worthy of being taken seriously. You have to find your own sound to be considered “authentic.”\n\nA more extreme example would be Elvis impersonators who can only render a cheap caricature of the rock n roll legend. \n\nTwo forms of authenticity in music, yet completely opposite. I find this fascinating."}, {"comment_id": "ebx10cu", "post_id": "a5bzvr", "comment": "WOW i didn´t know cumbia originated in Africa, thanks for sharing"}, {"comment_id": "eclb6dk", "post_id": "a5bzvr", "comment": "I love cumbia. Thanks for sharing this!\n\n&#x200B;"}, {"comment_id": "e6oi3l7", "post_id": "98vo3a", "comment": "Unemployment offices."}, {"comment_id": "e4jsq12", "post_id": "98vo3a", "comment": "For the real world: definitely in universities and some research organisations.\n\nBut I guess you're talking about internet? I would say that there's really a shortage of platforms for musicologists. I mainly uses [https://www.academia.edu/](https://www.academia.edu/) and [https://www.researchgate.net/](https://www.researchgate.net/) for academic communication as scholars publishing their papers at those two sites, and you could have some communication with them.\n\nSecondly I would recommend [https://www.quora.com/](https://www.quora.com/) & [https://stackexchange.com/](https://stackexchange.com/) as they're Q&A platforms and some musicologists would gather there and answer questions."}, {"comment_id": "e4jaez3", "post_id": "98vo3a", "comment": "[deleted]"}, {"comment_id": "e4jm5ow", "post_id": "98vo3a", "comment": "In universities and academic world."}, {"comment_id": "e54dmp8", "post_id": "98vo3a", "comment": "are you in the discord yet? if not please join our community, it's exactly for people like you: https://discord.gg/anksAau"}, {"comment_id": "e4jt7i6", "post_id": "8vvfng", "comment": "Noted. Thank you so much for your kind sharing!"}, {"comment_id": "dddglmp", "post_id": "5s8y7a", "comment": "I don't know, it's weird. I'd think the mods would have some way to filter, but maybe not. "}, {"comment_id": "ddei94m", "post_id": "5s8y7a", "comment": "It's bad on /r/ethnomusicology  and a few other smaller subs I'm on as well. I downvote and report all the ones I see, but I don't know if the mods are active enough to do something to stop it. Honestly not sure what can be done. It's not a problem for me on bigger subs, but that may just be because they get downvoted and/or removed so fast I never see them."}, {"comment_id": "dddnhje", "post_id": "5s8y7a", "comment": "/r/svenska is having the exact same problem."}, {"comment_id": "d251fne", "post_id": "4f04dp", "comment": "As early as classical Greece and Rome there was a genre of singing while accompanying one's music on the lyre - called kitharody.  (A lyre is like a small, portable harp which can only play in the range of a single diatonic scale or so - though chromatic notes were often added to the instrument, and some extended techniques were available, like note bending or harmonics.)  The instrument's primary role was simply to double the melody, but it would occasionally venture into playing different notes.  Greek music theory does not tell us much about this sort of polyphony, except that it could involve \"exotic\" intervals like major or minor thirds, as well as quasi-'consonant' (most likely septimal) tritones and minor sevenths.  (Greek music theory is mostly a theory of monophonic melody, in which only intervals of a fourth and a fifth were considered \"consonant\".  By contrast, this sort of polyphony seems to have been largely a practical/empirical pursuit.)"}, {"comment_id": "d251mnz", "post_id": "4f04dp", "comment": "The short and totally unhelpful answer is \"ancient.\"  This is one of those things that goes way, way, way back.  I read up on it long ago, and I think it was a few millenia ago that people started to mix vocals and instruments, not necessarily by the same person.  That said, the evidence was fragmentary at best, much like my memory of the subject.  Most likely, this is something that coevolved with instruments.\n\nThis question is probably better suited for /r/AskHistorians, since around here you'll get answers like mine.  Aside from that, I've found that music and history have a hard time mixing.  When I tried to start a historical music group, I could find only historians without taste for music, and musicians without taste for history.  Different priorities, I guess."}, {"comment_id": "d24yybg", "post_id": "4f04dp", "comment": "This reminded me of something I'd heard about one of Schubert's friends, and I managed to find this online:\n\n>From 1818 to 1820, Schubert shared lodgings with the poet Mayrhofer, who \"learned to play guitar so that he could accompany his own singing which, by the way, was not exactly beautiful\"\n\n[Source](http://www.jacaranda-music.com/Schubert.html)\n\nThe article cites this as the original source: Deutsch: Schubert: a documentary biography p354\n\nSo I would guess that accompanying your own voice on instrument is not anything new, but it's difficult to find historical examples for this sort of thing."}, {"comment_id": "d24y1pa", "post_id": "4f04dp", "comment": "Unusual topic, I like it.\n\nAlthough I can't explicate an entire history of simultaneous singing and playing, I can at least point you to some examples and make some speculative generalizations.\n\nI'm primarily a composer (PhD), so most of my knowledge of the topic is in the (trendy) realm of \"extended techniques\" for the purpose of timbral variation, rather than contrapuntal expansion via multiple voices (which is what I suspect you are interested in).  Specifically I looked at brass playing, and more specifically, trumpet playing.  I actually studied the \"other\" kind of brass multiphonics, split-tones, as part of my qualification exams, but singing-and-playing was always in my periphery.\n\nThere was an explosion of study on extended techniques in the late 1960s, at least partly because of Bruno Bartolozzi's popular [New Sounds for Woodwind](http://www.worldcat.org/title/new-sounds-for-woodwind/oclc/602163294).  Unfortunately for trumpet players, generating multiphonics with two or more fundamentals using our tiny lip-reed + resonator systems wasn't as easy as with woodwinds, or with larger brass instruments.  Instead, a lot of players and their composers adopted singing-and-playing \"multiphonics\" as an easier substitute to get weird timbres with beating, etc (if you sing below the pitch you are playing on a trumpet, the deconstructive interference seems to be much more pronounced, hence, beating).  This technique was so prevalent in trumpet extended technique books that the word \"multiphonics\" is almost always associated with \"singing-and-playing\" in that literature.\n\nConversely, on trombone, multiple-fundamental multiphonics generated solely with the lip-reed + resonator system (the lips and the instrument), \"split-tones,\" have been more accepted and widely used, perhaps because the larger mouthpiece accommodates multiple buzz-points easier.  You can actually see this in high speed video of [Stuart Dempster's lips](https://youtu.be/gmBDG_wAeS4?t=3m31s).\n\nIt wasn't until recently that \"split-tones\" have been more widely adopted by trumpet players.  Perhaps we all just got over our fear of ruining our embouchure after Peter Evans released [Nature/Culture](http://www.newmusicbox.org/articles/Sounds-Heard-Peter-Evans-Nature-Culture/).\n\nAnyway, with \"split-tones\" aside, my favorite trumpet work involving singing-and-playing actually involves a kind of ventriloquism, whereby the trumpet player sings in and around (mostly around) around his or her playing: [Kryl](https://youtu.be/XrVp7fubzo4).  Interestingly this had a lot to do with the premiere performer's ([Ed Harkins](http://www.harkinslarsonthe.com/)) interest in the actual practice of ventriloquism.\n\nTL;DR: On trumpet, singing-and-playing has been frequently considered an easier alternative to split-tone multiphonics, primarily for the purpose of timbral expansion, rather than for adding a musical voice to the texture."}, {"comment_id": "cq2qjo9", "post_id": "2z5ju4", "comment": "It's great to see another person that has studied Historical Performance on here (I'm a Baroque violinist)! I didn't know about Patreon, it sounds like a great idea and an interesting way to get funding for projects.\n\nSidenote: I visited your site and there were a lot of formatting problems/link issues (I'm using the most updated version of Firefox)."}, {"comment_id": "col57z2", "post_id": "2fwqh5", "comment": "Oh man, *Repeating Ourselves* is fantastic - there's an amazing chapter on Reich's compositional method ca. *Eighteen Musicians* and its relation to '70s disco."}, {"comment_id": "ckfhdud", "post_id": "2fwqh5", "comment": "The phrase, \"Art Music\" is so banal"}, {"comment_id": "ewo51wd", "post_id": "cp7y8p", "comment": "Just a personal thing, but I find that listening to a sus4 chord helps hearing a P4 as a dissonance. The most dissonant relationship in a sus4 chord is of course the clash between the 4th and 5th notes, but you can hear the involvement of the root as well."}, {"comment_id": "ewnt2zs", "post_id": "cp7y8p", "comment": "I think the consonance of P4 is somewhat illusory because often out of context it sounds like a 5-1. I think if you hear the first note as the tonic, then it sounds dissonant to move up a fourth if the tonic key is still heard."}, {"comment_id": "ewnykzx", "post_id": "cp7y8p", "comment": "Improvise two voices a 3rd or a 6ths apart on a piano, then change for a 4th at any random moment. You'll see exactly why it was considered dissonant in this setting."}, {"comment_id": "ewpbreo", "post_id": "cp7y8p", "comment": "Its more of a written thing because it's treated like a dissonance in part writing. Ic - V - I for example the 4th in the first chord resolves down to the 3rd of the second. The same way you would resolve a dominant 7th down to the 3rd of the tonic chord."}, {"comment_id": "ewpc7kg", "post_id": "cp7y8p", "comment": "None of the comments talking about temperament. Tsk tsk, bad r/musicology"}, {"comment_id": "e0xv7f6", "post_id": "8s5jpm", "comment": "This is a Chicago thing and not nationally known song or is it ? I mean no one who lived all their life on the west coast would know this right ? "}, {"comment_id": "d0iofif", "post_id": "48cfhi", "comment": "Let us know about the results of the survey."}, {"comment_id": "d0j56ag", "post_id": "48cfhi", "comment": "Answered it, a pretty good questionnaire but could've used a few more questions perhaps? Can you answer what exactly you are looking for with the questionnaire?"}, {"comment_id": "ct7yu4o", "post_id": "3drepm", "comment": "No specific examples come immediately to mind, but I watch a lot of historical documentaries and this is a pet peeve of mine.  Frequent offences that I notice are the use of mid-seventeenth century Playford dances to create a \"medieval English\"/Robin Hood type feel, and the use of (easily recognizable) baroque or classical music with Renaissance stuff."}, {"comment_id": "ct7xelv", "post_id": "3drepm", "comment": "A brief scene in The Hunger ('83) has 1700s David Bowie and Catherine Deneuve playing Death and the Maiden. Not really a plot killer, but it was there. I wonder how often folks who research that stuff can take the time to make corrections."}, {"comment_id": "ct83t4x", "post_id": "3drepm", "comment": "This barely counts, but I noticed it (among other horrible, horrible things about the soundtrack) in \"The Great Gatsby.\"\n\nThe book was written in 1925, and only two songs used in the soundtrack are from before that date.  Most of the almost-era-appropriate songs or from 1928 and 1929. Even giving them some leeway, the movie is set in 1929, but is a flashback to prior events, placing most of the recognizable tunes as not-yet-written or not-yet-recorded.  \"Ain't Misbehavin'\" stood out when I was in the theatre watching it at its release as being out-of-time, which prompted me to look up the other tunes used.\n\n[getting off topic]: The casting of obvious non-musicians (the trumpet player who has some good front-and-center screen time, and the upright bass player, later on during some of the parties) really destroyed any suspension-of-disbelief for me, as it was beyond obvious that they were actors hired for their appearance and told to just wing it by the director.  But really, for $105 million, you'd think they could do better casting.\n\nhopefully my username explains why this all bothers me so much. I had very high hopes for a resurgence in the popularity of the music of that era. sigh. "}, {"comment_id": "ct89lbq", "post_id": "3drepm", "comment": "Was watching something on the US Civil War and they played Holst's Mars during one of the battle scenes. Dunno if that really counts, but I did reflect on how most people probably thing anything with \"violins and stuff\" is probably way older than that war."}, {"comment_id": "ct87k19", "post_id": "3drepm", "comment": "I'm pretty sure The Wedding Singer was filled with 80s songs that came out after when the film takes place. They just seemed to go \"okay, this takes place in THE 80s, let's take any songs from that decade.\" "}, {"comment_id": "ct8hlj9", "post_id": "3drepm", "comment": "The tv series North and South is spot on anyway, a relative of mine who is an expert in that periods music was employed to oversee it. "}, {"comment_id": "ct8ptv2", "post_id": "3drepm", "comment": "This is sort of tangential to your post, but it reminded me of a pet peeve of mine, which is when shows and movies try to seem smart. Best example I can think of is in The West Wing, there's an episode when Bartlett is going to the orchestra and he mentions that a half of the concert was \"modern\" music, like Schoenberg and Barber and something else. Sorkin loves seeming smart, and that one just rubbed me the wrong way because Barber is hardly what you'd call modern music, largely. Just send an email to someone when you're writing a line like that, yeah?"}, {"comment_id": "ct9967t", "post_id": "3drepm", "comment": "In Oklahoma!, during \"Kansas City\", Wil Parker dances to a song and he calls it ragtime, but it's actually a two-step"}, {"comment_id": "ct9zkpf", "post_id": "3drepm", "comment": "I usually lean more toward giving directors a pass on choices like that. If a 15th century period drama calls for a sweeping, epic, grandiose feeling, and all you have from that period is Gregorian chants or Renaissance lute music, that's not going to sell your audience on the emotional direction of the scene regardless of how accurate it is.\n\nThat said, I think it's really laudable when a production can use period music well. I thought *Mad Men* was especially fantastic at this, using deep cut 60s pop songs in their soundtrack."}, {"comment_id": "ctd3tg2", "post_id": "3drepm", "comment": "just wanted to pop in and say when watching Amadeus (the fountain from which a lot of historical inaccuracies flow) it always irks me when i see Tom Hulce in front of the orchestra conducting. ay, yo, conducting wasn't really a thing until the 19th century.\n\nit also irks me when i see pictures of Beethoven conducting like at a Barnes and Noble or something and i'm just like \"he never did that.\""}, {"comment_id": "cqn5dpf", "post_id": "33ovzw", "comment": "Margot is fantastic, so that's a great place to start. Willi Apel's *The Notation of Polyphonic Music* is an important book, too, for this period. Gustave Reese's *Music in the Middle Ages* and Jeremy Yudkin's *Music in Medieval Europe* are also useful overviews of the period. You can look at someone like Elizabeth Eva Leach, who works on Machaut, and see what her bibliographies contain, and that would be a way to find more stuff.\n\n\nAlso, I would just note that musicology isn't just early music study. :)"}, {"comment_id": "cqnfcns", "post_id": "33ovzw", "comment": "* Berger, Anna Maria Busse. *Medieval Music and the Art of Memory*. Berkeley: University of California Press, 2005.\n* Crocker, Richard. *An Introduction to Gregorian Chant*. New Haven: Yale University Press, 2000.\n* Levy, Kenneth. *Gregorian Chant and the Carolingans*. Princeton: Princeton University Press, 1998.\n\nSome of these might be a little earlier than your timeframe, but they're excellent representatives of key work in this area.\n\nHave fun!"}, {"comment_id": "cqn9g9y", "post_id": "33ovzw", "comment": "I am really enjoying Richard Taruskin's Oxford History series.  The first one is called something like \"From Earliest Notations to 1600\"."}, {"comment_id": "cr7mi00", "post_id": "33ovzw", "comment": "I'm not too well-up on the period, but I liked Richard Hoppin's *Medieval Music*. I found it very accessible! The Gustave Reese book mentioned above is good too."}, {"comment_id": "cjmnuk2", "post_id": "2d4ukk", "comment": "I'm assuming that you're in college, probably studying music. If that's the case, my best advice is to ask some of your faculty. Don't limit that discussion just to musicology faculty members, but speak with others (theory, education, etc.), who may be published in their professional journals and ask them about the process of researching, writing, and being published.\n\nIf you're not in a position to ask faculty members, or they don't respond with helpful information, speak with TAs, graduate students, recent graduates, etc."}, {"comment_id": "cjms01i", "post_id": "2d4ukk", "comment": "NB: make sure to follow the citation format preferred by whatever journal is receiving your CV! (and, if possible, other formatting details...page layout, fonts, etc.)\n\nMay I ask what you're interested in writing about?"}, {"comment_id": "cjmm09b", "post_id": "2d4ukk", "comment": "Disclaimer: I've never written for a journal, but this is how I would go about trying to write for a journal. \n\nMy advice would be to find a couple of different journals and read several articles to figure out what the general tone and topics of the journals are. Next, I would just write something, whether it be a review or a short essay. It doesn't have to be a masterpiece, the important thing is that it is well written and that it shows your passion for musicology. After you have a good writing sample, I would send it to the journals. A lot of journals usually have a place that tells you how to submit articles. \n\nI hope that helps. Good luck in your endeavors!\n"}, {"comment_id": "chqzr80", "post_id": "26g2i0", "comment": "My friend runs a vlog on YouTube called \"musicology for the people.\" "}, {"comment_id": "chqwg6n", "post_id": "26g2i0", "comment": "Not a podcast, but something thats nice to listen when you've got a long road trip or something like that. Unfortunately it's not a series, but its worth listening to (unless you're not a fan of Glen Gould, in which case you might spend an hour rolling yours eyes!) \n\nhttp://youtu.be/AirAT7gN6A0\n\n"}, {"comment_id": "ciesipl", "post_id": "26g2i0", "comment": "http://www.theinvestigativemusicologist.com"}, {"comment_id": "cjxgls2", "post_id": "26g2i0", "comment": "Have you listened to the [Pandora Musicology Show](http://blog.pandora.com/2009/07/24/new_podcasts_ab/comment-page-1/)?\n\nThere was also the now discontinued [Labyrinth of Music Theory](https://itunes.apple.com/us/podcast/the-labyrinth-of-music-theory/id289335612?mt=2)."}, {"comment_id": "chr8jsm", "post_id": "26g2i0", "comment": "I don't know that there are general musicology (I assume you mean traditional/historical) or theory podcasts are out there, but there are good ethnomusicology podcasts, but you have to know what you are looking for. Look at Afropop world wide for somewhere to start, or search by subject. \n\nSome larger orchestras and national arts foundations put out interactive websites on various pieces and composers that would be worth looking at too... I cant think of any off the top of my head but when I get back to my computer I'll post some if I remember."}, {"comment_id": "etpkdu6", "post_id": "ccsiuj", "comment": " I think it’s medieval Modal Notation. \n\nIt was used during the so-called Notre-Dame Era in the 12. and 13. century to notate polyphonic music.  It was the first kind of music notation in western Europe that not only pictured the melody but also the rhythmic patterns. \n\nI did a course on this at university for my studies, and I remember it was not not soo hard to “translate” it, if you know a bit about music theory and stick to the rules of the patterns. But...It’s been a few years though :D \n\nHere are few sources that might be interesting to you\n\nhttps://en.m.wikipedia.org/wiki/Modus_(medieval_music)\n\nhttps://digitalcommons.cedarville.edu/cgi/viewcontent.cgi?article=1031&context=musicalofferings"}, {"comment_id": "ewkuw9h", "post_id": "ccsiuj", "comment": "I’m happy I stumbled upon this! I won’t pretend to be an expert, but I just finished a course on this at UCLA. This is not polyphonic writing, like some users have said— it’s earlier, before polyphony was “invented” (or at least before we invented a way to notate it). You’re correct in saying this is from Psalm 70 and here’s a link explaining what that means: http://www0.cpdl.org/wiki/index.php/Psalm . Often, there were no “names” for these musics; they are simply referred to by the short phrase that begins them. This is found somewhere on the page linked above.\n\nAs for what it likely sounded like, it’s impossible to say. For one example, here’s a link to Richard Crocker’s website: http://www.richardlcrocker.com/chants . He recorded himself singing all the known Gregorian chants and put them on his website. “Accuracy” is difficult to determine, as the notation gives us very little information outside of the text and perhaps the melody. We have a primitive understanding of how this sheet of music is supposed to be performed, but we have no idea what it was supposed to sound like. Maybe it was sung by one person (a priest?) during a mass, or maybe the whole congregation joined in; was it sung during the service or in day to day life? We don’t really know. However, if that’s a real sheet of ye olde music notation, you have a very valuable and important piece of music history in your hands!"}, {"comment_id": "etp03lc", "post_id": "ccsiuj", "comment": "My father bought this in Barcelona a few decades ago and has been framed on his wall ever since. The man he bought it from was pulling pages out of old books and selling them. I am trying to find as much information as I can on this. I posted this on r/tranlator and found out that it is Psalm 70. Does anyone know what this  would have sounded like, or what time period it is from? Lastly (unlikely I know) does anyone know the piece of music? \n\n [https://www.reddit.com/r/translator/comments/cc33oh/latin\\_english\\_my\\_mother\\_has\\_asked\\_for\\_another\\_she/](https://www.reddit.com/r/translator/comments/cc33oh/latin_english_my_mother_has_asked_for_another_she/)"}, {"comment_id": "esmcqmo", "post_id": "c8bq96", "comment": "There are not many jobs outside academia that specialise in musicology. You might find that high school teaching is the biggest alternate career option. It has its own challenges and rewards. You can also teach privately, but the bulk of your income (at least at first) will probably come from beginner-to-intermediate instrumental lessons. That has been my experience, at least."}, {"comment_id": "eso32jr", "post_id": "c8bq96", "comment": "I’m currently working on my MA in Music Theory and what I’ve absorbed from the other grad students and the general academic climate has shown me that going on to hyper specialize in MT (or musicology) would be professionally detrimental in the 21st century. Instead I’m going back to undergrad (doing some adjunct MT teaching) to get some classes in computer science before applying to a Music Technology program. \n\nShortly, it seems to me that specialist researchers in music are getting the short end of the stick in the rapidly changing 21st century academic climate. My old theory professors job was filled by an instrumentalist because “why hire someone else when we all know and can teach theory 1 - 4? I think musicology/music history falls victim to the same issue, though maybe less so. \n\nMy goal is to be able to access broader fields of professionalism including music research (theory, musicology), instrumentalism, and technology. I think that’s the best course of action for music researchers like us today. Hope my thoughts help."}, {"comment_id": "et56lsh", "post_id": "c8bq96", "comment": "I think one thing you might consider as well is the potential to develop other skill sets as you pursue a music degree. This is something that is more pronounced at the undergrad level: a friend of mine who got a degree in composition developed a lot of skill coding while working on computer music projects and ended up in Seattle developing phone apps. \n\nAnyways, generally, you'll have time to pursue grad school studies, teaching, and maybe to develop one other skill. I think a lot of musicologists pursue an instrument as the \"other\" thing. I understand that impulse, but sometimes I think they choose that because it is the \"obvious\" one. If you can instead invest that time into developing a related skill, then perhaps that might translate into some sort of career path outside of the Academy. \n\nIn my own case, I spent a lot of time getting my graphics for my papers to look really nice, and transcribing a bunch of scores, trying to learn the ins and outs of notation programs along the way. That work has helped me in turn get side jobs preparing presentations for people and generating graphics for music articles and books. While certainly not a career, it does develop a record of doing graphic design work that could serve as an escape hatch if my academic career implodes (not to say I'd be set by any means, I'd certainly have to spend a lot of time retraining myself if I made a career change)\n\nBut the point is, there are skills you can develop during a musicology degree that might prepare you for other work. Work in computer programming, in graphic design, web design, library science, editing, or really whatever. But none of that will be provided in the classroom, it's not the official work you'd be doing for your degree. But it can synergize with it.\n\nI certainly wouldn't *plan* on jumping out of the field when you go into it. But I guess the point I'm making is that there is a degree to which you can develop some skills that would help you form backup plans in case things don't work out. You don't have to wait until things fall through to develop those skills, you know?"}, {"comment_id": "eslyf22", "post_id": "c8bq96", "comment": "I personally can't offer advice as I am an undergrad composer, but I would like to know what in particular you were looking for in musicology? Here in the U.S I don't think it is as common a career for musicians."}, {"comment_id": "esmtlb8", "post_id": "c8bq96", "comment": "I wrote up a long response to a similar question in this subreddit a few months ago, which you can find [here](https://www.reddit.com/r/musicology/comments/b2rmd6/graduate_school/eiwa7ro/)."}, {"comment_id": "esneoq7", "post_id": "c8bq96", "comment": "I graduated with a MA in Musicology.\n\nI work as an English teacher now. You get the idea..\n\nA MA degree can still help you find jobs in other fields, and you should also approach it with that attitude. I love my current job and I don't have it bad at all, but I didn't do anything with musicology for a long time.\n\nAlso, if I could travel back in time, I would have studied something else. Something that would have offered me better job prospects.\n\nAs for jobs for musicologists, besides teaching and researching, there are jobs available at concert halls, museums and libraries. It's really hard to land a job like that, though.\n\nGood luck with making a decision."}, {"comment_id": "f4c8roc", "post_id": "c8bq96", "comment": "There are plenty of jobs outside of academia, but you have to expand your focus. Copyright law, audiovisual preservation, music director, editor, journalistic archivist, conservator, librarian, appraiser, textbook edited/writer/fact-checker are definitely some off the top of my head"}, {"comment_id": "esm4ap4", "post_id": "c8bq96", "comment": "Why would people pay you for an interesting side hobby, which any educated person could pick up on their own?"}, {"comment_id": "e5mx6t9", "post_id": "9e7pis", "comment": "This might not be obvious to anyone who has never studied voice, but when you sing with a classical technique, one that's focused on producing a loud and connected (legato) melodic line while reducing strain and injury (e.g. for an opera singer who sings in hours-long performances night after night to an entire concert hall without any amplification), vibrato is usually a natural side effect.  By that, I mean that a base-line amount of vibrato (or spin, as it's also called) is produced without any explicit intention.  The vocalist singing with vibrato isn't intentionally modulating the pitch like when a violinist wiggles his finger.  The vocalist's intention is to sing a specific pitch, but the technique results in a vibrato such that the voice can comfortably and consistently maintain a pitch center without strain.  That said, singers can modify or even remove the vibrato, but (at least for me) that takes more work than allowing my voice to produce it's natural spin.  (This is specific to singing in a classical context of course.  If I'm just singing quietly to myself or if I'm singing into a mic, I might not always employ the classical technique, and thus might not produce that natural vibrato.)\n\n&#x200B;\n\nIt's hard to really explain without teaching you that singing technique and allowing it to just \"happen\" so you can feel it.  But the point is that, unlike for instruments, vibrato is a natural characteristic of the voice when sung that way, not an explicit coloration.  Therefore, I'd bet my money that vibrato in instruments came from imitating expressive use of natural vibrato of the voice."}, {"comment_id": "e5mr8j8", "post_id": "9e7pis", "comment": "After having found my own post from 3 years ago, and the answers from that time showing vibrato was a decoration from renaissance times, is this when it originated? Or just when it was written down? Can we know more than that?"}, {"comment_id": "e5my2v3", "post_id": "9e7pis", "comment": "Ok, my brother is an audio engineer so wanted to make sure I wasn’t misunderstanding your use of the term “standing waves”. So you mean using vibrato to soften the frequency boost from standing waves?"}, {"comment_id": "e5mvicp", "post_id": "9e7pis", "comment": "I heard a theory that continuous vibrato started with the advent of recording, early 20th century. In order for the soloist to stand out, you had to “shake” you voice, otherwise it blended into the recording. \n\nIf you listen to very old recordings of opera singers, like the  1902 recording of Moreschi the castrato, you do not hear obvious and continuous vibrato."}, {"comment_id": "e14e1gf", "post_id": "8sx752", "comment": "It'd be interesting to discuss what consonance and dissonance actually mean. When you listen to Perotin or Leonin, where 4ths and 5ths are consonants, but major 3rds sound dissonant, it kind of makes you readjust your worldview."}, {"comment_id": "e13ld0t", "post_id": "8sx752", "comment": "'Nurture' is responsible for the varied application of sound/noise but something like the overtone series definitely influence our choices regarding harmony. There are many other physical explanations regarding sound itself which can explain regional distinctions in musical expression. "}, {"comment_id": "e1kpgux", "post_id": "8sx752", "comment": "It is dependent on the overtone series generated by striking a note. Some harmonic overtones are dissonant in relation to the fundamental. For example when you sound a C note (on any instrument) though the first six overtones are consonant the seventh is a B flat and at higher overtones (which though very faint are present) you end up at F sharp. It is the basis for modulation. Here is a link to the Wiki on the Harmonic Series and notice how the \"chord of nature\" (Pythagorean Comma) gets a bit wonky on the tuning:\n\n[https://en.wikipedia.org/wiki/Harmonic\\_series\\_(music)](https://en.wikipedia.org/wiki/Harmonic_series_(music))\n\nThe role nurture plays is cultural. It is the reason that even music from the recent past loses relevance. So Be-Bop, Stravinsky, and Debussy were shockingly dissonant and new. At the Stravinsky premiere of The Rite of Spring arguments broke out between members of the audience. The history of music is the history of culture cloaked under musical practices. I always say Mozart wrote Italian operas - just to make sure our Italian friends get the full credit they deserve for what is truly their art form.\n\nAs for using different tuning systems or other musical practices from other cultures. Well it didn't do Mozart any harm and Debussy was influenced by the Gamelan orchestra that he saw at the Paris Exposition. Terry Riley does Indian influenced electronica and Steve Reich actually went to Africa to study poly-rhythms.\n\nNature or nurture? Both but nature is not our creation and the \"chord of nature\" is a universal so is not dependent on our explaining it for it to exist. Equal-Temperament is our very human compromise and took a few thousand years to work out from when Pythagoras first messed around with his mono-chord.\n\nNote that Equal-Temperament is actually displacing traditional musical tuning practices around the world. I think there have been studies on it. Technology is probably the reason.\n\nregards\n\nRichard"}, {"comment_id": "e4jsddx", "post_id": "8sx752", "comment": "By traditional theory, it was basically depend on nature - because of the existence of overtone series, scholars deemed that intervals in overtone series e.g. octave, fifths etc. would be more harmonised.\n\nBut you could also check out this academic paper:  McDermott, J.H., Schultz, A.F., Undurraga, E.A. and Godoy, R.A., 2016. Indifference to dissonance in native Amazonians reveals cultural variation in music perception. Nature, 535(7613), p.547.  (available at: [https://www.nature.com/articles/nature18635](https://www.nature.com/articles/nature18635))\n\nThis not-so-new research published on Nature, which took acoustic experiment on Amazonian remote villages, has revealed that - culture may have a dominant role in shaping music aesthetics, rather than numerical ratio or other scientific principles. To use dummy's words - Audiences regard something \"consonant\" simply because they \"get used to it\".\n\nIf the result is reliable, we might have another path to explain several acoustic phenomena: octaves & fifths are consonant due to they come with overtones of string & tube vibration; simple sin-wave produced from tuning folks is not widely appreciated just because it's not sound from nature that our ancestors could \"get used to\" - despite it's the \"purest\" tone from musical theory... etc.\n\nSo: I think nurture plays the dominant role."}, {"comment_id": "dtpuuwr", "post_id": "7v35ma", "comment": "[deleted]"}, {"comment_id": "dtq1rsp", "post_id": "7v35ma", "comment": "A good place to start would be the Cambridge composer companion books. I think they all date from the 2000s and each chapter is written by a different author on a different aspect, basically like a journal article. As far as I understand they represent some of the latest scholarship.\n\nI'm big into Debussy and there's lots of newish stuff about him. There have been some outstanding analyses of his songs recently, and Roy Howat's The Art of French Piano Music is excellent.\n\nOne of my favorite articles I read was published by Cambridge I think and it was about narrative models in Mahler and connections to Dostoevsky, Proust, and Musil."}, {"comment_id": "dtp8hof", "post_id": "7v35ma", "comment": "Good question!\n\nI couldn't tell you yet, having not progressed far enough in my own historical musicology studies, but I think \"Musicking\" by Christopher Small was pretty big. At least, I often see references to it in the academic lit. that i'm reading now (much of which isn't even geared specifically toward musicology!)\n\nAlso, maybe it's a bit in left field, but Thomas Piketty's \"Capital in the 21st Century\" was touted as hugely influential by the chair of my own musicology dep.!"}, {"comment_id": "dfr9b68", "post_id": "62zf8l", "comment": "Rockstar composers is not really so much a thing until the Beethoven era. Before then, it's mostly singers that achieve Rockstar status. \n\nI do think that one-hit wonders is in some ways more difficult in this time period, mostly because you have to have had a *several* successes in order for your name to start generating buzz. Like before JC Bach went to London, he wrote 3 operas for some of the biggest stages in Italy. So it took him three hits to really make a name for himself. \n\nThat said, I'd put forth Thomas Arne, at least in the field of opera. He wrote one called Artaxerxes that was decently received (though possibly as a novelty just because it was serious opera in English), but many of his other operas generated zero buzz at all.  "}, {"comment_id": "dlipdde", "post_id": "62zf8l", "comment": "I agree with someone saying singers were the equivalent to a rock star today, perhaps the first to reach such popularity ,for people to even travel in order to see a castrato sing. Later on some composer performers such a Liszt and later Paganini.  I am sure at the time they had to be many one hits wonders which eventually were completely were forgotten.  Excellent topic for some research. Some composers were so famous in they life time yet were soon  forgotten , and their music silence. That is the case of Vivaldi for it is only recently, after a recording of the Four Seasons, around the fifties, don't remember the exact date, that  we started to listen and perform his music again. There must be some, probably Operas, Operetta,  the audience has always favour some how singers, and waited with great anticipation the new work of a composer. Verdi had such a gift for melody he would forbid some arias or choruses to be rehearse for fear of listening the day after the tune played by a street performer before the Opera debut. Fascinating. People back  were constantly looking for new works. So  there must be plenty one hit wonders.  "}, {"comment_id": "dfqhpo5", "post_id": "62zf8l", "comment": "Makes me think of composers who have an Opus I, but nothing else.\n\nPerhaps François Zappa?\n\n**edit** an actual 18th century french composer. This is not a burn on the excellent Frank Zappa, whose compositions and performances I adore."}, {"comment_id": "di1oec0", "post_id": "62zf8l", "comment": "I'm late but... John Dowland?"}, {"comment_id": "dbbm782", "post_id": "5isug8", "comment": "Good stuff"}, {"comment_id": "dbgi8ds", "post_id": "5isug8", "comment": "Disco Sucks!"}, {"comment_id": "dakpceq", "post_id": "5ffg7u", "comment": "Well hello, friend!"}, {"comment_id": "d53h74z", "post_id": "4rqwfw", "comment": "GIMME\n"}, {"comment_id": "d561yei", "post_id": "4rqwfw", "comment": "A lot of libraries charge for copies of their holdings to be made and have some reproduction / publication clauses that you have to I agree to. I've always been curious about what that means for uploads from these institutions to IMSLP"}, {"comment_id": "d55uefq", "post_id": "4rqwfw", "comment": "If these are actual fac-simile reproductions from 17th-18th c. originals (*not* mere copies/new editions of the music! Unless you copied the music yourself, of course), they're most likely in the public domain and you should upload them to [IMSLP](http://www.imslp.org)."}, {"comment_id": "cx32osf", "post_id": "3t2ucy", "comment": "I know about Shostokovich's relations with the Communist Party only from Wikipedia, maybe you can find more sources: \n\nhttps://en.wikipedia.org/wiki/Dmitri_Shostakovich#Joining_the_Party"}, {"comment_id": "cx3qxfl", "post_id": "3t2ucy", "comment": "There's a book out there about the relationship between Shostakovich and Stalin.\nhttp://www.amazon.com/Shostakovich-Stalin-Extraordinary-Relationship-Composer/dp/0375410821"}, {"comment_id": "cx2r2se", "post_id": "3t2ucy", "comment": "Quite a lot of articles around on Socialist Realism.\n\nThis one provides a reasonable overview http://www.ce-review.org/01/16/reyland16.html"}, {"comment_id": "exv9dh6", "post_id": "cuajux", "comment": "Xenakis isn't my area of expertise, but I can at least comment on some thoughts I have on your question.\n\nOne needs to consider Xenakis in his entirety – he is a mathematician, an architect, a man of Greece, with half of his face blinded and shredded in protests, living as a young man through WWII, with his mother (who introduced him to music) dying and scarring him emotionally. \n\nHis utilization of mathematics in architecture and music are notably beautiful and unique, and especially forward thinking. Just look at The Philips Pavilion which he designed in '58 (I think). He was almost a part of the legendary Nadia Boulanger school, but ultimately unable to study with her and other teachers at the time who looked down on his particular methods of music (Wikipedia notes \"As Xenakis recounted in a 1987 interview, Honegger dismissed a piece which included parallel fifths and octaves as 'not music'\"). \n\nMessaien describes it well noting that \"I understood straight away that he was not someone like the others. [...] He is of superior intelligence. [...] I did something horrible which I should do with no other student, for I think one should study harmony and counterpoint. But this was a man so much out of the ordinary that I said... No, you are almost thirty, you have the good fortune of being Greek, of being an architect and having studied special mathematics. Take advantage of these things. Do them in your music.\" (again cited from Wikipedia). \n\nThis is a musician who possesses an understanding of music that is so out of line with the history and theoretical understanding that even the avant-garde cats are distinct from him. Schoenberg notes that he saw his methodology of tone row compositions as finishing what Bach had started (in reference to thematic transfiguration, fragmentation, and alteration). Reich falls into obsession with phasing to obscenely precise levels. Even Messaien's modes of limited transposition are analyses within symmetric scalar constructions. As much math and set theory is implemented into these theories, the roots are music. Xenakis flips this, rooting his works in architecture and mathematics, applying it to music. \n\nIn the same way that an engineer constructs a bridge, Xenakis constructs his works, independent from constraints of traditional notation, 12TET restrictions, or even influences of counterpoint rules, or harmonic trends over the last 2000 years. A lot of people note the distinction of the French, Italian, and particularly Germanic schools of music leading out of the 19th and into the 20th century of composition. Xenakis is independent of those as a result of his unique background and approach and personal history. Schoenberg \"emancipated the dissonance\" in the 20th century, but did Xenakis even care about consonance and dissonance? His structural and (having not studied in depth, I take a leap at potentially using this term wrong) stochastic music is not contingent on the same things that people are used to listening for.\n\nI've been meaning to read Xenakis's Book \"Formalized Music Thought and Mathematics in Composition\" for some time, so this quote is a bit out of context, but Xenakis notes his basic temporary hypothesis (lemma) of Markovian Stochastic music theory saying that:\n\n\"All sound is an integration of grains, of elementary sonic particles, of sonic quanta. Each of these elementary grains has a threefold nature: duration, frequency, and intensity. All sound, even all continuous sonic variation, is conceived as an assemblage of a large number of elementary grains adequately disposed in time. So every sonic complex can be analyzed as a series of pure sinusoidal sounds even if the variations of these sinusoidal sounds are infinitely close, short, and complex. In the attack, body, and decline of a complex sound, thousands of pure sounds appear in a more or less short interval of time, ∆t. Hecatombs of pure sounds are necessary for\nthe creation of a complex sound. A complex sound may be imagined as a multi-colored firework in which each point of light appears and instantaneously disappears against a black sky. But in this firework there would be such a quantity of points oflight organized in such a way that their rapid and teeming succession would create forms and spirals, slowly unfolding, or conversely, brief explosions setting the whole sky aflame. A line of light would be created by a sufficiently large multitude of points appearing and disappearing instantaneously.\"\n\nHe's not finding clever alterations or interpretations of V-I , he's delicately making an aural structure.\n\nTo engage with this unique viewpoint of music, you need sympathy, and focus, and engagement, because this is a man with a painful life, composing music with methods far distinct from anyone else, that has an independence from conceptions of tonal music that previous and contemporary composers did not strive for. \n\nBut, hey these are just random thoughts, so take everything I said with a grain of salt."}, {"comment_id": "ekxai0u", "post_id": "9y194g", "comment": "The basso continuo is also clear testament to the role improvisation played in Western music until quite recently.  The keyboardist in this section of a Baroque orchestra was expected to improvise over the figured bass."}, {"comment_id": "e6v8wig", "post_id": "9jygyn", "comment": "I think this book by Roger Matthew Grant is pretty much exactly what you’re looking for. “Beating Time and Measuring Music in the Early Modern Era” \nhttps://global.oup.com/academic/product/beating-time-and-measuring-music-in-the-early-modern-era-9780199367283?cc=us&lang=en&#\n\nAlso, Ruth DeFord is a specialist in this area, and has a book on rhythm in early music, albeit somewhat earlier than what you’re talking about https://www.amazon.com/Tactus-Mensuration-Rhythm-Renaissance-Music/dp/1107064724 "}, {"comment_id": "e6vk98h", "post_id": "9jygyn", "comment": "http://www.earlymusicsources.com"}, {"comment_id": "e6sdjhj", "post_id": "9jjw1b", "comment": "I sometimes get musical hallucinations while im falling asleep. Its hard to explain, but basically im half asleep half awake and I hear all sorts of stuff. Sometimes its music, sometimes its trains or cars moving. Very weird. As far as on psycho actives, Ive never experienced any auditory hallucinations."}, {"comment_id": "e6t4zxb", "post_id": "9jjw1b", "comment": "How are you getting around the issue of the unreliable informant?"}, {"comment_id": "e6t0pv3", "post_id": "9jjw1b", "comment": "Does white noise count? I thought I was just smoking pot, but maybe something else was in it, because I started hearing white noise. I thought there was a loud stereo tuned to no station. I went for a walk and the sound followed me. It didn't completely go away until about a week later! Not pleasant. "}, {"comment_id": "e6t7rml", "post_id": "9jjw1b", "comment": "First time I smoked pot I heard a very strange song that every sound was made to fit into. I even tried to make sounds that would be out of place to no avail."}, {"comment_id": "e6tse2w", "post_id": "9jjw1b", "comment": "I don’t ever hallucinate musical ideas, although I do have a kind of constant music that is always playing in my head if I focus on it. The biggest things that I notice when I take psychedelics are additional harmonics/ overtones in almost any sound. I’m normally very adept at tuning my guitar by ear, and I’ve got pretty strong relative pitch (not perfect though.) When I try to tune my guitar by ear on LSD or mushrooms however, I find that there are “additional” frequencies that just don’t make sense to my ear, and I usually end up needing to use a tuner. "}, {"comment_id": "e6u0122", "post_id": "9jjw1b", "comment": "When I'm on ketamine I feel as if I can compose electronic music and see it with my eyes closed. I've also had auditory hallucinations while in a sensory deprivation chamber but I wouldn't describe them as music per se. "}, {"comment_id": "e8g9lvx", "post_id": "9jjw1b", "comment": "I consider myself to be pretty musical. I love music and just sound in general, and am a multi instrumentalist. Also a lover of psychedelics and an even bigger lover of combining the two lol. One time while on LSD, I remember standing in the living room of my rather shitty duplex, and the buzz of my light, sound of my A/C unit, and various other noises (wind, cars outside etc) combined to form a very tangible harmony. It was a very emotional personal experience, to be honest. It was as though I could hear all these different elements create a harmony that was greater than just the sum of their individual \"parts.\" Something that I have not experienced sober."}, {"comment_id": "ebt1nob", "post_id": "9jjw1b", "comment": "Every time I take them I do. And I’m well experienced. This is one of the reasons I’ve started to develop my musical abilities. I’ve also noticed an extreme difference in how I play certain instruments while on psychedelic substances. I’m much better and can almost predict what my guitarist will play next when I’m on drums for example, and simultaneously switch up the vibe of the song while we are simply improv-ing the entire thing.  It’s a strange sensation and I love it. "}, {"comment_id": "dotsr4k", "post_id": "78h8ts", "comment": "The answer is really \"sort of\". Tempo is a big issue as before the invention of the metronome (and there are even some issues with that), we have no concrete idea how fast things were played. Tuning is another problem as we don't have any measurable way of determining how \"in tune\" the instruments were. Modern instruments are built to far more exact specifications and we use technology (not to mention a universal pitch standard) to get them in tune. Prior to the Renaissance we don't have much in the way of written musical instruction so when translating things like ornamentation and other performance practices we're sort of guessing at how things would work, and there's always going to be an element of modern bias in the interpretation. Oral tradition, such as that found in folk music and some church music, is a good indicator but over hundreds of years one has to assume that *something* has changed."}, {"comment_id": "douarw5", "post_id": "78h8ts", "comment": "If you’d like to read more on the topic, ‘historically informed performance’ comes closest as a field to your question. It’s been a fairly hotly contested issue in performance studies generally since the mid- to late-twentieth century, so there’s certainly been a lot said on the issue. I’m not aware of much that deals with folk or vernacular traditions specifically, but historical playing manuals would probably be the bread and butter of trying to reconstruct a historical performance tradition if you could find any.\n\nOne thing to be very wary of with folk traditions is the vogue during the nineteenth century for ‘collecting’ folk music and the loss of regional variety that this arguably lead to with its national focus on authoritative versions etc., so even the parts themselves might be a bit suspect. There have been a lot of accusation of this sort since around the 1970s around Cecil Sharp and his collecting of English folk song and dance tunes in the early twentieth century. Again, I’m not sure about the traditions of your specific focus in this respect, but you’ll want to consider trends in ethnography with these traditions/whether they were ‘revived’ at some point under nationalist motivations/how and when any collecting of the music happened, etc.\n\nIn short, yes there are certainly ways of approaching this and yes a lot has been written on the challenges of doing so. In the end it boils down to a lot of detective work and often quite a lot of healthy speculation that for some renders the whole task irredeemably suspect in the first place."}, {"comment_id": "dk24zq9", "post_id": "6mgvin", "comment": "Nice post, don't get the 1940s comment though "}, {"comment_id": "dliomcr", "post_id": "6e1tzw", "comment": "Lovely! Than you for posting this."}, {"comment_id": "cxfyjbg", "post_id": "3um32t", "comment": "I completely understand where you're coming from. I to am in a musicology Master's program and I'm completely burned out. Research within itself takes time and conversations with other individuals about it are finite for the most part. I'm at a point right now where burn out has become the pinnacle of my last year. My advice. Breathe and take each moment one at a time. It's exhausting feeling like you're only contributing to small bubble of a very concentrated area. I can understand your pain and know you are not alone. You're only limited by your view. The only way to get through is to keep going. Finish your degree. Take some time off and think if this is what you want, but by the sound of it, it sounds as if you already made your decision. Sorry, this is sort of everywhere, hope it helps. Cheers! "}, {"comment_id": "cxg70r4", "post_id": "3um32t", "comment": "To answer your question about where these conversations are happening, look into public musicology and digital humanities related to musicology.\n\n\nI know the feeling you have, too (I'm only now finding my dissertation question come into focus). One way I've learned to stay optimistic or grounded or whatever you want to call it is to make a point of going to concerts and writing reviews. Even if probably only my mom and two other people read them, it helps me to get out of the stacks and remember that, first of all, music can still be an enjoyable thing to experience, and that it has a communal aspect. I'm not sure if you perform still, but making music also helps a lot of people get out of being mentally buried in reading and academic writing. I talked to Ellen Harris some time ago and she said that everyone should perform music, alone or in a group. It helps keep things clear and in focus, she said. Take it for what you will, but maybe if that's something that's missing, you could try it. "}, {"comment_id": "cz0uwl9", "post_id": "3um32t", "comment": "What's the point of going to school to be a musicologist?  What job could you possibly get with that degree?  I just love music..."}, {"comment_id": "d0h925l", "post_id": "3um32t", "comment": "I'm really late to the party but I saw something that could be of interest to you. I saw a production of King Arthur put on by the early music department at Boston University. There was a 20 minute lecture beforehand from a musicologist from NEC. He was an excellent speaker and presented interesting information that allowed everyone in the audience, musically trained or not, to enjoy the performance from a more informed perspective.\n\nI believe that a musicologist's responsibility beyond research, is education. Disseminate what you learn to others. Emulate Neil Degrasse Tyson and Bill Nye and Carl Sagan who have all broken the bubble of research science. I think it's very easy to do. Contact performing groups in your area, colleges, independent ensembles, etc., and offer to a open their programs with a brief lecture on the program.\n\nA body of research is useless if no one is learning from it."}, {"comment_id": "cwxjjvq", "post_id": "3sin7j", "comment": "Thanks for posting this. I have recently been investigating the similarities and differences between ragas (and maqam and dromoi) and \"western\" music for my own benefit. Looks like an interesting blog."}, {"comment_id": "ciegn75", "post_id": "28sqvd", "comment": "If opera counts, I'm planning on writing my master's thesis this year on the history of the opera ensemble and Mozart's innovations in the genre."}, {"comment_id": "cievqc5", "post_id": "28sqvd", "comment": "I presented a paper at a conference last year on Samuel Barber's chamber opera, A Hand of Bridge. I didn't really deal with the theater aspect that much, but it was relevant. Mostly I talked about how the piece is a representation of Americanism through pastiche, that is a sort of more sincere version of parody. Barber is known for not writing prototypically Americanist music, except for selective exceptions, AHOB being one. (I also talked about his piano pieces, Excursions, which do a similar thing.) Fun piece, you should all check it out if you don't know it at all. "}, {"comment_id": "cieijal", "post_id": "28sqvd", "comment": "Your paper on *Porgy and Bess* sounds really interesting. I'm only just starting to study musicology, and I'm not too familiar with theater musicology - were you looking at Gershwin's interpretation of African-American music along with Heyward's libretto, and that sort of thing?"}, {"comment_id": "cix12ey", "post_id": "28sqvd", "comment": "Since we're counting opera, I'm in the planning stages of an undergraduate research project on gender in 19th century German opera and preparing materials for a dual-capstone written auf Deutsch on Mozart's portrayal of women in Die Zauberflöte (Possibly also Cosi fan tutti, I like the 3 woman dynamic seen in both shows)."}, {"comment_id": "cackd85", "post_id": "1fnje8", "comment": "yeah, it looks like Orlando is trying to moonwalk while he leans on his writing desk...\n\nhttp://img.cliparto.com/pic/xl/201601/3380411-michael-jackson-memorial-in-munich.jpg"}, {"comment_id": "ezdwdmb", "post_id": "d0p6d2", "comment": "I’m curious: do all the bass players *actually* “know” about your research findings and contributions in gesture and performance? Or do they only *think* they know? Are you providing empirical evidence for an otherwise taken-for-granted phenomenon? Is there a way you can present their import that hasn’t been done before? Can you do a case study with a particular piece or direct comparison?\n\nOr, with different emphasis: does *everyone*—from amateur to professional bassist—know about the contributions you are making? \n\nCan you shift the target audience a bit, or imagine a broader one? If this is something all bass players “know” but maybe those of us that don’t play bass do not (but should), could you consider publishing for a more general audience?"}, {"comment_id": "ezgtyur", "post_id": "d0p6d2", "comment": "This happens *all the time* when writing an article. My colleagues in STEM sometimes have it worse-- imagine going through months of experimentation and then getting a null result! That said, often times big strides in research are made by investigating things that \"everybody knows already\" and thus nobody has thought to ask *why*, or even *whether* the conventional wisdom is true. \n\nOne problem might be that \"how the player and audience experience music\" is actually an extremely broad question. Push on that point a bit. What kind of experience? Physical, emotional, aural, visual, performative? How might you quantify or measure the kind of experience you're looking for? What implications might this have for a bass player who's thinking about trying Specific Tuning X? Will the audience even notice a difference, or is an A3 just an A3?\n\nOr tune the question on its head: Why does the \"normal\" tuning have to be the default one?"}, {"comment_id": "ezhs76w", "post_id": "d0p6d2", "comment": "Also, though, I don’t mean to dissuade you from your method. If empirical is not your bag, then you might find plenty of other ways to translate your work, and/or to different audiences. I’m still figuring this out for different audiences, too."}, {"comment_id": "f4b8jgx", "post_id": "cxewaz", "comment": "Did you ever get an answer?"}, {"comment_id": "ea1u9yn", "post_id": "9yg391", "comment": "Sorry, don't want to be a wet blanket, but this thing is a mess. 'Rap' and 'Hip Hop' as separate genres? What?\n\nEdit: Why is 'British Invasion' marked as influencing 'Soul'?? Whut?\n\nWhy is 'Heavy Metal' coming from a vacuum ?"}, {"comment_id": "ea13rmh", "post_id": "9yg391", "comment": "Pretty great.  I do wish David Bowie would be recognized as a huge influence on New Wave, in particular his Low/Heroes era (~'77) collaborations with Brian Eno.  That contributed more to the synth-pop aspects and less with rock, so I do understand why it might not be prominent here.  "}, {"comment_id": "ea2q4f1", "post_id": "9yg391", "comment": "It looks like they gave up trying to figure it out when they got close to the right margin of the page. Heavy Metal comes out of nowhere, the placement of artists in New Wave/Punk/80s/Pop Rock seems really arbitrary, and did nothing happen in the past 30 years?!?!\n\nLots could be fixed with a bigger sheet of paper."}, {"comment_id": "ea1cjxs", "post_id": "9yg391", "comment": "Lol isn’t this just the blackboard from school of rock"}, {"comment_id": "ea14wck", "post_id": "9yg391", "comment": "How come the arrows in Heavy Metal are inverted?"}, {"comment_id": "ea25cvz", "post_id": "9yg391", "comment": "Really fun chart. I’d love to see electrónica on the chart with Kraftwerk influencing rap & hip-hop. "}, {"comment_id": "ea2ffcj", "post_id": "9yg391", "comment": "I don't like this"}, {"comment_id": "ea38b10", "post_id": "9yg391", "comment": "I'm not sure why \"Rock\" got to be overarching category here? Isn't this supreme rockism/revisionism? "}, {"comment_id": "ea3ea0m", "post_id": "9yg391", "comment": "If you like this you'll love this: [https://www.concerthotels.com/100-years-of-rock/](https://www.concerthotels.com/100-years-of-rock/) its even more comprehensive and each genre includes a sample music clip"}, {"comment_id": "ekxar33", "post_id": "9xoor7", "comment": "The Brahms/Wagner camps of the latter 19th century saw some of the most bitter musical critiques in Europe.  And often, it was not the composers themselves who hurled journalistic napalm at one another, but the literary critics who put themselves solidly in someone's camp.  Brahms, for example, was very reserved about public critique, but he had no problem with Eduard Hanslick taking up the task for him!"}, {"comment_id": "e9tymxa", "post_id": "9xoor7", "comment": "[deleted]"}, {"comment_id": "e9u1uyb", "post_id": "9xoor7", "comment": "[deleted]"}, {"comment_id": "e9kekz1", "post_id": "9wgbie", "comment": ">I am a music major (bachelors) who spends far too much time researching things outside my degree than I ought to. \n\nNonsense. As long as you're getting your classwork done, spending time outside your discipline is good. It's how most important scholars make their marks. The term you're missing is \"interdisciplinarity.\"\n\nA currently hot trend in music studies (more theory than -ology, but all the same) is metaphor theory, which is based largely on linguistics. Lawrence Zbikowski is a big name in music for this. People use [Lakoff and Johnson](https://www.press.uchicago.edu/ucp/books/book/chicago/M/bo3637992.html) a lot as a primer in this, and their thesis is essentially what you're saying, that metaphor/language does directly influence how we think and act.\n\nLinguistic concepts have been applied extensively in music studies, successfully or [not](https://www.youtube.com/watch?v=r_fxB6yrDVo). Musical semiotics is founded on semiotics generally, which is more or less (mostly more) based on linguistics alla Saussure and Russian formalists. I work on genre quite a bit and a huge part of genre theory in all disciplines is based on linguistics, particularly morphology.\n\n>Something that made me curious was whether or not the type of music a musician plays or listens to also influences the way they think- perhaps about music in general or a deeper fundamental cognitive process.\n\nI'm not sure, but it's possible, and likely shapes the way you think about music, at least. Interesting question, though.\n\nThere's too much in this area to talk about here, but suffice it to say, if this interests you, you've got a wealth of literature to dig into and learn from."}, {"comment_id": "e9krwos", "post_id": "9wgbie", "comment": "Im interested in the overlap between language as well, but within the specific context of improvisation in the traditional music of the Middle East and India. whats fascinating to me is that both speech and music are (well, can be) both \"improvised\", in that once you learn the basic rules you communicate ideas at the speed in which they form in your mind, the advancement of which is what we call 'proficiency'. \n\nIf you're interested in that, give this a read, and feel free to ask me about anything!\n\nhttp://kimiahonar.ir/article-1-251-en.html"}, {"comment_id": "e9ktvnd", "post_id": "9wgbie", "comment": "I recommend Feld’s Linguistic Models in Ethnomusicology: https://www.scribd.com/document/139685717/Steven-Feld-1974-Linguistic-Models-in-Ethnomusicology"}, {"comment_id": "e9l36fq", "post_id": "9wgbie", "comment": "Nattiez is a good place to start for semiotics. Music as discourse, he gives a good presentation of the field as well."}, {"comment_id": "e9lm73g", "post_id": "9wgbie", "comment": "I want to point out that the majority of credible linguists in academia today either completely discredit Sapir-Whorf, or at least consider it true in only very small, specific ways that can’t be abstracted to a larger context. Also, although “music as a language” might be a helpful metaphor in some contexts, it’s important to note that music and language are largely not overlapping fields other than in a very broad sense (they’re both used for human communication, but on a very different psychological and social level). \n\nThat’s not to say that there aren’t linguistics models that could be applied to music studies and vice versa, but I would say it’s also important not to get too caught up in the minutiae - linguistics and music are very different academic disciplines. \n\nThat said - should we invest more energy in studying music outside of a western art music paradigm? Absolutely. Should we think outside of the box in terms of how we define and classify music? Of course. There are lots of things music studies as a whole could learn from the social sciences and other academic disciplines, and I think we are seeing some trends in the direction of interdisciplinary studies and use of techniques and methods from diverse fields to approach problems within music studies, and I think that’s a good thing. "}, {"comment_id": "e9ln8vm", "post_id": "9wgbie", "comment": "There are some scholars who are examining the link between modern theories of generative grammar and music. I took a course on this exact topic in grad school; the professor wrote his dissertation on the topic. Here’s a link if you’re interested:\n\nhttps://dataspace.princeton.edu/jspui/handle/88435/dsp01js956j03v\n\nBernstein made the question popular with his lectures, but he misapplied a lot of Chomsky’s work, and most later scholars found his work flawed. With that said, Chomsky and his disciples are now advocating for a minimalist model of generative grammar, and there is definitely merit in re-examining the connection between language and music."}, {"comment_id": "e9m9q3b", "post_id": "9wgbie", "comment": "This is a fascinating subject and impossible not to make any connection between music and language. For the most part, language and music are both aural events (I say for the most part because I am a teacher of the deaf) I studied speech pathology and audiology for my undergraduate degree so you can imagine there was a lot of Chomsky. Sapir-whorf or linguistic relativity fell out of favor because of 1969 studies about color but this has been disputed by relativist researchers (paraphrased from Wikipedia on sapir-whorf) Whether or not it fell out of favor, we were taught a lot about it and that was 1973-77. I remember being fascinated with this idea. I have always loved travel and languages and believe that the language we use shapes our perception and or vice versa. Language is dynamic and always evolving. And so is music. I would go as far as to say music is a language and how could the music we know not shape our perception. It is hard to write about these things. Better for an in person discussion but I was excited by the post and want to support that learning all you can about whatever the connections you see, feel and of course hear can only make your ideas stronger. It may drive you somewhat mad in the process but what the hell! Very thoughtful people on this sub!\n "}, {"comment_id": "e9bpkk4", "post_id": "9vcv8s", "comment": "Holy smokes, too many good papers to choose from (and a few not-so-good, as always)! \n\nI really enjoyed the 20-minute paper format. I still got tired, but not as quickly!\n\nAMSAD is my favorite event of the year, bar none. Yay nerds!"}, {"comment_id": "e9bumqg", "post_id": "9vcv8s", "comment": "I heard a few really awesome papers, but I think from this conference I’ll remember the “Contesting European Music” panel on Friday afternoon:\n\nhttps://i.imgur.com/oBSdz7F.jpg\n\nAll really good papers with interesting topics. Bomberger’s paper was insane, though, about the 100% American fad around Muck’s ouster and deportation that has been covered a million times, but Bomberger talked about how one of the key players turned out to be a repatriated expat who was trying to rid the country of Germans in WWI, and started a shell company, basically, in the form of a music journal with super limited distribution. It’ll be a part of his upcoming book and I can’t wait to read it.\n\nHambridge’s paper was just awesome to me because it’s pretty much directly applicable to my research. Her paper was more or less on what popular culture was and meant around the turn of the 19th c. She’s a phenomenal scholar and I love her work. Trying to get through my reading enough to get to her edited volume on melodrama soon."}, {"comment_id": "e9hjquv", "post_id": "9vcv8s", "comment": "My favorite paper was Julianne Grasso's paper on affect in the music of *Super Mario World.*  The way she described musical meaning in space -- that we understand the space differently when the music is double tempo -- was good, but the close of the paper was brilliant.  She reminded us all that today, the notion of \"running out of time\" has a whole different meaning as adults, and that moments of gaming without responsibility are ever fleeting, things to be treasured."}, {"comment_id": "ebykrp5", "post_id": "9vcv8s", "comment": "Yes! It was my first one and it was awesome. There were so many excellent papers, but one of my favorites was the keynote address with the women for the Smithsonian, and the women musicologists "}, {"comment_id": "e7ul33c", "post_id": "9ojbm0", "comment": "I don't think evolutionary musicology is a field in itself, but there is some work done among neuroscientists about how music affects our brains. Otherwise, systematic musicology is the most scientific of the standard branches of musicology."}, {"comment_id": "e7weov2", "post_id": "9ojbm0", "comment": "There are a number of theorists looking at it. See David Huron’s article “Is music an evolutionary adaptation?” for a summary of the classic takes on it. \n\nMusic Cognition also seems adjacent to your interests. Have a look at the work being done at Ohio State and Northwestern. "}, {"comment_id": "e7dqmm5", "post_id": "9i7v1u", "comment": "you should prolly have direct linked your directly relevant comments (or just c/p'd them into your OP, because you'd probably have gotten some other replies that way) instead of the entire comment chain, took me some scrolling to find the ones that weren't just banter:\n\nhttps://www.reddit.com/r/AnimalsBeingJerks/comments/9h2er7/there_you_go/e68xdb9/\n\nhttps://www.reddit.com/r/AnimalsBeingJerks/comments/9h2er7/there_you_go/e68w76v/\n\nhttps://www.reddit.com/r/AnimalsBeingJerks/comments/9h2er7/there_you_go/e68yefu/\n\nalso, did you stop procrastinating yet? because I'm waiting to read your thesis... ^because ^it ^actually ^sounds ^very ^interesting ^and ^i ^know ^nothing ^about ^it"}, {"comment_id": "e920njy", "post_id": "9i7v1u", "comment": "I'm interested in reading it if theres a link "}, {"comment_id": "e0yagka", "post_id": "8sch06", "comment": "You might also want to consult the first video in the series Phillip Tagg made on this subject: [https://www.youtube.com/watch?v=bbzPGLVAD4Y&t=](https://www.youtube.com/watch?v=bbzPGLVAD4Y&t=) However this mainly entails analysis of the visuals onto which the music is projected. (And results in hearing the Kojak theme many, many times) \n\nEDIT: Maybe late, but in rethinking I though perhaps this stand-alone video is not enough context, as it was made for a course, cearly. \n\nBy museme Tagg means \"minimal unit of musical signification\" or meaning. These are often vague to identify in music, as often they do not correspond to units of classical music analysis. They can be a single chord, or maybe a wide-encompassing texture, melodic shape, use of specific instrument in a context, etc. How Tagg analyses what music \"means\" is through IOCM - Inter-Objective-Comparison-Material. Meaning - seeing how similar structures of music have been given meaning in our culture historically. (Hence the comparison with The Rite, Psycho, soul music, etc.) To establish these, Tagg often interviews peoples first impressions on given music and attempts to find culturally shared categories of interpretation. Further he develops a sign-typology of these musemes, he has coined the term \"anaphone\" (musical analogue) to describe different types of signs - indexical (referring signs) such as style, genre and cultural anaphones (synecdoche) or iconic anaphones (based on resemblance, such as the \"bustling\" of the market in the strings, musical echos connoting spaciousness etc). \n\nFor a more academically presented analysis, I believe he has written on Kojak in \"Ten Little Tunes\" https://books.google.ee/books/about/Ten_Little_Title_Tunes.html?id=WXF-QgAACAAJ&redir_esc=y\n\nAn introductory article on music semiotics coined by him is available here: https://www.tagg.org/xpdfs/semiotug.pdf\n\nAnd a rather extensive e-book serving the same purpose is freely available here: http://tagg.org/bookxtrax/NonMuso/NonMusoAll.pdf\n\nFurther I'll note that though Tagg is a respected scholar in music semiotics and serves as a pretty accessible intro, he by no means characterizes the field as a whole, as it is quite heterogeneous. "}, {"comment_id": "dxauvno", "post_id": "8by543", "comment": "Study what you want to study. Every field is over saturated with students from Law to Art to Medicine."}, {"comment_id": "dxbeiiq", "post_id": "8by543", "comment": "I don’t think there’s any reason you can’t do your ethno project and still research and learn about German composers. And I see what you mean about the world “needing” another Beethoven scholar (though, honestly, I don’t think there are actually so many new ones of those being created at this point), but when people specialize in a composer anymore, it’s less that they are going back over all the manuscripts or trying to write new biographies (they come out, but rarely by anyone people take seriously and they can be [absolute trash](https://books.google.com/books/about/Beethoven.html?id=KexJAQAAQBAJ&printsec=frontcover&source=kp_read_button)) and more that they are taking new approaches to those composers or their milieus. We’ve sort of moved past the hagiography of composers (or we should have) and are moving into new modes of analysis for theory and/culture. Perhaps the field is saturated for jobs, but the subjects are not tapped dry."}, {"comment_id": "dxanvq1", "post_id": "8by543", "comment": "Is there a lot of academic work concerning western music? Sure. But over saturated in relation to what? I mean, i don't think the western civilization is the only culture in which musicology is an active scientific field. "}, {"comment_id": "dxbq72w", "post_id": "8by543", "comment": "A good degree pathway should allow for both. Acting as both an introduction to broader western art music, and options for self directed/module based study in enthomusicology. \n\nI would contact some academics at schools you’re interested in attending and ask about the options available.  "}, {"comment_id": "e7914zd", "post_id": "8by543", "comment": "Go for it. The music of those great artists is timeless largely because their relevance can be continually re interpreted in circumstances alien from their origins. You may bring the next great scholarly interpretation."}, {"comment_id": "dklhh8y", "post_id": "6oz3hq", "comment": "I'm assuming you're looking in the U.S. \n\nIf so, you might start here: \nhttp://www.ams-net.org/gradprog.php#usa\n\nInvestigate programs on the AMS site that look like they may interest you. When applying for grad schools, it is useful to create a list of criteria and prioritize according to your own goals and needs. Apply to as many as you want, or as many as you are able to. Honestly, I don't think anyone could give you a specific number, but applying to many schools can be costly, so if you don't want to spend thousands on application fees, you could be fairly selective and prepare very strong applications for those that you do apply to. A strong list of around fifteen to twenty schools would be a good start, and as you continue to consider where you would best succeed, you could cut that down to around five to ten. \n\nBe sure to look for: program availability at the grad level, faculty and their research/accomplishments/potential to help you with your specific goals, university research resources and libraries, financial assistance or scholarship opportunities, teaching opportunities for grads, working/studying environment, and of course enrollment in the program (which should help you decide how competitive each program might be).\n\n"}, {"comment_id": "dklhmp9", "post_id": "6oz3hq", "comment": "I applied to six. Still feels to me like a solid number. In my opinion, if you apply to a whole mess of them in the hopes one sticks, you might need to consider if you are a strong candidate or if a year or two off to do some research and conferencing to improve your application would be worth it. Applying to only one or two, unless you have a high degree of certainty you'd get in (like an advisor has said they have a spot for you), is risky.\n\nFor a high number of apps, remember that grad school apps are very time consuming and expensive, more than undergrad. You really need to demonstrate why this particular program needs you and you want them, and that's a time consuming task.\n\nBut most of all, find the programs that suit you, for faculty, research resources, funding, location, cost of living, etc. That's your number. "}, {"comment_id": "dklin3r", "post_id": "6oz3hq", "comment": "I'm in composition, but if it helps I applied to six at the PhD level.\n\nYou might want to think about what you are going to do when you are done with graduate school.  Look at the academic job wiki for musicology for a reality check: http://academicjobs.wikia.com/wiki/Musicology/Ethnomusicology_2017-18"}, {"comment_id": "die81f3", "post_id": "6eyzs6", "comment": "I'd be interested in that, I use these sorts of studies and writings as inspiration for compositions - whether they're up to date or not isn't of much concern to me.\n\nLet me know where you end up uploading it,\n\nThanks"}, {"comment_id": "difflkp", "post_id": "6eyzs6", "comment": "What is it called? Are there records of it online already? I'm interested"}, {"comment_id": "die61nn", "post_id": "6eyzs6", "comment": "Honestly, unless it might be of value for historiography, I doubt it would be worth reading, really. Thought on this stuff has evolved so much since then that this would probably have been obsolete 40 years ago from today.\n\nThat said, it might be interesting to look at as a historical document kind of thing. Maybe archive.org would be a good spot for it? Not sure what the copyright issues are, though. "}, {"comment_id": "de18apc", "post_id": "5vdj9k", "comment": "Hip Hop can't be adequately summarized in a reddit post.  Fortunately, there are many great books that tell the story!\n\n[Jeff Chang's](https://smile.amazon.com/Jeff-Chang/e/B001H9XQZ4?sa-no-redirect=1) work is a good place to start.  *Can't Stop, Won't Stop* gives a great overview of hip hop's origins in New York and beyond.  *Total Chaos* and *We Gon' Be Alright* deal with contemporary political and aesthetic issues.  Also check out [Tricia Rose's](https://amazon.com/Tricia-Rose/e/B001HMTWYK?sa-no-redirect=1) work, particularly *The Hip Hop Wars,* which is a collection of essays that surveys a great deal of repertoire and could give you ideas on how to involve hip hop into your curriculum.   Also check out this edition of the journal [Radical Teacher](https://radicalteacher.library.pitt.edu/ojs/index.php/radicalteacher/issue/view/2/showToc) for curriculum ideas.  \n\nThere are a few textbooks that breakdown Hip Hop more chronologically, but I've never much cared for them.  You could check one out [here](https://amazon.com/Rap-Hip-Culture-Fernando-Orejuela/dp/0199987734?sa-no-redirect=1).  I prefer readers like That's the Joint! and [The Cambridge Companion to Hip Hop](https://amazon.com/Cambridge-Companion-Hip-Hop-Companions-Music/dp/1107643864/ref=sr_1_1?s=books&ie=UTF8&qid=1487706710&sr=1-1&keywords=cambridge+companion+to+hip+hop), which are quite affordable and fun to read!\n\nAs far as listening, I'd ask your students what they are listening to and listen along with them.  There is a lot going on in Hip Hop right now and it's a great time to dive in.  Head over to /r/hiphopheads as well if you want to keep abreast of what's new!\n\n\n"}, {"comment_id": "de183m9", "post_id": "5vdj9k", "comment": "If you have Netflix, Hip Hop Evolution is a good documentary which goes from the early days of hip hop through its evolution to the mainstream. It has lots of interviews with people who were there at the time so great source of info. Plus I found it entertaining to watch as well."}, {"comment_id": "de2kzn5", "post_id": "5vdj9k", "comment": "Grove (as always) seems to be a pretty good place to start.\n\n>A collective term for urban art forms that emerged in the 1970s beginning in New York City. Initially the term was applied to the artistic outlets of b-boying/b-girling (what cultural outsiders recognized as breakdancing), graffiti writing, MC-ing, and DJ-ing, but as it has grown into a global phenomenon, hip hop has come to embrace fashion, language, and lifestyle.\n\n>Hip hop took root in the socio-cultural context of post-Civil Rights era New York City. White flight in the wake of integration depleted local, urban economies of the consumer power necessary to support local businesses. \n\n&c &c"}, {"comment_id": "dflj3tl", "post_id": "5vdj9k", "comment": "Don't forget to go into hip-hops roots in jazz, gospel and other styles, if you can expand their taste by just a tiny bit they might become more willing to expand their taste themselves. \n\nAlso, the social, economic and political context of these times is extremely important for understanding all genres but especially popular African-American styles such as hip-hop and would be very useful knowledge for your students I'm sure (not to assume their ethnicity, I think you must teach both sides about oppression if you want it to stop)."}, {"comment_id": "dflzrhq", "post_id": "5vdj9k", "comment": "I know this is an old post but you should also check out The Get Down on Netflix! So far it only covers the very beginnings of Hip Hop but I thought it was amazing and very well made."}, {"comment_id": "ddgxnxt", "post_id": "5spmh1", "comment": "This is really the long-running (to the point of growing quite tiresome) debate of vibrato vs. no/less/different vibrato.  The fact is that we just don't know.  There are convincing arguments for all sides but it boils down to interpretation of very old written accounts, none of which say something definitive like \"people outside of church sang with vibrato.\"  There are some performers taking it in the other direction, using \"less formal\" singing styles to perform church music, after all, most church music wasn't sung by professional singers either.  There are some downright hilarious recordings of songs by John Dowland and others where the singer employs a decidedly modern, bel canto, blastissimo vocal style, for music that was essentially the pop songs of the day.  Personally I love Sting's take on Dowland, it seems to make so much more sense when interpreted by a pop singer.  \n\nI think the important thing to remember about secular Renaissance music is that none of it was set in stone.  Most professionals played by ear, they improvised, it was mostly the wealthy amateurs who bought scores and instructional books.  Music instruction was largely based on imitation, repetition and memorization, it was more of an oral tradition.  I think the essence of Renaissance music lies more in the textures and temperament, rather than in articulation.  Of course a certain level of knowledge of the performance practices of the period is important, but most of that is an educated guess as well.      "}, {"comment_id": "ddtc7rx", "post_id": "5spmh1", "comment": "[Relevant video](https://www.youtube.com/watch?v=qBmBuMsiIt0). A lot of the 'Renaissance' music you hear is just pitched way too high! Once you bring it down to the proper register, the timbre shouldn't sound too different from how you'd sing a later art song, or a part song in lighter and more popular genres like the glee or the quartette."}, {"comment_id": "d96vatj", "post_id": "59adu5", "comment": "Do a Roman numeral analysis, then mark non-chord tones, then do a rhythmic reduction. Then you should be able to start getting an idea for the Ursatz. Don't forget to look for harmonically supported Urlinie pitches. "}, {"comment_id": "d96wb7r", "post_id": "59adu5", "comment": "You may also try asking in the /r/musictheory subreddit."}, {"comment_id": "d970scx", "post_id": "59adu5", "comment": "I always found it easiest to start by finding cadences, and mapping out the key areas of whatever I'm looking at.  I then lay out the bass line motion as it moves from key area to key area.  This gives me a good starting place to work from."}, {"comment_id": "d99cks8", "post_id": "59adu5", "comment": "Most people would probably want to point out that Schenkerian Analysis is best learned by working quite closely with a teacher, either in private instruction or perhaps in a small seminar/workshop environment. Anyway, if you have access to a good music library, you may want to take a look at Peter Westergaard's *Introduction to Tonal Theory* which is an introductory textbook written from a loosely-Schenkerian perspective (albeit it does simplify and dispense with many of the more complex, interlocked notions which are actually quite important to Schenker).  I also second the mention of /r/musictheory.\n\n>  I started by marking out the cadences, but that's about as far as I got. Cheers!\n\nMarking out cadential moments is a good idea since these often point to structurally-important points in the piece, but this is only a tiny part of what a full analysis involves. For one thing, Schenkerian Analysis also requires quite a bit of familiarity with the rules of counterpoint, in order to spot moments of resolution which don't involve a full cadence."}, {"comment_id": "d9gx7l1", "post_id": "59adu5", "comment": "You may find [this site](http://schenkerguide.com) useful. "}, {"comment_id": "d9vipuu", "post_id": "59adu5", "comment": "It would be helpful to know what exact sonata you're being asked to look at."}, {"comment_id": "d4jh4m3", "post_id": "4p889e", "comment": "I want to add onto this post after some research: turns out there were quite a few talented and beautiful composers from Sweden's royal court, especially JH Roman who is actually referred to as the \"swedish Handel\".\n\nWhat I can surmise is that Sweden very much kept to itself after the Thirty Years War and wanted to homegrow its own culture, and as such didn't mingle with the outside music scenes. I would highly recommend listening to JH Roman's \"Assagio in A Major for solo violin\". Its stunningly simple yet gorgeous, and it might be the polyphonic violin line akin to the folk music of the region, but I cant quite put my finger on what makes it sound so pristinely unique."}, {"comment_id": "d065t35", "post_id": "46i38z", "comment": "Thank you for posting this! I heard some facebook chatter about this controversy, but did not see the original article/debate about it until you posted it here."}, {"comment_id": "d05afpu", "post_id": "46i38z", "comment": "I just want to note that the title of this post (here on Reddit) isn't meant to editorialize or anything like that, just to note that this post on MN has attracted a great deal of controversy. "}, {"comment_id": "cyor23q", "post_id": "3zsiv3", "comment": "[This one](https://classicalastrologer.files.wordpress.com/2015/01/pythagsource-17the-music-of-the-spheres-shown-in-this-engraving-from-renaissance-italy-are-apollo-the-muses-the-planetary-spheres-and-musical-ratios.gif) is a bit bigger, and [this one](https://andrewlawrenceking.files.wordpress.com/2014/08/harmony-of-the-spheres-and-intervals.jpg) has some accompanying text.  \n\nFound both via tineye; don't ask me to explain further!"}, {"comment_id": "cx9udk6", "post_id": "3tv5ia", "comment": "Hmmmmm, if you think way back to the era when public concerts first became standard (end of the 18th/beginning of the 19th century), you may be able to find something about encores. I'd imagine that the rise of public performing virtuosi - the Liszts or Paganinis in Europe, who were the \"popular musicians\" of their era - played a role in the development of encores. \n\nI can't think of any direct sources off the top of my head, however. If you look around on JSTOR online, grab a selection of music journals (I'd say look to Nineteenth Century Music in particular, maybe also Journal of the American Musicology Society) and use keyword \"encore,\" I'm sure you'll come up with something.\n\nAs for particular 20th century rock or pop sources for this, I can't think of any. If you look around journals in JSTOR and do want 20th century stuff, try the journal Popular Music (published by Cambridge University Press), which is widely regarded as the best pop music studies journal in the world.  \n\n\nSource: have PhD in popular music studies (musicology).\n"}, {"comment_id": "cxaa1qm", "post_id": "3tv5ia", "comment": "clues: http://m.mentalfloss.com/article.php?id=51173"}, {"comment_id": "cz0uxpm", "post_id": "3tv5ia", "comment": "There's always been encores, even before there were concerts."}, {"comment_id": "cwvl9ie", "post_id": "3sa7ce", "comment": "One thing I find particularly interesting in this is the way that leitmotivs exploit nostalgia. People who have seen the films know the Star Wars leitmotivs Lehman refers to, maybe even before actually hearing them. And playing to audience reference points is, I think, an important aspect of film scoring, at least for many composers, especially those of the Golden Era. If you haven't ever read anything by Lehman, I would recommend his work--he does the best transcriptions, too!"}, {"comment_id": "cvltu64", "post_id": "3n78bi", "comment": "To address some specifics up front. \n\n>Is it OK that I haven't had anything published yet? \n\nYes. Most people don't publish until well into their graduate career. Many don't see a publication until after their dissertation is completed. \n\n> Will it be possible to continue to perform (violist here!) or should I only focus on research? \n\nAlmost certainly. But of course different places will have different opportunities. But, in general, if you want to perform, your program will facilitate it. \n\nNow, for a longer, more detailed response. \n\nFirst of all, I think writing samples are potentially the most important part of your application. Think about what your papers say about you (can you analyze music? Can you critically digest / respond to scholarly literature? Etc.) and of course edit them well. \n\nSecondly, develop a good relationship with any musicologists in your department. They can guide you toward good schools, they can write letters on your behalf, and they may even know a guy who knows a guy, which can help your case as well. But even just getting a good letter of recommendation is good. You will want to have three contacts. When I applied to grad school for theory, I had a mentor who was an adjunct and just getting done with his dissertation. My letters came from my theory professor, the head of the composition department (who I had taken some classes with), and my piano teacher. \n\nYour personal statement needs to do three things. 1) Provide a concise picture of your scholarly interests, 2) demonstrate your relevant achievements / academic competency (who you've worked with, what you've done, **and preemptively responding to anything in your transcript that might have them raising their eyebrows**), and 3) explain why you are interested in that school in particular (be specific!). These three things serve one larger purpose: proving to the school why they should consider you as a candidate. \n\nNumbers 1 and 2 can remain relatively consistent across your applications, but number 3 will of course have to change. Let's linger here a moment. Of course you're applying to Yale because IT'S YALE (prestige and that sweet Ivy league stipend), but you of course can't just say that. Neither will blatant flattery work, they know that their institution rocks, they need to know why *you* belong there. So here's how you handle it: go to the website of the school, find scholars that actually do work relevant to what you do, read an article or two by them, and then write about how your work relates to theirs. \n\nSaying \"I want to be a student at Yale because Yale is great for x y and z reasons\" isn't a strong statement. Saying \"I would like to study with James Hepokoski because of his interest in dialogic understandings of musical experience. My work intersects with his in x y and z ways, and I am interested in applying that work in the study of 17th century opera.\" That is a strong statement. That shows that you are not just a generic student, but that your research interests actually resonate with the school in question, and consequently that you would mesh well with the faculty. \n\nPerforming this exercise for every school will be a lot, but it'll be worth it. Not only would you be writing significantly better personal statements, but researching who is at these schools will give you a better understanding of where you would fit the best. If you look at the Yale faculty, you read a couple of articles by the faculty there, and you find yourself completely uninterested in anything they're saying, then you might want to reconsider applying there in the fist place! Save yourself the application fee. \n\nAlso, if you find something you are interested in / have some further questions after reading, drop the author an email. Scholars are often very excited to discuss their work, and it can't hurt you to have a contact in the schools you are applying. \n\nSo, in sum. Do three things in this order of importance:\n\n1.) Write good papers that demonstrate your competency and range of interests. \n\n2.) Develop a good relationship with any musicology faculty in your department to secure some decent letters of recommendation and to have someone to help guide you. \n\n3.) Write a good personal statement that paints you as a specific person with specific interests. Avoid generic statements like the plague. "}, {"comment_id": "cvlt3f3", "post_id": "3n78bi", "comment": "I haven't been through this process, but have been thinking about it. As far as the personal statement/statement of purpose is concerned, I would say keep it concise and to the point. If there's a particular aspect of musicology you're interested in, such as ethnomusicology, I would be sure to include it. Most importantly, make sure that your passion for music and musicology comes through in your writing. Also, make sure that you use proper grammar and be deliberate and thoughtful in the words you choose while you write.\n\nAs far as I know, not having anything published shouldn't be a problem. However, you should have writing examples to show them if they ask. While essays you have written for your music history classes are fine, it might also be helpful if you write an essay on a topic you find interesting in music history.\n\nYou should absolutely continue to perform, there's no better way to learn about music than by playing music. The more you perform, the better you will be able to understand how compositions work, or why a composer chose to write something a certain way. Think of it like this: if you are studying a score, you can figure out all the harmonies and melodies, and you can audiate it in your head, and you can do all of this analysis of it, but to truly understand a piece of music you have to hear it performed, only by hearing it will of the analysis you've done truly make sense.\n\nOnce again, this is my opinion as someone who hasn't gone through the process. However, I do hope it helps you in some way.\n\nGood luck!!"}, {"comment_id": "cfw7ev2", "post_id": "1zralf", "comment": "I like the begin of Rhapsody in Blue at time 12:20\nhttp://www.youtube.com/watch?v=m3htcLHzjpc#00:12:20"}, {"comment_id": "c5x44wr", "post_id": "ym8vr", "comment": "As a TA for an \"Introduction to Music Literature\" writing course for non-music majors, this might just come in handy..."}, {"comment_id": "c5yt3ai", "post_id": "ym8vr", "comment": "Most excellent."}, {"comment_id": "c7ubmb2", "post_id": "ym8vr", "comment": "Just thinking about writing Music history papers in college brings back fond memories. Going to the music library getting stacks of books covering a desk and researching for hours. Am I crazy for missing writing academic papers?"}, {"comment_id": "c8gaemd", "post_id": "ym8vr", "comment": "Thank you, this is useful for first-timers!"}, {"comment_id": "f0osm93", "post_id": "d2r9en", "comment": "Its funny that I had the same idea about creating such a thing. Good to see someone did it! \n\nReally wanna create an interactive digital edition of works. Which includes all available autographs or facsimiles so that the process of creation can be followed. Plus adding deeper explanations to those things with connected links and the possibility to hear the notes.\n\nThought about further master studies in the field of ‚digital humanities‘ here in germany to reach that goal."}, {"comment_id": "ewyhyrl", "post_id": "cqqhm0", "comment": "I'm under the impression that the journal's editors edit it with you.  \n\nMy first article was accepted by a journal and we've been going back and forth with edits, and I'm informed by my colleagues that this experience is fairly common.  \n\nHowever, my ELL colleague was informed by a journal that they're very interested in her research but her English writing is not up to their standard. So they recommended that she hire a copy editor or have a few native English speakers work in depth with her, then she can resubmit.  \n\nSo I guess I doubt you have to have it edited perfectly before you submit it, because the journal will have their opinions anyway."}, {"comment_id": "ewylkx3", "post_id": "cqqhm0", "comment": "Well, maybe I could help actually, depending on the topic. What is it about and how long is it?"}, {"comment_id": "ewzl3xv", "post_id": "cqqhm0", "comment": "If you are still looking for someone I would be able to help you out."}, {"comment_id": "ex3vae4", "post_id": "cqqhm0", "comment": "If you have not found someone suitable, please contact me. I have a masters in music History and 10 years of copy editing experience."}, {"comment_id": "ex57kug", "post_id": "cqqhm0", "comment": "Yes, I should be able to help with that."}, {"comment_id": "ex59hzt", "post_id": "cqqhm0", "comment": "Can you tell me about the subject?"}, {"comment_id": "ex7504s", "post_id": "cqqhm0", "comment": "Let's talk terms. Can we do that off-list? My email address is tomsjazz@msn.com."}, {"comment_id": "eu7fbmi", "post_id": "cf0ype", "comment": "I think the most important factor is arrogance, in addition to a Eurocentric/Euro-supremacist view of music\n\nBasically I mostly agree with you and your subsequent conclusions\n\nUnfortunately a lot of writing in the topic from years ago is going to be rather cringe-worthy with a remarkable dismissal or ignorance of the fact that Europe did not invent music, and that, shockingly, people from places other than Europe might actually sometimes have complex thoughts\n\nbtw , I usually say Euroclassical to refer to like, Bach, Beethoven, Mozart. I dislike the term \"Western\" and feel \"classical\" is unfair."}, {"comment_id": "eu71kd3", "post_id": "cf0ype", "comment": "DMA candidate chiming in here!\n\nI think there’s some interesting ways to view the relationship between art, folk, and pop music.\n\nOne way I’ve heard is economics. \nArt: money is paid to someone to compose\nPop: a composer creates a work to get paid\nFolk: there is no money\n\nI think it makes sense in broad strokes, but I think there’s too many exceptions for it to be a rule. To me, the intention of the composer is the defining characteristic.\n\nArt: composer intends to be appreciated intellectually\nPop: composer intends the music to be experienced functionally \nFolk: There is no composer!\n\nTo me, it’s the intent of the composer and the experience and expectations of the audience that separate the three styles."}, {"comment_id": "euhsjkq", "post_id": "cf0ype", "comment": "A counterquestion:\n\nWhat is the point of defining these demarcations? Why does it matter?\n\nYou write:\n\n>I'm just into this because it seems important what sort of music is given a serious treatment and is included in books. I would like to clarify the divide observed by scholars that separates the two forms of music.\n\nThis is deeply concerning to me. In principle, all music from that made by the complete amateur student to the master virtuoso/composer or superstar should be given equally serious treatment. I'm not sure if that is what you mean, but you seem to imply that popular music should not be \"included in books\"?\n\nFrom where I'm sitting, the division between so-called classical/art music, popular music, and folk traditions is outdated and irrelevant as long as the point is to demarcate sonic/musical differences. It only becomes relevant when the point is to demonstrate social, cultural, historical, or political differences in perception and so on."}]