[{"comment_id": "e56otj3", "post_id": "9bvo3b", "comment": "[most definitely](https://www.moma.org/collection/works/127627)"}, {"comment_id": "e56kxpl", "post_id": "9bvo3b", "comment": "To be fair the answer is almost always yes."}, {"comment_id": "e570aa1", "post_id": "9bvo3b", "comment": "[deleted]"}, {"comment_id": "e571f1f", "post_id": "9bvo3b", "comment": "What does this have to do with musicology? Isn’t that something that originated more with fluxus or dada?"}, {"comment_id": "e5730xl", "post_id": "9bvo3b", "comment": "Well, professor, that depends on how you’re using the term “music.”"}, {"comment_id": "e57au0l", "post_id": "9bvo3b", "comment": "Noise"}, {"comment_id": "e2dkdel", "post_id": "8yqdbw", "comment": "I like to think Gandalf was a Hurdy-Gurdy master."}, {"comment_id": "e2hl0sn", "post_id": "8yqdbw", "comment": "Those hobbits are making whistles out of blades of grass all the time for sure."}, {"comment_id": "e2d1v2g", "post_id": "8yqdbw", "comment": "Interesting.\n\nHave you ever seen Forbidden Planet? You can actually just google it and \"Krell Music\" and get a good idea of what a husband and wife team of composers thought music of an alien culture would sound like.\n\nI think most of your \"fantasy\" genre stuff tends to be connected pretty well with our history, and as such a lot of times the music will just sound like \"Early Music\" - Renaissance music, Troubadours and things like that.\n\nI think music-makers are within their rights to assume that any culture that evolves similarly to us (since usually in movies the characters have to be played by actors, at least pre-CGI days) will also evolve instruments similar to us.\n\nThough it may certainly be a little \"western centric\" to assume that they'd develop music less like Africa or Asia, and more like Europe. But since they usually model clothing and everything else again it seems like the logical course.\n\nIt also makes it easier to compose because you don't have to be historically accurate ;-)\n\nI've always found the few examples in the Star Trek universe interesting - Spock's lyre-like instrument - in some of the newer things Klingons sing/chant, and there are references to the music of other species - Klingon Opera I think is mentioned. In Voyager, the Doctor becomes a virtuoso singer for a culture. In a DS9 episode they had a player who played an instrument kind of like what we'd consider Clarinet-like.\n\nBut, Strings, Drums, Pipes, and Metal/Wood - what do we have, Chordophones, Membranophones, Ideophones, Aerophones...am I forgetting one...? Anyway, those sort of basic \"sound making\" physical objects would be likely in any culture.\n\nBut it would be intereting to see how far away you could get from tradition. Wouldn't it be cool for a culture to have a plant with a seed pod that when blown into, produces a note and rattles the seeds at the same time!\n\nOf course I suppose it also depends on how advanced your culture is.\n\nIt would be even more fun to do like alien cultures where they have 3 legs so their \"marches\" are in 3/4 and their dances are in 3! or something."}, {"comment_id": "e2dnep2", "post_id": "8yqdbw", "comment": "The local arts group broadcast an abridged reading of A Wizard of Earthsea and asked me to create some background music for it.\n\nTo a certain extent, I had to do what I was told, but they didn't give me a lot of instructions: they wanted something similar to the Enya songs in LOTR and that there's an overarching concept of light/dark balance, so the music had to portray that somehow.\n\nThe attemps to clone Enya were deleted.\n\nFor the \"balance\" concept, I made rhythms in 7/4. A common thing I noticed in progressive rock music in 7/4 is that if you divide the measure in half, you get two 3.5 beat measures so you have something that sounds syncopated but is balanced at the same time. Then I can represent imbalance by doing something else.\n\nAbridged results:\n\nhttps://soundcloud.com/chunter/a-visit-to-earthsea-medley\n\nThe Legend of Zelda always has a flute/recorder/ocarina as a usable item, so I'd expect they play a lot of wind instruments, if we don't presume their music sounds like the BGM."}, {"comment_id": "e2hq5lu", "post_id": "8yqdbw", "comment": "Think about the spaces and situations where they'd be playing and listening. Do they dance outside around the fire, where loud, booming percussion would carry across the landscape but subtleties would be lost? Do they gather in intimate rooms, where soft string plucks and bends could punctuate conversations? Do they gather in grand halls, where sounds need to ring and reverberate? Where did they first start to listen to it? Did they used to have booming drums but then began listening in halls, keeping the drums because of tradition but dampening their volume to suit the change in venue? Is music a communal activity in their culture? Or is it only played by professionals?\n\nedit: I think what I'm trying to get at is that music is an element of culture, so you should consider the cultural context of the music and its development."}, {"comment_id": "e2dg692", "post_id": "8yqdbw", "comment": "I think that in order to create an accurate music culture of a fictional world, you have to go to the beginnings of your species, long before civilization, especially if it's a space-faring race. Are your characters herbivorous, carnivorous, scavengers, primary producers, other? What are their social interactions like? Gregarious or solitary? What's their society's hierarchy like? Are they a sexed species? How many sexes? What is their equivalent of courtship? And, importantly, what is their anatomy? How do they breathe? If they do breathe! What kind of limbs they have? That would be important to know their possibilities and limitations when it comes to musical instruments. And, again, what is their environment like? Also consider the diversity of environments on Earth, and that planets that do have life on them will likely show the same kind of diversity of habitat. So you can already forget one-habitat planets: desert planet, forest planet, ocean planet, etc. They \\*can\\*, probably, exist, but they are the least likely scenario. But I digress. So, you'll probably not have \\*\\*one\\*\\* music for one species, just as you don't have one \"human music\" genre or sound, but countless and always-evolving musical genres from many different cultures and subcultures. Obviously, I think if we were to present our species' music to an interstellar gathering, it would probably be classical music, so you could say that's the staple of our music, and other species should also have their \"crowning achievement\", one type of music that they are particularly proud of as a civilization, but keep in mind that it can be the tree that hides the forest."}, {"comment_id": "e2di0wk", "post_id": "8yqdbw", "comment": "Most fantasy worlds like Westeros and Middle Earth tend to imply music that is similar to music from the Middle Ages of this world."}, {"comment_id": "e2dt2bl", "post_id": "8yqdbw", "comment": "For Hyrule I’ve watched videos by GameMusicTheory on YouTube. His videos on Zelda are really cool you should check it out! He even has a four part series on Breath of the Wild"}, {"comment_id": "e2g2x0b", "post_id": "8yqdbw", "comment": "Have you thought about concept albums with narratives in fictional worlds? I know that isn't exactly what you're talking about but albums like Janelle Monáe's, for example, has a very present narrative with somewhat fleshed out \"descriptions\" (sonic, lyrical, or visual) of the music culture(s) of her story world."}, {"comment_id": "ebvjbae", "post_id": "a6k2w6", "comment": "So this is the graphical visualisation of a theoretical framework i have had over these last years of how sociology of music broadly works in the modern world. \n\nA particular musical style normally rises, achieves a certain degree of social hegemony and then fades into history. There are two sets of opposite tendencies that act on that particular musical style, and when that style is in the middle, it arrives at the top.\n\nThe first set is one of chaos versus order applied to sociology, so marginalised groups and central institutions. The second set is one of complexity versus simplicity, again applied to sociology, which means music specialists versus the masses.\n\nEach type of the eight types of music shown in the graph has its explanation and a few examples.\n\n[The full post detailing each explanation can be found here] (https://yohaciendomeelculto.wordpress.com/2016/12/02/social-hegemony-of-musical-styles/)\n\nThis is the explanation for Industrial Music:\nIndustrial music, on the other hand, is comprised of a set of musical styles that don’t have a social base naturally attached to it. It can acquire it with time, though. It’s comprised by forms of music that are created mainly for the purpose of making money, or providing a service. Musical scores for movies or video games are the main examples. Music for television shows, announcements, or trailers. Sometimes, if the institutions and atmospheres that comprise this way of music making are sane and powerful enough, they can attract individuals from the creator minority that produce music of great quality able to connect to a wide audience. Examples of this kind of phenomenon are great and famous film composers like Hans Zimmer or John Williams, whose compositions are able to transcend their primary capitalist functions and become cultural icons, like the Star Wars themes, between many other movies. Another example is the style of what was known firstly as ‘industrial’ music per se, and now called popularly ‘epic’ music, which is a style that existed in the shadows for a long time, comprised of production tracks and sounds sold to movie trailers and TV series. They took classical music harmony and orchestral wisdom and applied it very successfully with modern techniques, creating a very advanced and genius style of music, which caught on with lots of music-loving people outside the entertainment industry. The main example of this style is the group Two Steps From Hell."}, {"comment_id": "ebw3o45", "post_id": "a6k2w6", "comment": "Cool. I would love to know what 'industrial' musics have in common throughout history, I mean what qualities in common musics from the popular to historical spectrum have in common. And exactly what those styles are (as far as known)."}, {"comment_id": "ebwnmce", "post_id": "a6k2w6", "comment": "I'd say that industrial music in this context is not so much a style so as much as a purpose. Maybe we could consider court music in certain places, like the Chinese emperor court, Byzantium or medieval kingdoms, to be industrial music, or even all the masses the Bach had to compose every week in the sense that they were made to service an institution and its events."}, {"comment_id": "ebxn76m", "post_id": "a6k2w6", "comment": "Does your theory treat the notion of “popular music” in some way that would be applicable across the same breadth of history that your description implies? Doesn’t popular culture (cf Adorno/Horkheimer, Dahlhaus) more or less require a literate middle class? And does your theory more generally acknowledge that these categories are not really “of a kind”? In any society where there’s a literate middle class, there will be plenty of opportunities to commercialize/industrialize folk music or historical music. Not that your graph requires any category to be mutually exclusive, of course, but it’s hard for me to imagine how this becomes a theory of everything, that is, a theory of how these forces interact with one another generally, if it has to work in Paris in 1810, but also for rural post-Soviet musics in the age of the internet. I’m guess I’m not sure how much mileage this particular geometry will get you across that range of circumstances?"}, {"comment_id": "ebxq6av", "post_id": "a6k2w6", "comment": "The notion of popular music to me is the kind of music that aspires to represent the zeitgeist of a society at its core, without trying to advance or invent in any sort of way. It's an attitude towards music. It's music for people that don't have the time or capacity to go beyond what they already currently are and feel represented by. \n\nThe distinction with the opposite end of the spectrum, the academic one, is a relative one in the sense that one can compare how much a piece of music is separated or advanced compared to the current society the piece of music itself is born into. So it's not so much a matter of if people in a society are more or less literate compared to other societies, the distinction here is more like an intrasocietal comparison. The ideal of the popular music, or pop, has literally been surfing the crest of continuous waves of different styles throughout history, most recently going from jazz to rock to edm (oversimplifying).  \n\nAlso, let me clarify that i identify these 8 categories as 8 extremes or ideals, concrete examples would be tracing a path inside the diamond shape."}, {"comment_id": "ebyltgn", "post_id": "a6k2w6", "comment": "I’m looking forward to reading the linked post in detail— but I will say your image indicates that you’ve thought this out pretty thoroughly. If I might ask, though— does your post include historiographic analysis of a network of pieces, to kind of simulate the pattern of relationships you’re arguing for here? And does your post include a bibliography? \n\n"}, {"comment_id": "ebyz70d", "post_id": "a6k2w6", "comment": "The post is kinda academic, it was made as a main essay for a subject called Political anthropology in the jazzistic field, after all. But most of it comes from my own listening experience throughout my life. There is a loose bibliography at the end, but don't expect to be like a professional essay. I tried to look for texts that talked about evolution of styles, sociology, etc. but found almost zero."}, {"comment_id": "ebzj86u", "post_id": "a6k2w6", "comment": "Check out “Noise: the political economy of music,” by Jaques Attali. At face value some of his ideas seem pretty crazy, and they are worded rather morbidly. But after some consideration I think there is some merit to what he argues. \n\nI’ll have to check out your post, as I expect I’ll find my answer there, but if you are able to examine a number of pieces of music (or collections of music) and insert them into the appropriate places in your graphic it may help to establish credence for your ideas. (I’ve already said that this seems pretty well thought out, and I don’t know if you are deeply engaged in academia, but things like that go a long way.)"}, {"comment_id": "ebzopzd", "post_id": "a6k2w6", "comment": "In the post, each style has a big paragraph with a couple examples each. I'll look into this book for sure. Edit: as far as academia goes, i don't have a career there (yet, maybe), but if i went that direction, i would turn this post into a big analysis of applied jungian style sociology into music.  "}, {"comment_id": "ecj6cgb", "post_id": "a6k2w6", "comment": "I wouldn't say that popular and experimental music are necessarily antonyms. A within pop music there are certainly varying degrees of experimentation - after all, elevator music is much more mundane that most songs that top charts."}, {"comment_id": "f3ozoyz", "post_id": "dhfwn7", "comment": "Sounds really interesting, would love to know what your thesis is about."}, {"comment_id": "f3p6qjk", "post_id": "dhfwn7", "comment": "So I dont know how familiar you are with black metal and its history, but the music and the subculture are tied pretty heavily to certain views on the world that are represented on the lyrics and the imagery. \n\nI will try to keep it short here, but the common themes are anti-christianity, satanism, romanticism, cultural pessimism & folklorism (often in a way similiar to that of the nazis, blood, land and honor are tied together and should be protected from other \"folks\") and sometimes straight up national socialism and antisemitism. \n\nMy thesis consisted of a qualitative analysis of lyrics first, to find out more about these themes and what elements they consist of. I then generated wordlists out of these themes, as indicators for a certain ideology in a song. In the second part, I analysed the database above using a script for the occurence of these words, weighted them accordingly and used this data as a means to make assumptions about the quantity of these ideologies in the genre of black metal. \n\nThe results were that folklorism and cultutal pessimism were the topics that occured the most, followed by satanism and then national socialism. Of course this is the reduced version, but I could fill a book talking about this topic.\nThe relevance of this particular field for me came from personal experiences (being a fan, but then being greeted by a Hitlergruss on my first (and last) black metal concert) and from the research of Martin Langebach, who found out that the subculture is one that emphasizes that black metal and ideology can not be seperated.\n\nMy thesis is in german, if it was in english I would have linked it here. I thought about converting it to an article in english, though."}, {"comment_id": "f3syvcq", "post_id": "dhfwn7", "comment": "Nice to see some works about one of my favorite kind of metal. I thought on doing something in that area too - but our profs are rather ‚old school‘ minded. \n\nMay I ask in which city you study?\n\nBut im really wondering on which BM concert  you saw such greeting. Ive never experienced that yet.\n\nBest Wishes"}, {"comment_id": "f3x7i3c", "post_id": "dhfwn7", "comment": "Mine were pretty open minded, I studied in Bremen in Northern Germany. \n\nThe concert I was at was a local festival in a city next to Hamburg. Maybe that was the case because of it being such a small town, I am pretty sure its not that common, but I think there can be at least one guy found on every concert who wears an Absurd-shirt or similar. Not my world, I prefer listening alone lol"}, {"comment_id": "f593szs", "post_id": "dhfwn7", "comment": "A bit late to the party but this is very cool! I'm doing a PhD in Australian metal, so it's always cool to see things like this pop up on reddit. Are you able to share your thesis? I'd love to read it!"}, {"comment_id": "e3njaoy", "post_id": "94qeph", "comment": "Not necessarily musicology, but I really enjoyed [Meet the Composer](https://www.newsounds.org/shows/meet-composer)."}, {"comment_id": "e3nxwp6", "post_id": "94qeph", "comment": "Meet the Composer is one of my favorite things. Is there any news as to whether there will be a new season? I've been trying to find out with no luck. I'd be very sad if it was cancelled."}, {"comment_id": "e3n2zpn", "post_id": "94qeph", "comment": "I see that you speak Danish. \n\nIf you’re fine with listening to Swedish there is an excellent award-winning podcast called [*Den svenska musikhistorien*](https://sverigesradio.se/densvenskamusikhistorien) that goes through the history of music in Sweden in 3 seasons: pre-1800, 19th century and 20th century music with Swedish folk musician Esmeralda Moberg and musicology Professor Mattias Lundberg.\n\nI’ve listened to the first two seasons and I think it’s really well made, interesting and funny. They often invite musicology researchers as well and let them talk about their area of expertise.\n\nIf you’re Danish it might not be exactly what you’re looking for, but I would imagine that a lot of the things they talk about is also applicable on Denmark."}, {"comment_id": "e3op5mc", "post_id": "94qeph", "comment": "Classical Classroom with Dacia Clay is really fun and also well informed. She's done some cool interviews and there was a great episode where they talked about Sorcerer's Apprentice. It's really accessible and not particularly academic but it's an enjoyable podcast!"}, {"comment_id": "eaud7xc", "post_id": "94qeph", "comment": "The only two actual musicology podcast I know of are New Books In Music ([android](http://www.subscribeonandroid.com/newbooksinmusic.com/feed/)|[itunes](https://itunes.apple.com/us/podcast/new-books-in-music/id425448670)), which interviews authors of a wide range of academic books on music, and Notes On Bach ([android](http://www.subscribeonandroid.com/bachsocietyhouston.libsyn.com/rss)|[itunes](https://itunes.apple.com/us/podcast/notes-on-bach/id1165571617)), which talks to scholars about Bach or other music in his general time period and area. Other than those two, although it's not a musicology podcast, I also like Early Music Sources' [youtube channel](https://www.youtube.com/channel/UCJOiqToQ7kiakqTLE7Hdd5g/) which talks about 16th and 17th century European music and music theory."}, {"comment_id": "ebylfov", "post_id": "94qeph", "comment": "There is the Soundtrack Show which I enjoy, it goes into music analysis, history, theory...I enjoy it, and it’s great when you’re trying to explain to someone what it it is that you do"}, {"comment_id": "dbmpg20", "post_id": "5k73zd", "comment": "Wow, this is horrendous. Anybody who has analyzed much pop music at all knows how absurdly common IV -> IVm6 -> I is (and of course this motion is hardly unique to pop music). Add to that all of these ridiculous adjectives (\"spicy\"??). Tempted to make a list of clearly *non*-Christmas songs that use this. His article isn't much better (and has an even more ridiculous adjective soup)."}, {"comment_id": "dbmtc71", "post_id": "5k73zd", "comment": "Yeah he was on defense most of yesterday and it was a bit of a spectacle to follow. He stood his ground pretty firm and it got a bit chippy between sides. All started with people taking issue with the flaws (e.g. F as dominant of C), fudged concepts and reductive language of the video."}, {"comment_id": "dcjajmg", "post_id": "5k73zd", "comment": "I found the Leonard Cohen reference hilarious: \"I heard there was a secret chord, that Vox explained and it roared the musicologists.\" The twitter-er (...) forgot to add the obvious: \"But you don't really care for music, do you?\" "}, {"comment_id": "eanrzwr", "post_id": "a14kmn", "comment": "I took a class on the history music theory. It was really interesting however I had a drop that class did you some personal issues. I still thumb through the text book every so often. "}, {"comment_id": "eapam4f", "post_id": "a14kmn", "comment": "Very much so! I can highly recommend The Cambridge History of Western Music Theory ed. by Thomas Christensen"}, {"comment_id": "eamxg9k", "post_id": "a14kmn", "comment": "Yes, have you heard of Hugo Riemann?"}, {"comment_id": "eaox33r", "post_id": "a14kmn", "comment": "There  a lot of fabulous music theory history in Harry Partch's book Genesis of a Music.  Fabulous book all around from an unparalleled musician."}, {"comment_id": "ekxa5kd", "post_id": "a14kmn", "comment": "I think one of the most interesting chapters in music theory history was Johann Joseph Fux's *Gradus ad parnassum,* an 18th Century treatise on species counterpoint.  Even though this was written in the late Baroque, it was an attempt to codify the practice of polyphony dating back to the late Renaissance, particularly that of Palestrina.  Many of the compositional trends of the Baroque (opera and the concertato style) actually repudiated complex polyphony, but counterpoint was kept alive largely because of its pedagogic usefulness.  Composers like Schutz recognized the need for a firm grounding in counterpoint, even if one's compositional efforts were more homophonic.  This sentiment would survive even into the late 19th Century, when Brahms's most common suggestion to would-be students was to study counterpoint thoroughly."}, {"comment_id": "d2q6egi", "post_id": "4hjhcb", "comment": "You might get additional answers over in /r/classicalmusic \n\nA lot of film composition pulls in a very \"Wagnerian\" sound world. So I think that anyone who was a contemporary of Wagner or who came later could hear movie themes and feel fairly comfortable with the musical language. \n\nHowever, 18th century musicians would have had a much different idea of what a melodic line should do, how it should be harmonized, and what instrumentation would work well with it. As an example, let's think about the [\"Force Theme\"](https://www.youtube.com/watch?v=1gpXMGit4P8) from Star Wars. Now there's a lot about the melodic line that would work in an eighteenth century context, but a lot would need to change about how the line is treated to bring it in line with eighteenth century aesthetics. \n\nTo illustrate what I mean, I have turned the basic melodic line of the force theme into an idiomatic eighteenth century \"ritornello\" (which is the music that an orchestra would play before a singer's entrance in an aria).\n\n[[midi mockup](https://soundcloud.com/nmitchell076/force-theme-ritornello) | [score](https://drive.google.com/file/d/0B9wYtm5NwTTVc3FoX0pRV1kyejA/view?usp=sharing)]\n\nThe first 7 seconds I pulled from the first 7 seconds of the force theme, though I alter the melodic figuration, give a full orchestral harmonization rather than the \"eerie strings\" of the recording, and repeat the last bit.\n\nThe next bit (from :7-12) is wholly my own. I just couldn't find a way to work the stuff from :7-:12 of the actual force theme into something that sounded convincing and stylistic.  An eighteenth century musician would have most likely moved onto a new idea here, whereas Williams lingers on the first idea a bit more. So I decided to try to stick with the eighteenth century mindset and do something new.\n\nThe rest of it is all Williams' melody, which I harmonized and repeated in certain ways that makes more sense to the eighteenth century.\n\nHopefully that example gives you a good sense of where eighteenth and 20th century \"thinking\" in music is similar and where it is different."}, {"comment_id": "d2q7aeb", "post_id": "4hjhcb", "comment": "> So I think that anyone who was a contemporary of Wagner or who came later could hear movie many themes and feel fairly comfortable with the musical language.\n\nSince you were specific about harmony later in your post, I think it's appropriate to point out that there is a huge difference between how Wagner tended to harmonize and how it works in most Hollywood (especially more recently). His technique of extending dominants with (half) diminished chords and moving rapidly between keys via voice leading contained in these unstable chords is very rare in contemporary film music, which tends to have little to no dominant function at all, be more modal, not have diminished chords in general, modulate directly etc.  And Wagner's motifs tend not to be the full blown melodies common to Hollywood \"themes\". While it might be easier to make the comparison to some iconic scores like Star Wars (here's the leitmotif for X, here's loud brass, etc), I think on the whole the connection between Wagner and Hollywood is overstated and the differences understated.  \n\nOr at least, the comparison worked much much better a few decades ago and even further back.\n\nSorry if that was a little off topic, but hey I'm really into these things."}, {"comment_id": "d2qlx0a", "post_id": "4hjhcb", "comment": "Wow, brovo. I'm really tempted to pay you to recreate all of Star War's music into eighteenth century form."}, {"comment_id": "d2rm3w0", "post_id": "4hjhcb", "comment": "Fellow music grad here. Not to put a spanner in the works for those who adore John Williams, but you're absolutely correct. It was typical of pre 1990 film scores for composers to derive from the compositions of romantic music and the music from the Golden Era of Hollywood, one massive culprit of this being Danny Elfman. His 1989 'Batman' score is riddled with Wagnerian influences. I wrote a dissertation on this if anybody is ever interested in reading it. Then again, I'm learning loads from reading all of this so I'm not exactly an expert. Many thanks and absolutely loving this thread."}, {"comment_id": "d2qiuim", "post_id": "4hjhcb", "comment": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/bestof] [\\/u\\/nmitchell076 shows what the music of Star Wars would have sounded like if written in the eighteenth century.](https://np.reddit.com/r/bestof/comments/4hl6ad/unmitchell076_shows_what_the_music_of_star_wars/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)"}, {"comment_id": "d2qilly", "post_id": "4hjhcb", "comment": "Short answer: No. \n\nA modern orchestra does use mostly (not all) of the instruments that Mozart would have had available. Modern players also use many (not all) similar techniques. However, our musical language is much broader than that which existed in the 18th century. EDIT: I would, however, suggest based on the complexities and innovations in Mozart's later works that he would have a better shot at adapting to our new styles better than, say, Pleyel or Gluck or most of his contemporaries. Mozart in his 30s was beginning to break amazing ground in harmonic language for his time.\n\nI could write a thesis on this. If I had time tonight, I happily would. See the other replies about the style of Wagner, etc. as a good starting point."}, {"comment_id": "d2qnwbi", "post_id": "4hjhcb", "comment": "Definitely not. Music like the star wars soundtrack would probably blow his mind. \n\nNot because it's so technically superior or anything, but because it's so different.\n\nIts the same instuments, but the music is very different nonetheless. "}, {"comment_id": "d2qrxvt", "post_id": "4hjhcb", "comment": "Not sure why you chose Mozart as your example...is he just your best idea of a \"classical\" composer? I think the composer whose language is most strongly reflected in the music of Williams (Star Wars) and Elfman (Batman) is Stravinsky and possibly Debussy--freedom of tonality, shifting between diatonicism and chromaticism, and use of novel consonances/\"diatonicisms\" (modes of different kinds) in terms of the harmonies are characteristic (also freedom of meters). There are passages of Williams' music for, e.g., \"Close Encounters of the Third Kind\" that sound strikingly similar to passages in the Rite of Spring. So the musical language was developed about 150 years after the period you're talking about.\n\nJust one example of Star Wars differing from Mozart: listen to the part of the main theme called the \"Rebel Fanfare\" (the blaring trumpets part)--the harmonization here is what is known as \"parallel major triads\"--this type of harmony would've been considered totally incorrect by Mozart and his contemporaries."}, {"comment_id": "d2qs6eb", "post_id": "4hjhcb", "comment": "I've used him cause he's the oldest composer I remember having orchestra with orchestra that *sounds* like a modern orchestra, same instruments and tempo. Even with a basic knowledge I can see that modern soundtracks are more similar to Wagner or maybe Dvorak. Naturally I understand you can sometimes hear folk music dating thousands of years back in modern music, I'm interested in, so to say, possible scientific classification of modern orchestra music and classic one."}, {"comment_id": "cftrkxm", "post_id": "1zhq1x", "comment": "That's my professor or was. I love Dr. Clark he's a badass and doesn't take any shit and uses the words, \"Ape-shit\" on a constant basis. I love the man, he's one of many who steered me into the musicological field. \n"}, {"comment_id": "cfw8gj9", "post_id": "1zhq1x", "comment": "I had him as well, but I was in Composition."}]