[{"comment_id": "f4gpcvp", "post_id": "dkkmt5", "comment": "Thanks for posting to r/singing! **Be sure to check [the FAQ](https://www.reddit.com/r/singing/wiki/index)** to see if any questions you might have have already been answered! Also, remember to abide by the rules found in the sidebar. Any comments found to be breaking these rules will result in a deletion of the comment thread starting from the offending reply. If you see any posts or replies that you feel break the rules of the sub, then report them and **do not respond to them.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singing) if you have any questions or concerns.*"}, {"comment_id": "f4gv6nd", "post_id": "dkkmt5", "comment": "It's weird that I like my recorded voice more, my voice that I listen while I sing sounds a bit thin, not rich at all."}, {"comment_id": "f4gxul5", "post_id": "dkkmt5", "comment": "I think you're on to something. Make sure you absolutely hate your voice when you hear it through bone conduction, and presto, vocal booth super star!"}, {"comment_id": "f5k5sli", "post_id": "dkkmt5", "comment": ">while I sing sounds a bit thin, not rich at all.\n\nThis.\n\nMy voice is way deeper (probably because Im a guy), but Its somehow richer tha in real life.\n\nBut then again, all I got is my Samsung S7 edge to record my voice."}, {"comment_id": "f4hvlie", "post_id": "dkkmt5", "comment": "Hell yeah, but it’s sad that recorded version is how actually people hear us."}, {"comment_id": "f4hkmgc", "post_id": "dkkmt5", "comment": "Why would u attack me like dis..."}, {"comment_id": "f4i0ip9", "post_id": "dkkmt5", "comment": "If left to my own devices when recording I’d delete every vocal take and achieve nothing. \n\nMy voice annoys me no matter how much everyone else says it’s fine"}, {"comment_id": "f4ia0dh", "post_id": "dkkmt5", "comment": "Yeah sometimes it just hurts my souls when I hear myself and I am like \"god I feel sorry for the people around me\""}, {"comment_id": "f4ia2rh", "post_id": "dkkmt5", "comment": "Sometimes I actually like my recorded voice and sometimes I cringe"}, {"comment_id": "f4haw2d", "post_id": "dkkmt5", "comment": "Relate hard"}, {"comment_id": "f4i3q0w", "post_id": "dkkmt5", "comment": "How can I not hate my recorded voice?"}, {"comment_id": "f4j9etb", "post_id": "dkkmt5", "comment": "Listen to it critically but also make sure to take positive notes as well. With some practice you can hear it more for what it is."}, {"comment_id": "f4k98l7", "post_id": "dkkmt5", "comment": "Kind of like how I see myself in a mirror versus in pictures and videos....."}, {"comment_id": "f4ikkba", "post_id": "dkkmt5", "comment": "I like my recorded voice via headphones but as soon it is on speakers I hear all my flaws. How paradox."}, {"comment_id": "f4jqmj9", "post_id": "dkkmt5", "comment": "My problem is the opposite - my voice sounds terrible to me.   People seem to enjoy it."}, {"comment_id": "f4katmq", "post_id": "dkkmt5", "comment": "Unless it's a really good recording, your voice probably sounds better in person. I know there's a huge difference for me between being on someone's studio mic vs. being recorded on a cell phone.\n\nSo give yourself a break. It's probably better than what you're hearing."}, {"comment_id": "f4kbv3d", "post_id": "dkkmt5", "comment": "Pretty sure this is a legitimate psychological phenomenon. I don't remember the name, but the majority of people feel unhappy or uncomfortable with their voices on recordings."}, {"comment_id": "f4i4gma", "post_id": "dkkmt5", "comment": "i feel like its better recorded than out loud"}, {"comment_id": "f4junst", "post_id": "dkkmt5", "comment": "I used to hate my voice but 2 and a half years later at 5-10 hours a week and now I hate it a lot less. Give it time."}, {"comment_id": "f4l4bgs", "post_id": "dkkmt5", "comment": "I wish\nMy voice doesn't even sound good in my head"}, {"comment_id": "f4l9u5u", "post_id": "dkkmt5", "comment": "I don’t like the sound of my speaking voice, but my singing voice I like.\nIt throws people off because I don’t talk and sing with the same voice.\n\nI wish I could talk more like that, but I don’t think projecting would be fun in conversations :-D"}, {"comment_id": "f5d1j12", "post_id": "dkkmt5", "comment": "This meme is banned in China"}, {"comment_id": "f5jxm8z", "post_id": "dkkmt5", "comment": "Aw man, and listening to your own recording"}, {"comment_id": "f549bwp", "post_id": "dmrq1m", "comment": "Thanks for posting to r/singing! **Be sure to check [the FAQ](https://www.reddit.com/r/singing/wiki/index)** to see if any questions you might have have already been answered! Also, remember to abide by the rules found in the sidebar. Any comments found to be breaking these rules will result in a deletion of the comment thread starting from the offending reply. If you see any posts or replies that you feel break the rules of the sub, then report them and **do not respond to them.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singing) if you have any questions or concerns.*"}, {"comment_id": "f54fxx2", "post_id": "dmrq1m", "comment": "Why did the soprano get locked out of her house?\n\nBecause she had the wrong key and didn’t know where to come in"}, {"comment_id": "f54e6fb", "post_id": "dmrq1m", "comment": "Baritones: you guys are in choir?"}, {"comment_id": "f54u3vy", "post_id": "dmrq1m", "comment": ">be baritone\n\n>write own music because I want to sing sometime too."}, {"comment_id": "f55klbu", "post_id": "dmrq1m", "comment": "B: low G, low G, low F, low E\n\nT: High F, High G, High F\n\nBaritone: oh c'mon, not *that* game again..."}, {"comment_id": "f58vrxb", "post_id": "dmrq1m", "comment": "Baritone choir parts are always the weirdest, all the junk notes in the chords."}, {"comment_id": "f55jm3g", "post_id": "dmrq1m", "comment": "A capella: What are words?"}, {"comment_id": "f54pru6", "post_id": "dmrq1m", "comment": "Am I the only one who spent more time than they'd like to admit thinking that 'SATB' was this prolific publisher of choir scores?"}, {"comment_id": "f56498s", "post_id": "dmrq1m", "comment": "Basses are oppressed we must fight the revolution"}, {"comment_id": "f54o6bw", "post_id": "dmrq1m", "comment": "This is so spot on!"}, {"comment_id": "f54nccj", "post_id": "dmrq1m", "comment": "As much as I love singing I get tired of singing every single word in chorus. I love the sound of Altos and I wish the ladies could sing more of the music. (I'm in an all girl choir.)"}, {"comment_id": "f57c0dl", "post_id": "dmrq1m", "comment": "But for real TTBB arrangements be the same in some cases look up libertatum I sang 2nd bass it's suppossed Latin but it's just gibberish"}, {"comment_id": "f57bk8i", "post_id": "dmrq1m", "comment": "That's a little too accurate..."}, {"comment_id": "f589lrj", "post_id": "dmrq1m", "comment": "My least favourite thing ever: being given no words in an arrangement of a song that I know all of the words to, while the sheet music has lyrical errors"}, {"comment_id": "ehi25wz", "post_id": "avuz2k", "comment": "Cries in bass..."}, {"comment_id": "ehi7r33", "post_id": "avuz2k", "comment": "I feel this. I attempted to sing part of the newsies in the tenor range for a Male only part, people heard, all the other males quit singing, and then my voice essentially broke."}, {"comment_id": "ehipnnm", "post_id": "avuz2k", "comment": "Yup. My chest/head voice is just low enough that I can’t sing any pop music in it, but I can sing almost everything in falsetto. My highest note in head voice is an Eb4, but in falsetto, it’s a Bb5. "}, {"comment_id": "ehj52ss", "post_id": "avuz2k", "comment": "I love my bass :3\n\nA bass can just transpose most tenors down 1 octave and be fine. And it is far more unique in Pop and Rock!"}, {"comment_id": "ehie8ol", "post_id": "avuz2k", "comment": "https://youtu.be/BeX0GGGJ1D0"}, {"comment_id": "ehjgws8", "post_id": "avuz2k", "comment": "I've reached a point where I've realised that the majority of songs I can sing in the original key are ones by women with the alto or mezzo-soprano range, that I can usually comfortably sing an octave lower than.\n\nAlthough, some of them go low enough that their songs can be used as a benchmark for my range expanding. Some songs by Lorde go down to like C3. I was struggling to hit the C2, but I can sort of do it now (C2 is a note that I can't hit by itself, but often can as part of a phrase - hopefully with more practice, I'll get better with it).\n\nFor a long time, I thought I was a tenor, because I was hitting the bottom of my range singing along to songs by baritones. It took me a long time to realise that I was attempting to match pitch an octave lower. I think I just sort of heard the characteristic timbre of the bottom of the range, so I went to the bottom of my range, with no regard for the actual octave."}, {"comment_id": "ehi1ywu", "post_id": "avuz2k", "comment": "I’m good, we have Sinatra and all those old jazz crooners, Cash, Jim Morrison, Elvis, etc... "}, {"comment_id": "ehi55eo", "post_id": "avuz2k", "comment": "Danzig too!"}, {"comment_id": "ehixcc6", "post_id": "avuz2k", "comment": "Elvis could go crazy high too!"}, {"comment_id": "ehim0d3", "post_id": "avuz2k", "comment": "Chris Cornell.... What a god.... Brent Smith... Aaron Lewis.\n\nThere are so many fantastic baritones out there.\n\nFair mentions: Eddie Vedder & Scott Weiland"}, {"comment_id": "ehm8ftx", "post_id": "avuz2k", "comment": "Morrissey!"}, {"comment_id": "ehibtrj", "post_id": "avuz2k", "comment": "If it makes you feel better, tenors secretly wish they could sing lower."}, {"comment_id": "ehin4d7", "post_id": "avuz2k", "comment": "This one hurts cause it is true..."}, {"comment_id": "ehjzpxh", "post_id": "avuz2k", "comment": "Is that actually true though?"}, {"comment_id": "ehhws1o", "post_id": "avuz2k", "comment": "Every baritone needs to love their voice. We can still sing all of the songs tenors sing in the original key (with a ton of extra work on our mixed voice) or we can just turn it down a note. The average person isn't going to notice we belted out an A4 instead of a B4 and it sounds much stronger with the weight of our voice when we hit high notes.\n\nAnyways I'm gonna flex on these tenors cuz I'm a lyrical baritone and can hit A4 (and a nasty sounding B4) in songs too lmao get yoted on nerds"}, {"comment_id": "ehi13pl", "post_id": "avuz2k", "comment": ">The average person isn't going to notice we belted out an A4 instead of a B4 and it sounds much stronger with the weight of our voice when we hit high notes.\n\nAdding to this, it is also possible for us to belt with reduced vocal weight if we absolutely insist on sounding like a tenor."}, {"comment_id": "ehi5ssr", "post_id": "avuz2k", "comment": "See I’ve never gotten the hate for Baritones? Maybe that’s ‘cause I used to be one. But typically the Baritones were solid AF in the choir. Tenors never showed up for practice. And when a Baritone hits an A4, it’s pretty dope. \n\nI think if a lot of the Baritones worked on their mixed voices it would give these Tenors a run for their money. ‘Cause I’ve been working on my chest dominant mix and can phrase an F#5. I even held out an E5 with vibrato. These are notes Sopranos struggle with, let alone dudes. \n\nPlus if you train right, you could even act as a Dramatic Tenor, game-changer. "}, {"comment_id": "ehjhd6e", "post_id": "avuz2k", "comment": "Meanwhile my top belt right now is like D4 (possibly E4?)... It's fine...\n\nThe lowest note I can sing in head voice is E3...\n\nMy absolute lowest note is around D2. I can sort of hit a C#2/C2, but it's super breathy to the point of almost being pure air.\n\nI think I'm very firmly bass..."}, {"comment_id": "ehi85r0", "post_id": "avuz2k", "comment": "Tfw you're a bass"}, {"comment_id": "ehieizl", "post_id": "avuz2k", "comment": "You're a lucky man because if you are truly a bass then you have the most unique and rich voice out of them all."}, {"comment_id": "ehhwrnn", "post_id": "avuz2k", "comment": "Most men who think they're baritones are just untrained tenors. Want to see an actual baritone who can sing his ass off, and who sings largely within a comfortable range for a baritone, even though he *can* cover 5 octaves(!), check out Ville Valo (HIM). I'm into the rock/metal side of things but I think even otherwise he's a good example."}, {"comment_id": "ehhxacd", "post_id": "avuz2k", "comment": "Jumping in with this comment. Any baritone that is trained and sings like a baritone will always be better than a baritone attempting to imitate a tenor. Another good example is Matt Corby."}, {"comment_id": "ehi0rs0", "post_id": "avuz2k", "comment": "[deleted]"}, {"comment_id": "ehiae2h", "post_id": "avuz2k", "comment": "+1 for naming an ACTUAL baritone, unlike the guys trying to \"educate\" us that Mercury and Sheeran are baritones lul."}, {"comment_id": "ehiigmy", "post_id": "avuz2k", "comment": "I love Valo's singing. I used to consider him to be a bass, but I'm currently convinced he's more of a baritone with extra low range from smoking.\n\nSadly very few real basses in rock and metal. Peter Steele and the guy from Sleepytime Gorilla Museum are the only two that come to mind."}, {"comment_id": "ehi50oj", "post_id": "avuz2k", "comment": "See this is something I’ve always wondered about with my own voice. When I started singing at like 18, I was classified as a Lyric Baritone. So I learned to sing as a Baritone. But I’ve gotten comments on how my voice sounds better when I “go high”. So that’s always left me wondering if I was an untrained Tenor or what?? But I can go all the way down to a C2. I recently joined an acapella singing group and now I’m singing Tenor. So I really don’t know what to think of my voice type. I call myself a Light Lyric Tenor, but I really don’t know. "}, {"comment_id": "ehile15", "post_id": "avuz2k", "comment": "Agreed! I admire how Ville Valo's low notes sound even more than his highs. Warrell Dane (RIP) was also a great baritone singer. I loved his cover of Lucretia My Reflection and his menacing low drawl through the verses. "}, {"comment_id": "ei5d25i", "post_id": "avuz2k", "comment": "Saw him (eh) live last year and was surprised to see how well he reaches the high notes and it's not just in the studio "}, {"comment_id": "ehi0y2g", "post_id": "avuz2k", "comment": "But... baritones aren't muscular superheros. Or... are we?"}, {"comment_id": "ehi1lx9", "post_id": "avuz2k", "comment": "Our vocal chords are thicker than tenors so I guess we are the guy at the gym that lifts and basses are the muscular superheroes!"}, {"comment_id": "ehi8utb", "post_id": "avuz2k", "comment": "I’m a baritone but I actually wanna be a bass. I love singing lyrics, but singing bass lines and just going low is so just so much more fun for me. To each their own!"}, {"comment_id": "ehi8vbz", "post_id": "avuz2k", "comment": "Amen to that."}, {"comment_id": "ehien7z", "post_id": "avuz2k", "comment": "We are two peas in a pod my dude."}, {"comment_id": "ehijfh8", "post_id": "avuz2k", "comment": "https://youtu.be/4ROGUmsnyDg"}, {"comment_id": "ehjceei", "post_id": "avuz2k", "comment": "I came here to read the comments saying Freddie is a baritone lol"}, {"comment_id": "ehjkqov", "post_id": "avuz2k", "comment": "I don't understand why Baritones are so obsessed with being Tenors?\nI love baritone vocals and I think we need way more of it in modern music. "}, {"comment_id": "ehlojnt", "post_id": "avuz2k", "comment": "Baritones are the most common voice type and Tenors usually get the star power since popular music finds higher voices more exciting. "}, {"comment_id": "ehigywx", "post_id": "avuz2k", "comment": "ITT Pop listeners that are so used to light lyric and leggero tenors dominating the charts they forget that heavier spinto and dramatic tenors exist."}, {"comment_id": "ehhzre6", "post_id": "avuz2k", "comment": "Imagine thinking Freddie Mercury is a tenor"}, {"comment_id": "ehidpgs", "post_id": "avuz2k", "comment": "https://i.imgflip.com/2uwo00.jpg"}, {"comment_id": "ehi0zv5", "post_id": "avuz2k", "comment": "I've always been told he was a natural speaking baritone who preferred to sing up in the tenor range, and that he once turned down a baritone part in an opera duet because he felt his fans wouldn't recognize his baritone voice. Is that true? How can one determine what part a singer naturally is if they always sing up or down an octave? Is there that much difference between a natural tenor and a well-trained baritone who prefers singing tenor parts?"}, {"comment_id": "ehi8030", "post_id": "avuz2k", "comment": "He was a tenor, maybe leave the voice typing to the classically educated folk reddit."}, {"comment_id": "ehimwq5", "post_id": "avuz2k", "comment": "Idk why baritones like Freddie Mercury, Ed Sheeran, and Michael Jackson would want to be tenors like Barry White, Johnny Cash, and Tay Zonday.\n\nThis thread makes no sense. "}, {"comment_id": "ehiss06", "post_id": "avuz2k", "comment": "[deleted]"}, {"comment_id": "ehithf8", "post_id": "avuz2k", "comment": "Replace Freddie with Trippie Redd"}, {"comment_id": "ehjxlyu", "post_id": "avuz2k", "comment": "The screechiest tenor of all time "}, {"comment_id": "ehhzljj", "post_id": "avuz2k", "comment": "I disagree that Freddie Mercury was a tenor...."}, {"comment_id": "ehixzli", "post_id": "avuz2k", "comment": "Can you name a baritone that has done wit their voice as much as he could?"}, {"comment_id": "ehi93h5", "post_id": "avuz2k", "comment": "ITT: pop listeners with no formal experience and ear training for the complexities of voice typing yet overconfidently classify non-classical singers and believe Freddie Mercury and Ed Sheeran are baritones.\n"}, {"comment_id": "ehield8", "post_id": "avuz2k", "comment": "Yeah if you think Freddy Mercury is a tenor you're flat out wrong. Ed Sheeran is the only one that can be argued as both due to his weird tenor timbre but baritone-ish range."}, {"comment_id": "ehi0kh2", "post_id": "avuz2k", "comment": "thanks I hate it"}, {"comment_id": "ehiv01a", "post_id": "avuz2k", "comment": "It's so true :'("}, {"comment_id": "ehjec1o", "post_id": "avuz2k", "comment": "Same thing applies with Sopranos wanting to be mezzos and altos...at least for me lmao"}, {"comment_id": "ehlom9q", "post_id": "avuz2k", "comment": "The female analogy would be Mezzos wanting to be Sopranos. Baritones are the male version of Mezzos.  "}, {"comment_id": "ehjijf5", "post_id": "avuz2k", "comment": "Nope. Not me. Happy Bari. "}, {"comment_id": "ehjq0bb", "post_id": "avuz2k", "comment": "John Lennon,Elvis,Frank Sinatra,Mick Jagger,David Gilmour,David Bowie,Prince,John Mayer,John Legend,R Kelly,Chad Kroeger, Frank Ocean, Ringo Starr, Michael Buble,Troye Sivan, George Ezra,Chris Martin,Axl Rose and if you wish to include baritenors,than possibly Ed Sheeran, Freddie Mercury, Paul McCartney, Robert Plant, Elton John, Hozier,Jimmy Fallon and Peter Gabriel"}, {"comment_id": "ehi34jz", "post_id": "avuz2k", "comment": "Hahaha. That is sometimes me. I'm really trying to learn how to love my light baritone and embrace my voice so I can make it as beautiful and powerful as I can. \nIt's hard when most Pop, Rock, R&B, Gospel, Christian, Country are classified by most as tenors. My favorite artist was a higher tenor. I could only reach his notes in head voice. \nNow, as I'm older and my tastes have expanded, I'm doing so training, exercises everyday, I just want to expand my range, be able to hit those notes clearly, properly and with ease and style. I'm learning to love my voice. \nTenors are amazing! \nBaritones are amazing! \nBasses are amazing!"}, {"comment_id": "ehibtjt", "post_id": "avuz2k", "comment": "Definitely sending this to all of my baritone friends"}, {"comment_id": "ehihpx4", "post_id": "avuz2k", "comment": "I'm a tenor and for me is the opposite."}, {"comment_id": "ehiis6j", "post_id": "avuz2k", "comment": "So goddamn true."}, {"comment_id": "ehjbyrp", "post_id": "avuz2k", "comment": "I could totally relate to this 😂😅🙁"}, {"comment_id": "ehjchf9", "post_id": "avuz2k", "comment": "Fr though. I've spent so much time trying to sing tenor songs that I've essentially damaged part of my voice. A couple of notes in the middle of my head voice are extremely inconsistent now."}, {"comment_id": "ehjo5zu", "post_id": "avuz2k", "comment": "C'mon deep voices are super sexy "}, {"comment_id": "ehjrm2d", "post_id": "avuz2k", "comment": "How do i find out what i am? "}, {"comment_id": "ehjscks", "post_id": "avuz2k", "comment": "T R A N S P O S E "}, {"comment_id": "ehju03r", "post_id": "avuz2k", "comment": "Hi! I would like to point out few things:\n\nIt’s very difficult to categorize untrained singers because all of their range sounds similar (bad). Lower tenors think they are baritones because their lower notes are easy, but don’t necessarily sound good, but this is the range where they speak, so it is way more used and trained than their high notes. Once they start to train their high notes and relax up there, they realize ”ohhh, woah, I’m confused about my voice type”.\n\nSimilarly, I used to sing with a guy who I could have sworn was some kind of tenor, because his lower range sounded very weak and he was very soft spoken and had really good sounding projected higher notes.\n\nThen randomly over like 4 days or so, he learned how to project his lower range. The change was pretty ridiculous. (He also started to speak in a loud projected way)"}, {"comment_id": "ehju7zb", "post_id": "avuz2k", "comment": "peoples are obsessed with all the wrong things, you can achieve whatever you want to achieve, if the whole issue is range then your not limited, just keep working on it \n\n&#x200B;\n\ntone is far more important than range "}, {"comment_id": "ehjvfd7", "post_id": "avuz2k", "comment": "I'm sad at how true this is!! :( this is why I'm trying to learn the treacherous mixed voice. Apparently it takes up to 3 years to strengthen lol."}, {"comment_id": "ehjxtd0", "post_id": "avuz2k", "comment": "Well I'm a lyric tenor and I love the richness in Baritone voices.  I think music would benefit from more baritones and basses tbh. "}, {"comment_id": "ehk343g", "post_id": "avuz2k", "comment": "I feel attacked\n\n(true, tho)"}, {"comment_id": "ehkcf7c", "post_id": "avuz2k", "comment": "What about altos? "}, {"comment_id": "ehkmjmg", "post_id": "avuz2k", "comment": "Rip I have the lowest voice of anyone I know I have to drop every song at least an octave"}, {"comment_id": "ehkzdgn", "post_id": "avuz2k", "comment": "I’m in the opposite field. I can sing fairly high but I want to go lower. "}, {"comment_id": "ehpbh4d", "post_id": "avuz2k", "comment": "It’s okay!!"}, {"comment_id": "ehr75pd", "post_id": "avuz2k", "comment": "Haha I'm pretty much the same though I've realized now that with training I should be able to sing an A4 which is all I need to be a great singer! \n"}, {"comment_id": "ej024f3", "post_id": "avuz2k", "comment": "My lowest note is a G2 but my highest is an E5 in full voice, not falsetto. Idk if I’m a baritone or a tenor, and whether my high notes are my chest notes or head voice because they sound powerful and strong with diaphragmatic support but it sounds a lot higher then my normal like talking voice. I can glide from my lowest note to my highest note without feeling a change in technique or where the sound is coming from, unlike when I go from my highest note into my falsetto range. I can feel a change there. Also I’m 14 and still going through puberty and my voice is changing, and I’ve had no singing lessons and only have been singing for around 5 months by myself."}, {"comment_id": "ekdax4v", "post_id": "avuz2k", "comment": "Funny because Freddie Mercury was a baritone. [https://reverb.com/news/scientific-study-confirms-freddie-mercury-voice-was-one-of-a-kind](https://reverb.com/news/scientific-study-confirms-freddie-mercury-voice-was-one-of-a-kind)"}, {"comment_id": "epzsaa5", "post_id": "avuz2k", "comment": "as an alto, i feel exactly the same when watching sopranos :("}, {"comment_id": "ehhyt4x", "post_id": "avuz2k", "comment": "I like how they think Ed Sheeran is a tenor lmaooo"}, {"comment_id": "ehhz5x3", "post_id": "avuz2k", "comment": "He's a lower weighted tenor for sure. I don't think he's a lyrical baritone, maybe baritenor but not entirely. That's the problem with classifying voices. Everyone's voice is unique and you can't place humans into categories like that."}, {"comment_id": "ehhzimb", "post_id": "avuz2k", "comment": "I would say he's a tenor. He's got a bit more weight, he's no Justin Timberlake, but I wouldn't call him a baritone."}, {"comment_id": "ehixalw", "post_id": "avuz2k", "comment": "Freddie is a baritone"}, {"comment_id": "ehikgo5", "post_id": "avuz2k", "comment": "During the process of learning better vocal technique to be able to mix E-F5 consistently, my true tenor tone came out, and... kinda wish I could go below a G2 ever .-. lowkey jealous of deep powerful singers. All voices are beautiful in their own ways though💚"}, {"comment_id": "ehk1wsl", "post_id": "avuz2k", "comment": "Wasn't Freddie Mercury considered a baritone?"}, {"comment_id": "ehjfkcn", "post_id": "avuz2k", "comment": "Ed sheeran a tenor? \n\nLooool"}, {"comment_id": "f352b8o", "post_id": "dfpyp8", "comment": "Thanks for posting to r/singing! **Be sure to check [the FAQ](https://www.reddit.com/r/singing/wiki/index)** to see if any questions you might have have already been answered! Also, remember to abide by the rules found in the sidebar. Any comments found to be breaking these rules will result in a deletion of the comment thread starting from the offending reply. If you see any posts or replies that you feel break the rules of the sub, then report them and **do not respond to them.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singing) if you have any questions or concerns.*"}, {"comment_id": "f354d3z", "post_id": "dfpyp8", "comment": "it hurts cause its true"}, {"comment_id": "f35lle1", "post_id": "dfpyp8", "comment": "And/or possibly the singers cough you developed while trying to figure out head voice and don't know how to fix properly."}, {"comment_id": "f35pokl", "post_id": "dfpyp8", "comment": "I got quite far with them tho.  You just gotta master the Dunning Kruger effect"}, {"comment_id": "f35dn8c", "post_id": "dfpyp8", "comment": "Me trying to figure out head voice"}, {"comment_id": "f35fhob", "post_id": "dfpyp8", "comment": "Chest to falsetto. Find the break. Attack the break everyday. Repeat."}, {"comment_id": "f35hdwl", "post_id": "dfpyp8", "comment": "I find teachers can be just as bad"}, {"comment_id": "f35331b", "post_id": "dfpyp8", "comment": "Free wrong information *"}, {"comment_id": "f35mka3", "post_id": "dfpyp8", "comment": "The worst part is when it is wrong for some but right for others ...."}, {"comment_id": "f35nqmy", "post_id": "dfpyp8", "comment": "Also, I am learning subharmonic rn. Real cool. I am also a beatboxer with throat bass and other bass sounds"}, {"comment_id": "f35ufwx", "post_id": "dfpyp8", "comment": "Dude I met Zhangze last week that dude is unreal."}, {"comment_id": "f37uzxg", "post_id": "dfpyp8", "comment": "Subharmonics are really cool. I could tune a bass guitar with mine since I can go down to an E1 lol. I can hit a really really strong B1 by sorta throat singing."}, {"comment_id": "f36fn1h", "post_id": "dfpyp8", "comment": "Hahaha yeah, but it has less to do with using free information and more to do with not actually singing."}, {"comment_id": "f358qlm", "post_id": "dfpyp8", "comment": "I've been teaching voice for 28 years, studied voice for 41 years, and post here regularly.   Of course, YouTube is no substitute for having your own private teacher, BUT you can learn a lot of great ideas if you choose carefully.  Just like your supermarket is filled with junk food as well as healthy choices, YouTube has junk as well as some really great tutorials.  For example, I am a well-respected teacher who has taught internationally (including teaching at colleges) with a long-established clientele, and I am on YouTube to build a global online following.  My YouTube channel is filled with VALUABLE  info (not useless chit chat) in everyday language that gives you quick fixes, as well as long term solutions, besides being entertaining (Victoria Rapanan - Healthy Vocal Technique).  I give many of the same tips for free that I teach my private students for a very professional rate.  If you want to have a look, here is the link to the channel. [https://www.youtube.com/user/vrsing](https://www.youtube.com/user/vrsing)"}, {"comment_id": "f35gnfk", "post_id": "dfpyp8", "comment": "[deleted]"}, {"comment_id": "f3785lf", "post_id": "dfpyp8", "comment": "genuine question is there any way to learn to sing without having to fork out £30-40 ($40-50) per hour"}, {"comment_id": "f37wwwe", "post_id": "dfpyp8", "comment": "Yes? Get a cheaper teacher or do less frequent lessons."}, {"comment_id": "f37cmch", "post_id": "dfpyp8", "comment": "Honestly, learning to scream was quite easy. Singing is harder than all my essays I have due"}, {"comment_id": "f3aohmj", "post_id": "dfpyp8", "comment": "I kind of agree, feels like there are way more good  sources for learning distorted vocals than for just singing"}, {"comment_id": "f35gcg3", "post_id": "dfpyp8", "comment": "[deleted]"}, {"comment_id": "f35j1fh", "post_id": "dfpyp8", "comment": "Then again credentials don’t mean anything either.  Many people with credentials know nothing really\n\nCredentials mean nothing.  You can’t measure the quality of a voice teacher by credentials.  Only by before and after results and showing their results.  \n\nGood teaching doesn’t involve specifically involve knowledge of anatomy or pseudoscientific trivia and abstract theoretical bullshit.  It involves results.  No matter what you know or don’t know it’s the results that matter.  Singing is not a matter of how much facts you know but how much you truly understand the kinesthetic act and can impart that to the student.  It involves understanding the voice truly.  Which is not just physical BUT AND THIS IS A HUGE BUT, also acoustic and aural.  You can understand the voice and have wrong concepts of sounds and teach wrong sounds and not really know what you’re hearing because you lack the aural understanding and don’t really understand right from wrong or why or what kind of sound you’re working towards or what sound is more or less efficient or how to move the voice in that direction etc.  And if you don’t know this, then anything one may know is completely useless. \n\nAnd almost no one really understands this anymore, which is directly related to poor teaching of today.  You can’t teach well if the wrong sounds are being taught as right"}, {"comment_id": "f35ikok", "post_id": "dfpyp8", "comment": "too true"}, {"comment_id": "f35j6s1", "post_id": "dfpyp8", "comment": "This is so accurate it hurts"}, {"comment_id": "f35vv3o", "post_id": "dfpyp8", "comment": "me lol"}, {"comment_id": "f36qgzw", "post_id": "dfpyp8", "comment": "me every day for the past 5 years"}, {"comment_id": "f375ej8", "post_id": "dfpyp8", "comment": "#THE ACCURACY#"}, {"comment_id": "f37d5zg", "post_id": "dfpyp8", "comment": "ME"}, {"comment_id": "f37d9fw", "post_id": "dfpyp8", "comment": "I have a bazillion tabs opened in mu browser with videos about singing"}, {"comment_id": "f38k5fb", "post_id": "dfpyp8", "comment": "Ha ha ha ha"}, {"comment_id": "f35h49s", "post_id": "dfpyp8", "comment": "Many of us on the internet have public profiles that are completely transparent.  You can search for me easily and find out my complete background.  You can look up my profile here on reddit or just go to my website, [www.healthyvocaltechnique.com](https://www.healthyvocaltechnique.com).  Sure, there are plenty of charlatans anywhere online, but hopefully you can use your common sense and do your own research.  Anyone is welcome to look at all of my credentials.  Meanwhile, my youtube channel is [https://www.youtube.com/user/vrsing](https://www.youtube.com/user/vrsing) if you are interested in serious learning."}, {"comment_id": "f35n2xm", "post_id": "dfpyp8", "comment": "[deleted]"}, {"comment_id": "f360107", "post_id": "dfpyp8", "comment": "Seeing a voice coach in person should always be the first option if the opportunity presents itself  though"}, {"comment_id": "f36t7ky", "post_id": "dfpyp8", "comment": "I u/Artistry1 wanna know who those teachers are."}, {"comment_id": "f35h6zp", "post_id": "dfpyp8", "comment": "Lmfao"}, {"comment_id": "eik8z8i", "post_id": "b19l2s", "comment": "Thanks for posting to r/singing! **Be sure to check [the FAQ](https://www.reddit.com/r/singing/wiki/index)** to see if any questions you might have have already been answered! Also, remember to abide by the rules found in the sidebar. Any comments found to be breaking these rules will result in a deletion of the comment thread starting from the offending reply. If you see any posts or replies that you feel break the rules of the sub, then report them and **do not respond to them.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singing) if you have any questions or concerns.*"}, {"comment_id": "eikk2aj", "post_id": "b19l2s", "comment": "See I don't think this is a bad thing. I'm a baritone and love the weekends songs but I can't hit B4 in chest with a light agile tone that he has as a high tenor. So I either lower it a note to hit it in mix or lower it two notes to hit it in chest and have proper phrasing.\n\nYou gotta sing songs in the register that suits your voice. The high note will still sound high for your voice. Even people that know nothing about singing will be able to tell it's a high note due to the weight of your voice ya feel?"}, {"comment_id": "eiku97h", "post_id": "b19l2s", "comment": "Exactly. I don't see what's wrong with changing the pitch of a song to suit your voice. E.g. I love to sing male songs, but I'm not a man, so I have to change the pitch drastically for those to something that works for my voice. It's not a failing. It just is what it is.\n\nThere is this weird idea that singers who can't go high are somehow less good because of that. I was watching an interview of a famous Bollywood singer the other day, and she was talking about how when she was first trying to get into the industry, she was auditioning for a music director and she sang a song that's originally in an extremely high key, and lowered the pitch to do so. And the music director was like, \"That's nice - now sing it in the original key.\" She said she couldn't go that high and he told her to go off and practice and come back when she could - essentially dismissing her just because she wasn't a soprano even though she had sung the song well."}, {"comment_id": "eikvsc3", "post_id": "b19l2s", "comment": "u/digiitalz There's no shame in doing so. I know you love the weeknd's songs too hahahahahah."}, {"comment_id": "eimj9dx", "post_id": "b19l2s", "comment": "Yeah bass baratone here, my singing tutor hounded me to embrace my voice and not try and force myself up to singing tenor which I was mercilessly trying to do in the early days. I absolutely love my voice now and happily drop the key of songs to make them more accessible but also allow me to use my range better and sound better."}, {"comment_id": "eis7bqo", "post_id": "b19l2s", "comment": "yeah imo the issue isnt really that they can't hit the high note, but that it won't be in the right part of the voice. like if you're supposed to belt an F5, common in some songs by women, most women aren't going to be able to do that except in head voice, so you lower the key to hit it in chest voice or mix depending on the style you're going for"}, {"comment_id": "ejtct3o", "post_id": "b19l2s", "comment": "Because then you hate yourself for being a fraud, that's why! "}, {"comment_id": "eikjer0", "post_id": "b19l2s", "comment": "Its either lower the pitch or replace it with runs lol"}, {"comment_id": "eikbzod", "post_id": "b19l2s", "comment": "[deleted]"}, {"comment_id": "eikc0r2", "post_id": "b19l2s", "comment": "AHAHAHAAHA 😂💀😂"}, {"comment_id": "eil0val", "post_id": "b19l2s", "comment": "I wish I could do this in musical theater"}, {"comment_id": "eim99lw", "post_id": "b19l2s", "comment": "f"}, {"comment_id": "eikq41u", "post_id": "b19l2s", "comment": "So you're saying, \"I can't beat my voice into submission. I have to surrender to my current vocal powers, and use its pitch as my own\". Too much pressure."}, {"comment_id": "eilm23d", "post_id": "b19l2s", "comment": "This is me except I sing low notes higher lol"}, {"comment_id": "eimoswz", "post_id": "b19l2s", "comment": "Me every time I used to sing \"I'm Not That Girl\" from Wicked\n\nI *technically* have that super low E3 note, but only when the stars align."}, {"comment_id": "eil0p4z", "post_id": "b19l2s", "comment": "cant relate  \n\n\n  \n(soprano)"}, {"comment_id": "eil1ale", "post_id": "b19l2s", "comment": "Those damn sopranos"}, {"comment_id": "eimnwqo", "post_id": "b19l2s", "comment": "I’m also a soprano and I do this in reverse :s"}, {"comment_id": "eimplwr", "post_id": "b19l2s", "comment": "&#x200B;"}, {"comment_id": "eimopzw", "post_id": "b19l2s", "comment": "Even as a soprano I've this this before lol\n\nI probably could've sung the Mozart aria I used to audition for my current music school in the original key, but it was nicer a tone down. So I did it and they seemed to not even care."}, {"comment_id": "eikyhdu", "post_id": "b19l2s", "comment": "I’m a female with a deeper voice so I totally do this 😂"}, {"comment_id": "eil5ohj", "post_id": "b19l2s", "comment": "My main wish is to be able to produce high notes with strength without moving into belting.  My high notes are very 'light'.  "}, {"comment_id": "evmxu3i", "post_id": "b19l2s", "comment": "ugh same in the first chorus of freeze your brain he hits the notes in a way that it doesnt sound good belting but i cant do it w/o that or head voice"}, {"comment_id": "eikzqw4", "post_id": "b19l2s", "comment": "I mean you need to able to have good lower notes to do this so in terms of range youre good."}, {"comment_id": "eis70wy", "post_id": "b19l2s", "comment": "but we all know that range means higher range, not actual range. for example c4-c6 would be a wider range than g3-b5, just random example. even though the latter is technically wider, the former is a semitone higher, so it's considered \"wider\""}, {"comment_id": "f1r3z2o", "post_id": "dan1y9", "comment": "Thanks for posting to r/singing! **Be sure to check [the FAQ](https://www.reddit.com/r/singing/wiki/index)** to see if any questions you might have have already been answered! Also, remember to abide by the rules found in the sidebar. Any comments found to be breaking these rules will result in a deletion of the comment thread starting from the offending reply. If you see any posts or replies that you feel break the rules of the sub, then report them and **do not respond to them.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singing) if you have any questions or concerns.*"}, {"comment_id": "f1rlbk9", "post_id": "dan1y9", "comment": "Ha. Tenors. That’s a good one right there."}, {"comment_id": "f1rahtk", "post_id": "dan1y9", "comment": "*Barbershop baritones laughing maniacally in the distance*"}, {"comment_id": "f1x0d0l", "post_id": "dan1y9", "comment": "What's with the whole \"barbershop\" *insert vocal type* thing I don't get it. What does it mean?"}, {"comment_id": "f1rsske", "post_id": "dan1y9", "comment": "As a bassritenor, I don't get these memes /s"}, {"comment_id": "f1t6ou0", "post_id": "dan1y9", "comment": "That word irritated me. Baritenor I knew, but this is awesome! I am a bassritenor as well ;D"}, {"comment_id": "f20eq7l", "post_id": "dan1y9", "comment": "Mood"}, {"comment_id": "f1rkj5p", "post_id": "dan1y9", "comment": "I’m a tenor who wishes I could hit the notes that baritones can. I can belt C5’s with ease but when it comes to anything below an E3, I suck butt."}, {"comment_id": "f1ruczm", "post_id": "dan1y9", "comment": "I'm a tenor that thought he was a baritone for the first two years of his singing. My range is F2-C5 in chest/mix at the moment, with pure head voice leading up to B5. \n\nI focused a lot on my low notes early on because I was more comfortable there and over time I gained a lot of comfort in my low range. My entire F2-C3 is usable, although I have to lower my larynx for a F2 and it doesn't have the same weight to it as a baritone or bass, but hey it's still usable."}, {"comment_id": "f1ryee2", "post_id": "dan1y9", "comment": "Tenors and basses are extremists >:("}, {"comment_id": "f1sjhsk", "post_id": "dan1y9", "comment": "I'm a baritone. My range is G2-C5 typically. I am mighty."}, {"comment_id": "f1spovu", "post_id": "dan1y9", "comment": "Is'nt that a tenor?"}, {"comment_id": "f1vjqmr", "post_id": "dan1y9", "comment": "Yeah, my tessitura tops out at around C5 to D5 and I'm *definitely* a baritone. Like, if you listened to my speaking voice for 30 seconds you'd say baritone."}, {"comment_id": "f1rxqji", "post_id": "dan1y9", "comment": "Bruh"}, {"comment_id": "f1scmgb", "post_id": "dan1y9", "comment": "What range is a F2 to G4, but shit at all ranges? \n\nThat should be a garbage baritone yes?"}, {"comment_id": "f1siltw", "post_id": "dan1y9", "comment": "\"What range is a F2 to G4, but shit at all ranges? \"\n\nJust a beginner. Just keep practicing, bro, we're all gonna make it."}, {"comment_id": "f1se8fb", "post_id": "dan1y9", "comment": "I'm like Mitch Grassi or Chris Colfer except without the low notes. So I'm incredibly jealous of regular tenors, let alone baritones or basses."}, {"comment_id": "f1tq9jd", "post_id": "dan1y9", "comment": "Ass a bass-baritone i cant sing high but at least i can touch A1 in chest"}, {"comment_id": "f1ud9dj", "post_id": "dan1y9", "comment": "Funny but\n\nBaritones often sing high\n\nI hate to crash your joke\n\nBut baritones often sing high\n\nI'm a basso profundo and I cant sing high\n\nBut i'm not sure that applies\n\nTo all of us basso guys\n\nI hate to crash your joke but i'm not a sentimental bloke\n\n(Baritones can't sing high?? hmmm)"}, {"comment_id": "f1x9sht", "post_id": "dan1y9", "comment": "I’m a baritone but my range is C2-A4-D5-D#6. My teacher always told me it was the baritones who sing highest and are the real counter tenors."}, {"comment_id": "f1sdggg", "post_id": "dan1y9", "comment": "Thank you for this meme"}, {"comment_id": "f1spedq", "post_id": "dan1y9", "comment": "I like baritones a lot. My two favorite r&b voices right now, ty dolla sign and frank ocean, are baritones"}, {"comment_id": "f1vjyvb", "post_id": "dan1y9", "comment": "Baritones make up the majority of men so it's nothing to be ashamed of. Some of the best pop singers in history - Freddy Mercury for example - were or are baritones."}, {"comment_id": "f1ut0ih", "post_id": "dan1y9", "comment": "My range is F#2-G4. (Not counting falsetto) anyone know what I am?"}, {"comment_id": "f2m49mi", "post_id": "dan1y9", "comment": "100% baritone \nYou perfectly fit the description"}, {"comment_id": "f1vdqqj", "post_id": "dan1y9", "comment": "Fuck yeah we can. The sopranos in my chorus make fun of what little of us there are already."}, {"comment_id": "f1vwh6u", "post_id": "dan1y9", "comment": "Hey that's not funny! :("}, {"comment_id": "f1wk1yr", "post_id": "dan1y9", "comment": "I'm a baritone/bass who is a dumb bitch. Mainly because I don't know the actual notes of my range."}, {"comment_id": "f1wwzwf", "post_id": "dan1y9", "comment": "But they can Eddie Vedder"}, {"comment_id": "f2oom3c", "post_id": "dan1y9", "comment": "I've got G2 to an F5, although my intonation is wack"}, {"comment_id": "f4iwyhs", "post_id": "dan1y9", "comment": "Lol it is if you wsvt to live with me in cotpud vhtidyi texas"}, {"comment_id": "f1rns95", "post_id": "dan1y9", "comment": "r/musicmemes"}, {"comment_id": "f1va5go", "post_id": "dan1y9", "comment": "Y Cub huh hb"}, {"comment_id": "f1va5h4", "post_id": "dan1y9", "comment": "Y Cub huh hb"}, {"comment_id": "f1s8tcj", "post_id": "dan1y9", "comment": "I'm a tenor /soprano but I can go down to the second octave sometimes on a good day !!!!\nIf you'd like please subscribe to my YouTube channel where I make covers sometimes!!!\nhttps://www.youtube.com/channel/UCtAtYQ25GCHORhrqhHo6qBg"}, {"comment_id": "exh9cst", "post_id": "cswgzd", "comment": "Thanks for posting to r/singing! **Be sure to check [the FAQ](https://www.reddit.com/r/singing/wiki/index)** to see if any questions you might have have already been answered! Also, remember to abide by the rules found in the sidebar. Any comments found to be breaking these rules will result in a deletion of the comment thread starting from the offending reply. If you see any posts or replies that you feel break the rules of the sub, then report them and **do not respond to them.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singing) if you have any questions or concerns.*"}, {"comment_id": "exhal7t", "post_id": "cswgzd", "comment": "I’m still salty that puberty screwed me over \n\n*cries in baritone*"}, {"comment_id": "exheaf5", "post_id": "cswgzd", "comment": "Low register is a blessing. It's A LOT easier for a bass to imitate a tenor than vice versa."}, {"comment_id": "exhmm5v", "post_id": "cswgzd", "comment": "Jesus fuck... a lot of you guys are just Baritones who haven’t trained enough in order to sing high. You guys can also be in fact ACTUAL TENORS who also have yet to: mature, sing and train enough (vocal development is complete from 25-30 years old)\n\nDuring two years, I spent six months of training until now as a 21 years old to discover that I was not even a « Low Tenor ». I’m a light Tenor like most young Tenor voices. And that revelation is proven by my REAL passagio (F4/F#4) which took me those six months to discover. \n\nA lot of you haven’t even taken a vocal lesson and then when you break at D#4, you go into the « Baritone Curse » depression mode when you don’t even know how your voice functions and where you lie technically. Some of you like to talk about your « supported » Baritone F#4 and A2 but nah, that’s just you trying to fool yourself, thinking that one month of practice is already enough to strengthen support. And trust me, I LIVED THROUGH THAT PHASE, I know what I’m talking about.\n\nAs for the real Baritones, look at Countertenor singers singing operas of the XVIIIth century, they’re MOSTLY BARITONES. The arias they perform are often filled with passages that showcase castrati’s virtuosity: extremely fast and extended runs, high notes jumping all over the place, etc... such difficulty, yet so many Countertenors are riding those phrases with relative ease. That take some years of training from your chest to head register. I only know of two professional Countertenors who are naturally Tenors. \n\nMen’s voices are generally the same when it comes to speaking. Chest dominant and tend to go towards the Baritone colour and range. When you sing, it’s a different story. Not only you sing differently than you talk, but Tenors (SHOULD) use a different, lighter approach than lower voices to reach their high notes. They have a smaller voice, so we can’t really bring our modal voice from G4 to C5 without using some covering, even if we can sing higher than you naturally. Speaking about singing higher, I’ve met some really heady Baritones and some really thick Tenor voices that may confuse the inexperienced listener. \n\nDon’t be afraid to use your head voice (falsetto, mixed voice are in the same category for us classical vocalists). Lower voices have a better extension in the head voice than Tenors do. Sing in a way that’s comfortable for you. Don’t rush. Good results will come. You just need to be patient. And DON’T BE OBSESSED with voice types, ESPECIALLY FACH which has nothing to do with you if you don’t sing operas from Rossini to Romanticism (from Baroque to early Classicism, it’s almost exclusively Lyric Tenors)"}, {"comment_id": "exixsgh", "post_id": "cswgzd", "comment": "I didnt read all the comment but from what i did i do agree. I always thought i was a mid baritone. Only hit them high from head voice. I did one vocal lesson a few weeks ago amd turn out im a tenor..... she had songing in G# key and doing my high loud and proud indead of useong quite head voice. \n\nNow latey ive been learning and particing bon jovi dead or alive. Used to stay away from that song since my friend who is a tenor keep tellig me that song pretty high and he can hit it. Akd everyone told me i had a lower voice. Vut now i had a lesson ajd stop veing scared of my higherregistry i find i can do dead or alive with ease. \n\nMoral of rhe story stop tying to classfy yourself get a few lesson under your belt."}, {"comment_id": "exhs5qg", "post_id": "cswgzd", "comment": "In opera a tenor should still sound like a man, no lightening unless it is to singing softly (towards a falsetto sound)."}, {"comment_id": "exiehsl", "post_id": "cswgzd", "comment": "> Not only you sing differently than you talk\n\nI tend to talk in a baritone range but sing tenor. Actually, someone diagnosed me as possibly talking in too low of a pitch for my voice. However, when I relax, my pitch drops, and it's hard to conscientiously keep my voice at a good pitch. On certain days, my voice has dropped into the bass ranges, which is very dangerous\n\nWhenever I start lessons with a new teacher, I made to make sure to start out with a song that hits around a C5 to make them know that I should target tenor"}, {"comment_id": "exjvrac", "post_id": "cswgzd", "comment": "[deleted]"}, {"comment_id": "f0bi3o3", "post_id": "cswgzd", "comment": "I am pretty sure that my second passagi is at E4 . But I cannot go below G2 , and my tone is quite light . I need to increase my volume for anything in f4 to A4 ( extreme , top out in mix voice) . What do you reckon ?"}, {"comment_id": "exlksuh", "post_id": "cswgzd", "comment": "I always enjoy reading your comments, with that said, if a Lyric Tenor's passaggio is around F4/F#4, where is the normal Tenor's passaggio? Also, are there any exceptions to this? I believe that my break is around F#4 or G4, yet I sound like a standard or dramatic Tenor at *best*.\n\nAlso, you advised that I shouldn't go over F4 for now, but what would be a healthy range for my falsetto? Should I even use it at all with my current level of experience?"}, {"comment_id": "exhblep", "post_id": "cswgzd", "comment": "Laughs in soprano. Low notes are cool though."}, {"comment_id": "exj3lpq", "post_id": "cswgzd", "comment": "A lot of people think being tenor means that you can sing C5 just like that. I’m a tenor and i can’t sing shit above G4 because my technique is bad"}, {"comment_id": "exhg0fu", "post_id": "cswgzd", "comment": "This meme is incomplete cause its not giving a point of reference,  whos addressed here? Bass ? baritone ?"}, {"comment_id": "exhge3l", "post_id": "cswgzd", "comment": "Any male voice type that isn't a tenor. I.e. basses and baritones. I'm a lyric baritone myself and I constantly read that lyric baritones can sing tenor in both choral and classical music."}, {"comment_id": "exie6wa", "post_id": "cswgzd", "comment": "I'm a tenor that can sing really high. Throughout my life, I wanted to be able to sing and speak with the likes of Johnny Cash with the power he can deliver, but in reality, my low notes aren't as strong as his. I loved that Mufasa voice! \n\nI'm glad I can do a lot of rock songs, but there's always that desire in me to have that power in the low notes"}, {"comment_id": "ezae66e", "post_id": "cswgzd", "comment": "Let's just say there's a reason why people in the tenor line are sometimes called man-pranos."}, {"comment_id": "exhatvc", "post_id": "cswgzd", "comment": "[deleted]"}, {"comment_id": "exhb1ek", "post_id": "cswgzd", "comment": "He's crush from Finding Nemo"}, {"comment_id": "exhic1m", "post_id": "cswgzd", "comment": "lvl up dude.."}, {"comment_id": "exicnxu", "post_id": "cswgzd", "comment": "All my life ive been trying to bring my range into tenor territory. Ive just barely been able to hit an A cleanly in my chest voice. Now i gotta smooth that break between head and chest...."}, {"comment_id": "exmwiig", "post_id": "cswgzd", "comment": "That break between chest and head is around F4/F#4... unless you’re not talking about mixed voice but the full on head voice, which is located at Bb4/B4 for Tenors.\n\nYour « bring my range into tenor territory » phrase makes me think that you’re another underdeveloped singer who’s yet to understand his voice. A4 is an incredibly high note. If you can go past F#4 in chest voice at the beginning stage of your training, that’s already a big achievement as a Tenor. \n\nDon’t rush, you’re not going to magically hit that A4 tomorrow so work slowly with what you’ve got first. It took me two months of almost daily training to conquer a G4 and go up to this A4 as of now."}, {"comment_id": "f0n6tv1", "post_id": "cswgzd", "comment": "Laughs in male alto."}, {"comment_id": "f49qpgm", "post_id": "dk1whw", "comment": "Thanks for posting to r/singing! **Be sure to check [the FAQ](https://www.reddit.com/r/singing/wiki/index)** to see if any questions you might have have already been answered! Also, remember to abide by the rules found in the sidebar. Any comments found to be breaking these rules will result in a deletion of the comment thread starting from the offending reply. If you see any posts or replies that you feel break the rules of the sub, then report them and **do not respond to them.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singing) if you have any questions or concerns.*"}, {"comment_id": "f49r7qx", "post_id": "dk1whw", "comment": "Angry tenors: “bUt JoHn LEgEnd Is A TeNOr”"}, {"comment_id": "f49uwoc", "post_id": "dk1whw", "comment": "bUt FrEddIe MErCuRy wAs A BaRiToNe"}, {"comment_id": "f4ana6o", "post_id": "dk1whw", "comment": "At first I thought he was a tenor, but then I listened to his speaking voice..."}, {"comment_id": "f49xxrd", "post_id": "dk1whw", "comment": "i’m not even a baritone but y’all deserve better 😔"}, {"comment_id": "f4akopx", "post_id": "dk1whw", "comment": "tfw most pop songs sung by males are in a range you can't hit \n*cries in baritone*"}, {"comment_id": "f4antud", "post_id": "dk1whw", "comment": "You can always learn to sing in Falsetto"}, {"comment_id": "f4bzipj", "post_id": "dk1whw", "comment": "Tfw most songs in the world are in a range you can't reach in your dreams *cries in shitty contralto*"}, {"comment_id": "f4cjcfb", "post_id": "dk1whw", "comment": "Sometimes u just gotta switch genres"}, {"comment_id": "f4ati7a", "post_id": "dk1whw", "comment": "Is that E6 in head voice? Asking for a friend."}, {"comment_id": "f49yjjx", "post_id": "dk1whw", "comment": "I never understood the hate Baritones get."}, {"comment_id": "f49zgw2", "post_id": "dk1whw", "comment": "I think most of it is made up so people can meme about it."}, {"comment_id": "f4a4932", "post_id": "dk1whw", "comment": "They really don't. In this sub people with no training say that they're \"just tenors\" and that's why they dont have an upper range, all the while either ignoring the baritones who sing pop or re-classifying them as tenors.\n\nTo Freddy Mercury in particular, listen to Queen albums. He shows off his lower range in many of their not quite as popular songs. And also those insanely high notes like the Bb6(?) in Bohemian Rhapsody were sung by the drummer."}, {"comment_id": "f4a8hhy", "post_id": "dk1whw", "comment": "It's really not even that people hate baritones. Baritones just seem to hate themselves because \"they can't hit high notes.\" Anytime a baritone says that I know they're completely untrained. F4 - C5 don't magically disappear out of your range because you're a baritone."}, {"comment_id": "f49zicm", "post_id": "dk1whw", "comment": "This is because most of us baritones cannot sing consistently over f4 , which is the range where most of the trashy pop songs lie :("}, {"comment_id": "f4a0bhv", "post_id": "dk1whw", "comment": "Never witnessed hate towards baritones in my life. Where did you experience this?"}, {"comment_id": "f4bpfdj", "post_id": "dk1whw", "comment": "Basically it's the eternal thing where you want what you don't have. So tenors are jelly of the rich tone baritones have and mask it by mocking them. Meanwhile baritones are jelly of the high notes (though I should say I have heard some baritones mailing some pretty high notes)"}, {"comment_id": "f49zy4n", "post_id": "dk1whw", "comment": "There's also Nat King Cole, Mick Jagger, Frank Sinatra, Elvis Presley, David Bowie, Prince, Michael Buble, Scott Hoying...\n\nNot in any particular order, and the list goes on."}, {"comment_id": "f4eek4v", "post_id": "dk1whw", "comment": "thats exactly the problem for most baritones, there are close to none in todays popular music. notice how you failed to name at least one thats relevant these days."}, {"comment_id": "f4asbgy", "post_id": "dk1whw", "comment": "Disagreed about Prince and Buble."}, {"comment_id": "f4b2g2x", "post_id": "dk1whw", "comment": "Baritones have beautiful voices. And those who think that they can't hit high notes are not really correct as high notes are a skill. One that can be trained."}, {"comment_id": "f4frorf", "post_id": "dk1whw", "comment": "Hitting the notes isn't enough in a lot of cases. Many baritones could technically belt a few tones comfortably in the upper ranges.  But some placements of notes, even vowel sounds, in music are easier than others. In a lot of pop music for men these days, it's written in a way that's much easier for the tenor voice type to cover than the baritone. It's one thing to be able to belt out a G or an A than to linger up there, or to transition even higher in certain areas. It's the sort of thing that still has me convinced, to this day, that ALW's Phantom of the Opera's title character is definitely a tenor character who was written so baritone's could probably play him. A professional, Broadway baritone hitting a G? Fine. Popping out those casual Gs with \"Sing ONCE a-\" that's some tenor sh*t right there for a lot of people."}, {"comment_id": "f4az868", "post_id": "dk1whw", "comment": "Why do Baritones get so much hate you ask? Because they can’t hit the high notes and lets face it, the most popular song are overwhelming sung in a higher range. Humans tend to like songs in higher ranges than they do in lower ranges. \n\nVOX did a documentary on this.\n\nEdit: Found it\n\nhttps://www.vox.com/platform/amp/2019/8/13/20801974/we-charted-pop-music-falsetto"}, {"comment_id": "f4ch5tq", "post_id": "dk1whw", "comment": "That vox doc is about *falsetto*. Baritones can do that just fine."}, {"comment_id": "f4ddb67", "post_id": "dk1whw", "comment": "Tenors are gods chosen. It is known."}, {"comment_id": "f4a7gz4", "post_id": "dk1whw", "comment": "Why do baritones get so much hate? I don't get it.  Everyone has a voice type and I know some baritones and sing some tenors under the table, so..."}, {"comment_id": "f4ashfj", "post_id": "dk1whw", "comment": "Because we lose our low notes only 10-20 minutes into singing, and have little choice of color for high notes because of how supported and unintentionally loud we need to be. We're the most common male voice type, but the least useful in most rep lol"}, {"comment_id": "f4awr07", "post_id": "dk1whw", "comment": "Wait, a tenor can’t sing All of Me?"}, {"comment_id": "f4boxqc", "post_id": "dk1whw", "comment": "No, the people that bully baritones can’t"}, {"comment_id": "f4cf3yb", "post_id": "dk1whw", "comment": "IIRC, the lowest note in the song is C3, so technically my tenor brethren and I can sing this song.\n\n*not that my C3 is anywhere near being considered good*"}, {"comment_id": "f4bdgmb", "post_id": "dk1whw", "comment": "Im the one baritone who tries to sing G4 every song"}, {"comment_id": "f4bdjfj", "post_id": "dk1whw", "comment": "*cries in baritone*"}, {"comment_id": "f4bie2m", "post_id": "dk1whw", "comment": "Is this sub just 90% memes about baritones or do I just happen to only see those posts?"}, {"comment_id": "f4cw1l6", "post_id": "dk1whw", "comment": "I think it's a current fad, but it does seem to recur and always get enough upvotes to hit the front page."}, {"comment_id": "f4dddfk", "post_id": "dk1whw", "comment": "Typical attention seeking baritone behavior"}, {"comment_id": "f4cukdw", "post_id": "dk1whw", "comment": "I'm a low Tenor."}, {"comment_id": "f4b95m5", "post_id": "dk1whw", "comment": "*laughs in D2 then G#4 and finishes it off in a G5* fuck y'all tenors"}, {"comment_id": "f4c72xp", "post_id": "dk1whw", "comment": "*laughs in breathy unstable D2 then strained raspy G#4 and finishes it off in a weak ass thin ass G5 in falsetto*"}, {"comment_id": "f4qv1ln", "post_id": "dljmhr", "comment": "Thanks for posting to r/singing! **Be sure to check [the FAQ](https://www.reddit.com/r/singing/wiki/index)** to see if any questions you might have have already been answered! Also, remember to abide by the rules found in the sidebar. Any comments found to be breaking these rules will result in a deletion of the comment thread starting from the offending reply. If you see any posts or replies that you feel break the rules of the sub, then report them and **do not respond to them.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singing) if you have any questions or concerns.*"}, {"comment_id": "f4qvayz", "post_id": "dljmhr", "comment": "D4 for me -cries in bass-"}, {"comment_id": "f4ripcr", "post_id": "dljmhr", "comment": "Same.  That said, I get the compensation of being able to hit g1 fairly regularly and E1 when I've just woken up.\n\n&#x200B;\n\nSo I'm not too unhappy...."}, {"comment_id": "f4ub4i6", "post_id": "dljmhr", "comment": "True basses are so rare and such a gem in an a cappella group though. We need more strong basses otherwise the baseline is just not strong enough to support everyone else.\n\nNever under-appreciate basses!"}, {"comment_id": "f4rdxoe", "post_id": "dljmhr", "comment": "Haha jokes on you my head voice is fucked...... Anyone got any tips my head voice is very airy, sounds strained af no matter how much I try to relax the voice and it's hard to control, I sound like a mocked cat mew...."}, {"comment_id": "f4sbbss", "post_id": "dljmhr", "comment": "I'm not a professional by any means, but I have taken voice lessons. When you breathe, try to breathe through your stomach. Like put your hands on your stomach and breathe. Your stomach should tense and it should push your hands out. Breathing- in-your-lungs-singing is generally characterized by a shaky, airy, or, a \"not-full\" sound. By breathing with your abs, you are providing more backup for your diaphragm, creating a louder, more solid, fuller sound.\n\nAnother thing: Of course you want to be relaxed, but you shouldn't be totally loose. Think of a guitar. The strings are taught, but they arent so tight that you can't strum them. Think of a guitar made of fabric and yarn. It is just floppy and it won't make nice noise. But if you are a little more taught, it provides a better space for sound to resonate in. \n\nThis is as far as my knowledge goes, I hope I helped xD"}, {"comment_id": "f4rodq7", "post_id": "dljmhr", "comment": "I have that problem plus the fact that my larynx launches up and I can't hit anything higher than a  C5 for the life of me. Not even with falsetto."}, {"comment_id": "f4r42sy", "post_id": "dljmhr", "comment": "Laughs In C1 morning voice"}, {"comment_id": "f4vnk1u", "post_id": "dljmhr", "comment": "Jesus Christ dude your voice sits just above the 0th octave?"}, {"comment_id": "f4rm1nz", "post_id": "dljmhr", "comment": "i wish i could sing even F#4/G4 without it sounding like a turtle being tortured"}, {"comment_id": "f4rsc76", "post_id": "dljmhr", "comment": "Funny, considering the theme song of this film."}, {"comment_id": "f4scu12", "post_id": "dljmhr", "comment": "This is the funniest shit I’ve seen in a long time. \n\nI remember the day I discovered how to properly hit a head voice and my life changed forever"}, {"comment_id": "f4rtfip", "post_id": "dljmhr", "comment": "I’m in this photo and I like it 😎"}, {"comment_id": "f4ssnh3", "post_id": "dljmhr", "comment": "This entire sub has become baritone memes and I'm kind of loving it."}, {"comment_id": "f4rsnll", "post_id": "dljmhr", "comment": "~cries in F4~\n\nI'm still struggling to learn how to acess and use my Mixed voice to expand my tessiture..."}, {"comment_id": "f4s30pb", "post_id": "dljmhr", "comment": "all the memes lately have been higher = good and here's just me tryna sing smooth jazz"}, {"comment_id": "f4s6hgt", "post_id": "dljmhr", "comment": "Who cares about shrieking anyway when you've got smooth jazz"}, {"comment_id": "f4u9vxi", "post_id": "dljmhr", "comment": "Name a more iconic duo than baritones and not understanding the difference between head voice and falsetto."}, {"comment_id": "f4rzac7", "post_id": "dljmhr", "comment": "- laughs in A6 -"}, {"comment_id": "f4svcun", "post_id": "dljmhr", "comment": "Laughs in F0"}, {"comment_id": "f4t78f2", "post_id": "dljmhr", "comment": "*laughs in A4*"}, {"comment_id": "f4t8uyw", "post_id": "dljmhr", "comment": "Read \"Baritones\" as \"Bari-tinos\" at first"}, {"comment_id": "f4u54y1", "post_id": "dljmhr", "comment": "Hahahaha"}, {"comment_id": "f4ujixs", "post_id": "dljmhr", "comment": "I am the biggest reason of this kind of memes. Because months ago i created new topic on here. And i said everytime; \"Baritones are underrated, and they can't sing high!\""}, {"comment_id": "f4uumlu", "post_id": "dljmhr", "comment": "*laughs in B7*"}, {"comment_id": "f4v8u0e", "post_id": "dljmhr", "comment": "*Laughs in Ab4*"}, {"comment_id": "f4qz88h", "post_id": "dljmhr", "comment": "*laughs in whistle A7*"}, {"comment_id": "f4r353m", "post_id": "dljmhr", "comment": "You do realize you’re less than an octave off the world record with notes like that lmao \n\nF8 is the highest, at least by a male, that I know of. \n\nI have A6 right now lol"}, {"comment_id": "f4rfdsm", "post_id": "dljmhr", "comment": "This is the first time I have the context to share my boy dimash so imma leave this here https://youtu.be/-jfFPZq7n-E"}, {"comment_id": "f4smuox", "post_id": "dljmhr", "comment": "I know for girls it’s head and chest voice, and for guys is it the same? Or is it like falsetto and belt?"}, {"comment_id": "f4tx70j", "post_id": "dljmhr", "comment": "Far more complicated. Chest, head, belt, falsetto, mix, whistle, growl, fry, subharmonics... and nobody really agrees on one definition for any of them."}, {"comment_id": "f4rjmwf", "post_id": "dljmhr", "comment": "I've been practicing vibrato and control for years and not really range so I'm sitting on a measly c2-c5 ish"}, {"comment_id": "f044unc", "post_id": "d3ox9g", "comment": "Thanks for posting to r/singing! **Be sure to check [the FAQ](https://www.reddit.com/r/singing/wiki/index)** to see if any questions you might have have already been answered! Also, remember to abide by the rules found in the sidebar. Any comments found to be breaking these rules will result in a deletion of the comment thread starting from the offending reply. If you see any posts or replies that you feel break the rules of the sub, then report them and **do not respond to them.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singing) if you have any questions or concerns.*"}, {"comment_id": "f05shya", "post_id": "d3ox9g", "comment": "The fact that I genuinely find these funny is worrying"}, {"comment_id": "f061diq", "post_id": "d3ox9g", "comment": "no shame i cackled in public lmao"}, {"comment_id": "f05xocr", "post_id": "d3ox9g", "comment": "I've definitely done that tho lmao"}, {"comment_id": "f060069", "post_id": "d3ox9g", "comment": "I laughed way too hard at this. I'm such a dork 😅"}]