[{"comment_id": "dq62vja", "post_id": "7ems43", "comment": "Called. Thanks for the push. It was super easy, I just read the script and then added some points about how it would cut off disabled people and affect our local and national economies."}, {"comment_id": "dq637d1", "post_id": "7ems43", "comment": "Thank you for reaching out. \n\nI moved away this year, so it wouldn't affect me up here in Canada, but I know it would my family and friends down south. Many rely on access to the internet to make doctors appointments, receive medication, even attend therapy. \n\nEven for those who would not physically suffer, throttling or removing access is just plain unAmerican. "}, {"comment_id": "dq62jd9", "post_id": "7ems43", "comment": "Again..."}, {"comment_id": "dq62kia", "post_id": "7ems43", "comment": "Again."}, {"comment_id": "dq7qhar", "post_id": "7ems43", "comment": "Everyone is joining the cause, even in [r/bangtan](https://www.reddit.com/r/bangtan/comments/7eu92f/us_army_take_a_stand_for_net_neutrality_to_keep/) and [r/books](https://www.reddit.com/r/books/comments/7en6do/join_the_battle_for_net_neutrality_we_need_to/)!"}, {"comment_id": "c4z14e4", "post_id": "uvxki", "comment": "**Notes and Errata**\n\n^1. ^really, ^really ^big.\n\n^2. ^Thou ^Shalt ^Not ^Include ^Spoilers\n\n^3. ^**FAQ**\n\n^Q: ^Do ^I ^need ^to ^read ^the ^footnotes?\n\n^A: ^Yes. ^*emphatic ^nod*\n\n^Q: ^Can ^this ^be ^read ^on ^an ^e-reader?\n\n^A: ^Yes!\n\n^Q: ^What ^should ^I ^post?\n\n^A: ^Whatever ^is ^in ^your ^thoughts. ^I’m ^a ^firm ^believer ^that ^reading ^is ^a ^two-way ^relationship ^and ^the ^reader ^contributes ^as ^much ^to ^the ^experience ^as ^the ^author ^does. ^In ^a ^book ^as ^densely ^packed ^as ^Infinite ^Jest ^each ^of ^us ^will ^interpret ^& ^understanding ^things ^differently. ^Express ^your ^opinion!\n\n^Q: ^I ^still ^don’t ^know ^what ^to ^talk ^about. ^Help?\n\n^A: ^Any ^words ^you ^hadn’t ^seen ^before? ^Themes? ^Interesting ^dialogue? ^Relationships ^between ^characters? ^A ^paragraph ^you’re ^fond ^of? ^Whatever!\n\n^Q: ^I’m ^further ^ahead ^than ^others. ^How ^do ^I ^participate ^in ^discussion?\n\n^A: ^If ^you ^have ^things ^on ^your ^mind, ^start ^a ^new ^thread! ^People ^will ^catch ^up ^eventually ^and ^there ^are ^bound ^to ^be ^readers ^who ^have ^already ^finished ^the ^book. ^Be ^explicit ^about ^what ^page/scene/theme ^you’re ^talking ^about.\n"}, {"comment_id": "c4z160k", "post_id": "uvxki", "comment": "Open to suggestions guys. What's missing from the post? What needs to go in the FAQ? I'll post some useful links when we're closer to the date, but any ideas are welcomed."}, {"comment_id": "c4z63um", "post_id": "uvxki", "comment": "The Nook ebook and OverDrive epub hyperlink the footnotes as well, FYI. "}, {"comment_id": "c4zfjh8", "post_id": "uvxki", "comment": "There is a epub/mobi version on baconbits that has the footnotes in the text."}, {"comment_id": "c4z68ct", "post_id": "uvxki", "comment": "I've been reading IJ for awhile now, and so I've collected some links that might be useful:\n\n[A scene by scene guide](http://faculty.sunydutchess.edu/oneill/Infinite.htm)\n\n[Subsidized time, which isn't explained until page 223ish but isn't a real spoiler](http://infinitejest.wallacewiki.com/david-foster-wallace/index.php?title=Subsidized_Time)\n\n[IJ page-by-page, which defines words you may not know by page numer](http://infinitejest.wallacewiki.com/david-foster-wallace/index.php?title=Infinite_Jest_Page_by_Page)\n\n\n[IJ Liveblog gives summaries that are nice to read after you finish each section](http://tradepaperbacks.wordpress.com/wordswordswords/)  \n\nJust some stuff to look at while you read! Enjoy!\n"}, {"comment_id": "c4z8vah", "post_id": "uvxki", "comment": "Thanks for the links! The LiveBlog one is new to me and will be particularly handy for priming discussion.\n\nedit: you have now been tagged as 'my beacon of IJ info'"}, {"comment_id": "c4zan9v", "post_id": "uvxki", "comment": "But when I first heard about Infinite Summer I thought it was a one off and I had missed it; this is a great idea. I am on page 786 and hang me upside down and fuck me in both ears, am I loving it."}, {"comment_id": "c50doom", "post_id": "uvxki", "comment": "If they release a new edition of this with various review quotes, yours should be on there! Haha"}, {"comment_id": "c4z4w0n", "post_id": "uvxki", "comment": "Do this.  Infinite Jest will become the post-modern novel by which you measure all others."}, {"comment_id": "c51gqv6", "post_id": "uvxki", "comment": "This comment is the one that convinced me to pick up IJ. I hope this turns out to be true! :D"}, {"comment_id": "c4zmnxz", "post_id": "uvxki", "comment": "Newcomers welcome? "}, {"comment_id": "c4zql44", "post_id": "uvxki", "comment": "Of course! Everyone is welcome."}, {"comment_id": "c4z488w", "post_id": "uvxki", "comment": "Hot damn! I just started Infinite Jest on Tuesday. Works perfect!"}, {"comment_id": "c4z52yo", "post_id": "uvxki", "comment": "I have a kindle version without page numbers, any tips or way to convert page numbers so I can follow along?"}, {"comment_id": "c4z651t", "post_id": "uvxki", "comment": "[Infinite Summer](http://infinitesummer.org/index) gives you a % complete, and [this website](http://faculty.sunydutchess.edu/oneill/Infinite.htm) gives you a scene by scene guide along with page numbers, so you can know what page you have read through"}, {"comment_id": "c4z92po", "post_id": "uvxki", "comment": "I'm looking forward to this. This summer will mark my first *Infinite Jest* read through, and I have no one to talk to about it! "}, {"comment_id": "c4z963b", "post_id": "uvxki", "comment": "> and I *had* no one to talk to about it! \n\nFTFY :) Now you have *everyone* to talk to about it!"}, {"comment_id": "c53hdio", "post_id": "uvxki", "comment": "The day has come. This makes me so excited that I'm kind of worried."}, {"comment_id": "c53jkan", "post_id": "uvxki", "comment": "Your excitement makes me more excited. It's good to know i'm not alone in my enthusiasm!"}, {"comment_id": "c4z42kl", "post_id": "uvxki", "comment": "I guess I'm down for this."}, {"comment_id": "c4z4i94", "post_id": "uvxki", "comment": "I've never read any of DFW, but I suppose this is as good of a way to get into him as anything else I've seen.  I'm game!"}, {"comment_id": "c4z4xm2", "post_id": "uvxki", "comment": "Oh, nice. I'd just made up my mind to read this next after seeing it recommended in the \"Best novels with nonlinear narrative\" thread. I'm in."}, {"comment_id": "c4z911w", "post_id": "uvxki", "comment": "Could you link to that thread please?  Sounds interesting."}, {"comment_id": "c4z5gj5", "post_id": "uvxki", "comment": "Just ordered the book from Amazon yesterday :D"}, {"comment_id": "c4za2er", "post_id": "uvxki", "comment": "ReReading IJ for the nth time, I don't know anyone else who has read it, I'm looking forward to conversations.\nHere's a web page with loads of IJ cool stuff, mock up film posters for Incandenza's films. \n[Poor Yorick Entertainment](http://pooryorickentertainment.tumblr.com)"}, {"comment_id": "c4za7gb", "post_id": "uvxki", "comment": "I'm following them on tumblr but they don't update anymore :( It's still a very awesome catalogue to check out while reading IJ though!"}, {"comment_id": "c4zaup4", "post_id": "uvxki", "comment": "I'm trying to decide if I want to tackle Infinite Jest this summer. Having some company might encourage me... I think I'll do it! "}, {"comment_id": "c538va7", "post_id": "uvxki", "comment": "I am very good at starting books, even better at not finishing them. This might be a daunting task for me, but I hope going into it with company could help me too! "}, {"comment_id": "c4zff5z", "post_id": "uvxki", "comment": "Let's fucking go."}, {"comment_id": "c4zfq96", "post_id": "uvxki", "comment": "Just discovered this subreddit literally forty seconds ago, and this was the first post I saw on it. I must say I am completely intrigued, and I will be keeping tabs on this post to see if I'm ready to attempt this. As it stands, I have far too many books on my list to dedicate myself to this immediately. Something to sleep on!"}, {"comment_id": "c4zje4r", "post_id": "uvxki", "comment": "I'm not sure that 16 days is going to be enough time to read the last 400 pages of Gravity's Rainbow and the first 100 of Infinite Jest.  But I suppose I could give it a go..."}, {"comment_id": "c4z71mv", "post_id": "uvxki", "comment": "Excellent timing as I am on the home stretch right now, p. 827."}, {"comment_id": "c4z7b4z", "post_id": "uvxki", "comment": "I'm down! I already have the book bought and synced with my phone and tablet. "}, {"comment_id": "c4z8i24", "post_id": "uvxki", "comment": "I can't find a copy of it, but I can't wait to get started!"}, {"comment_id": "c4za0qq", "post_id": "uvxki", "comment": "I'm 400 pages in, but I'll follow up."}, {"comment_id": "c4zau35", "post_id": "uvxki", "comment": "Dang! Second time I've missed an Infinite Summer..."}, {"comment_id": "c4zbgqt", "post_id": "uvxki", "comment": "It starts in 10 days!"}, {"comment_id": "c4zeh7i", "post_id": "uvxki", "comment": "A friend just got me this book, and I've been waiting to start it for this. Can't wait! "}, {"comment_id": "c4zfkiy", "post_id": "uvxki", "comment": "Sounds very cool, but not going to join.  Although I did just add IJ to my reading list and kindle."}, {"comment_id": "c4zgsmj", "post_id": "uvxki", "comment": "As someone who just finished this book yesterday; DO IT! It's fantastic and worth your time.\n\nPS Read Hamlet too."}, {"comment_id": "c4zij4b", "post_id": "uvxki", "comment": "Pemulis / Polonius? Haha. \n\nWhen I tried reading IJ six months ago I re-read Hamlet. I probably won't bother again. This time round i'm keen to read Henry IV. And i'll probably re-watch 2001: A Space Odyssey as well. Hal's everywhere!"}, {"comment_id": "c4zhseb", "post_id": "uvxki", "comment": "I'm in - multiple bookmarks & massive paperback ready to go."}, {"comment_id": "c4zil0c", "post_id": "uvxki", "comment": "Just ordered my copy from Half.com!"}, {"comment_id": "c4zzuwo", "post_id": "uvxki", "comment": "I've been reading nothing but DFW for the past month in preparation for this so count me in! I'm very excited to begin so I think I'm going to jump the gun a bit and start today."}, {"comment_id": "c509bth", "post_id": "uvxki", "comment": "Just picked up my copy today, this is going to be fun :)"}, {"comment_id": "c50cs6n", "post_id": "uvxki", "comment": "Looking forward to this! Ive been contemplating what I should read next as I have just finished the Millenium Trilogy. Should be fun!"}, {"comment_id": "c50rma4", "post_id": "uvxki", "comment": "I'm in. Been meaning to get around to this book for quite some time now."}, {"comment_id": "c51589p", "post_id": "uvxki", "comment": "I think there must be others in my area that are doing the same thing. I stopped by every local bookstore and couldn't find a copy! Even Barnes & Nobles was out! I am really excited about tackling this book, a number of people have told me David Foster Wallace is right up my alley. "}, {"comment_id": "c51n6w1", "post_id": "uvxki", "comment": "I am so in on this.  just bought it today and I'm pretty pumped to read! I'm looking forward to the discussions friends!"}, {"comment_id": "c51rn9z", "post_id": "uvxki", "comment": "Seems like the right time to finish this book!"}, {"comment_id": "c53rxrf", "post_id": "uvxki", "comment": "im a total reddit lurker... just registered specifically for this. so excited!"}, {"comment_id": "dz1qc8l", "post_id": "8jqbun", "comment": "First time doing a bookclub, I really just want to get back into a community to discuss good books!! I read the little summary on Goodreads, I'm hoping I'll get through this novel w/ everyone, I do have a hard time going through more \"difficult\" books (1Q84 took me a year to finish, and I don't think the writing itself was too difficult), hopefully reading w/ everyone will make the journey easier. I'm excited!"}, {"comment_id": "dz789n9", "post_id": "8jqbun", "comment": "audiobook it, I am doing it too because I am not a strong reader. "}, {"comment_id": "dz2flyh", "post_id": "8jqbun", "comment": "Can we find out the top 4 winners and upvotes in case we want to initiate a big read of another book? Just unofficially? Or is that even allowed?"}, {"comment_id": "dz35oyk", "post_id": "8jqbun", "comment": "I’m about to head out on a trip, can you PM the mods so the others see this and can give you an answer? I’m just worried I won’t have time to address it."}, {"comment_id": "dz3a60c", "post_id": "8jqbun", "comment": "I forwarded the message, and the response was a negative. We can pick an evergreen, if we wish, but no other new reads. Monthly reads will be coming up for voting shortly, so it's not as if there would be no alternatives at all."}, {"comment_id": "dz1uqj2", "post_id": "8jqbun", "comment": "Mh. Can't say I'm surprised, but I am mildly disappointed. There's pretty much always people discussing Dune on Reddit. It's r/books favorite sci-fi novel. It's also a pretty short book, and the \"Big Read\" seems wasted on it.\n\nStill, I've got it, and I've read it a couple times, and I'll do so again as long as nobody ever asks me to read any of the sequels ever, ever *ever* again. I'll participate. If only so I can point out again and again that most of what passes for deep philosophy in the book is actual non-sense.\n\n"}, {"comment_id": "dz200qq", "post_id": "8jqbun", "comment": "I would actually be really excited to hear your input during the discussions then! I fall for \"deep\" philosophy a bit to easily sometimes and I appreciate it when people point out the flaws."}, {"comment_id": "dz2rgzw", "post_id": "8jqbun", "comment": "Not really a book that requires a lot of discussion to get everything out of it, either. I just found this sub and was excited for the big read, which the voting thread described as \"those big tomes you've got on your shelf that are kind of intimidating,\" and gave examples like Infinite Jest and War and Peace. Seems like Dune should have been disqualified by those terms; I read it when I was 15 and don't think it's very intimidating (especially in comparison to the examples listed) "}, {"comment_id": "dz24sl8", "post_id": "8jqbun", "comment": "I'm really glad to see some of these responses here since I am also not on the Dune fanboy train either...I read a year or two back so I remember most of it. I tried Dune Messiah which did not help either. Dune is perfectly serviceable, and the world building is certainly well done. But I don't find it that impressive considering all the other great sci-fi out there. Just my opinion though.  "}, {"comment_id": "dz24or4", "post_id": "8jqbun", "comment": "I agree. It is not so much of a big read, and it goes by really fast. While I enjoyed it, I'm not the least bit interested in delving into the sequels. Maybe one day I will, but for now I have better books to read. \n\nPeople love Dune, and even though I myself don't, I can see why others do. The world-building is well done, and Herbert takes good care in developing his main characters (his supporting characters, on the other hand, are brutally mishandled). The prose was sub-par for the most part, although there were a few gems of writing here and there. As for the philosophy, the book certainly attempts to explore some, although I don't know how successfully since I didn't spend much time thinking about it. \n\nAnyway, that's my two cents on it. "}, {"comment_id": "dz1w7px", "post_id": "8jqbun", "comment": "Get an audiobook by a high quality voice. "}, {"comment_id": "dz1mq1t", "post_id": "8jqbun", "comment": "Can't wait! Never did get a chance to read the copy ive had for years. "}, {"comment_id": "dz1uynq", "post_id": "8jqbun", "comment": "That's a shame. I might join in next summer, then."}, {"comment_id": "dz1mve9", "post_id": "8jqbun", "comment": "I was really hoping this would win!"}, {"comment_id": "dz232os", "post_id": "8jqbun", "comment": "Woohoo! I’ve needed a reason to read **Dune** for a while now. Looking forward to the journey with you all. "}, {"comment_id": "dz2517r", "post_id": "8jqbun", "comment": "This is my first time joining and it just so happens that my library hold on Dune was just delivered, perfect timing! "}, {"comment_id": "dz2p2k9", "post_id": "8jqbun", "comment": "[Look how excited Chani is to re-read Dune this summer!!!](http://imgur.com/7n50ZA0) "}, {"comment_id": "dz2xblk", "post_id": "8jqbun", "comment": "I just finished messaih last night"}, {"comment_id": "dz2ydf3", "post_id": "8jqbun", "comment": "YESSSSS!!"}, {"comment_id": "dzlexi8", "post_id": "8jqbun", "comment": "I have never done one but really want to and it gives me a reason to dust off my copy"}, {"comment_id": "dzw25m0", "post_id": "8jqbun", "comment": "Does anyone know when the schedule for Dune is coming out?"}, {"comment_id": "dzwu8s5", "post_id": "8jqbun", "comment": "Not yet. Someone else is doing it, so I asked them about it."}, {"comment_id": "dzx3rq0", "post_id": "8jqbun", "comment": "This weekend.:)"}, {"comment_id": "dz26dbu", "post_id": "8jqbun", "comment": "Summary:\nSet in the far future amidst a sprawling feudal interstellar empire where planetary dynasties are controlled by noble houses that owe an allegiance to the imperial House Corrino, Dune tells the story of young Paul Atreides (the heir apparent to Duke Leto Atreides and heir of House Atreides) as he and his family accept control of the desert planet Arrakis, the only source of the 'spice' melange, the most important and valuable substance in the cosmos. The story explores the complex, multi-layered interactions of politics, religion, ecology, technology, and human emotion as the forces of the empire confront each other for control of Arrakis.\n"}, {"comment_id": "dz24gpp", "post_id": "8jqbun", "comment": "[deleted]"}, {"comment_id": "dz24gvu", "post_id": "8jqbun", "comment": "I will be messaging you on [**2018-05-23 05:13:56 UTC**](http://www.wolframalpha.com/input/?i=2018-05-23 05:13:56 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/bookclub/comments/8jqbun/summer_big_read_dune_by_frank_herbert/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/bookclub/comments/8jqbun/summer_big_read_dune_by_frank_herbert/]%0A%0ARemindMe!  1 week) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! dz24gvu)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|"}, {"comment_id": "dzyajp0", "post_id": "8jqbun", "comment": "At the ready - https://imgur.com/NDr51OY"}, {"comment_id": "drp06mq", "post_id": "7ls817", "comment": "I often hear people talking about using a notebook to keep track of characters when reading Tolstoy or Dostoevsky. \n\nBut don't your copies have a list of main characters at the beginning? \n\nMy copies of W&P, Anna Karenina, and Crime and Punishment all contain such a list. It details characters' full names and all their nicknames."}, {"comment_id": "drpebnq", "post_id": "7ls817", "comment": "Not every copy is going to have something useful like this. Mine has \"primary\" characters, but not all of them. Looking on Gutenberg, where a lot of readers are going to be getting this... nope, although you can ctrl-F character names. My copy of C&P doesn't have one, either."}, {"comment_id": "drw22wm", "post_id": "7ls817", "comment": "> Tolstoy will refer to them using various names, making it difficult to keep them straight. \n\nHe will.  Characters may be addressed by: \n\n- first name   (Pyotr)  \n- French first name  (Pierre)  \n- last name (which has male and female forms; Anatole *Kuragin* has a sister named Yelena *Kuragina*)     \n- first name + patronymic (Pyotr Kirilovich, \"Peter son of Kiril\".  This is often used in formal contexts.)  \n- title (\"the countess\", which if we're at the Rostov house we should assume to mean Countess Rostova.)   \n- Nicknames (Pyotr = Petrushka or Petya, Natasha = Natalia. You get used to it.)  \n\nYou may also have slight differences between editions in how the names are rendered.  Andrei may be Andrej, Andrey, or even Andrew.  It'll be consistent within your copy, but when comparing notes you may want to include last names to make sure you understand each other."}, {"comment_id": "drw2j78", "post_id": "7ls817", "comment": "Wow. This is gonna be work. :)"}, {"comment_id": "dru11l5", "post_id": "7ls817", "comment": "does anyone have a good pdf link for this? im using http://www.planetebook.com/ebooks/War-and-Peace.pdf and it seems to go from book 1 to book 15 with chapters in between but it makes it hard to follow along with this reading schedule? Thanks!"}, {"comment_id": "dru1d3o", "post_id": "7ls817", "comment": "You may have to compare to my schedule here. It appears that the books in your PDF correspond to the parts in mine, and the chapter numbering resets with every book."}, {"comment_id": "dru82sk", "post_id": "7ls817", "comment": "😍😍😍😍\nThank you for organizing this. "}, {"comment_id": "dru8eo1", "post_id": "7ls817", "comment": "Happy to! It's going to be so much fun!"}, {"comment_id": "drpvy69", "post_id": "7ls817", "comment": "I'm not partaking in this one so let me ask a question. Are there going to be other reads during those four months? "}, {"comment_id": "drq0s23", "post_id": "7ls817", "comment": "Every month we have at least one new book. For January it will be *House of Leaves* by Mark Z. Danielewski. We do not have a read runner or schedule for that yet, so I will probably run it myself, and I'll need to order the book. There will be a schedule posted by the 1st. \n\nEvery month, usually two weeks before the end, we have a week of voting. We will choose one or two books to read each month. I prefer to choose two for variety, but it is dependent on the availability of read runners. Because /u/surf_wax is running *War and Peace* as a Big Read (meaning it will take place over several months), we will continue to choose at least one book each month. We do not want anyone to be forced to wait four months to join in the discussion. \n\nIn addition, our [previous selections](https://www.reddit.com/r/bookclub/wiki/previous) are still open for comment. You can always post a new thread in reference to any books we have chosen at any time. If you didn't get to read a book before, you can still read it and post about it (be sure to mention it was a previous selection) and people will comment and discuss it with you. \n\nAlso, we will also have the Poem of the Week selection. That is being headed up by /u/surf_wax. We vote around the same time as the book selection week, and select 4-5 poems to be discussed on a set day of the week. All of the poems are freely available online. \n\nFinally, we also have the /r/bookclub [Official Discord server,](https://discord.gg/xh2F7Yj) where you can log on and talk about any books you are reading, want to read, look for suggestions, or have live discussions about the currently selected books. It is yet to be very active, but I am usually online and available. \n\nIf you have any questions, let me know! "}, {"comment_id": "drpw6a2", "post_id": "7ls817", "comment": "I assume so, we're doing *House of Leaves* concurrently in January. /u/inclinedtothelie?"}, {"comment_id": "droz8c7", "post_id": "7ls817", "comment": "The schedule looks great and very manageable! Randomly got a new notebook today so I’ll be using it for W&P, thanks for the tip. See ya guys in Jan :)"}, {"comment_id": "drq0wlt", "post_id": "7ls817", "comment": "Perfect ! Just bought a copy last month :) "}, {"comment_id": "drrbtok", "post_id": "7ls817", "comment": "So nice! I just started reading *Krieg und Frieden* two days ago and saw this sub by coincident. I'm joining in!"}, {"comment_id": "dru9t7d", "post_id": "7ls817", "comment": "I can't wait to get started! What a great schedule, thanks for putting in the work!"}, {"comment_id": "drw6yew", "post_id": "7ls817", "comment": "I am so glad I found this. Last year I barely finished the first book and felt so exhausted, having other people reading it at the same time as me might help me actually finish it! "}, {"comment_id": "drwbfp3", "post_id": "7ls817", "comment": "I've started early and am perplexed by the following text. I'm not sure if this is the best place to ask this, so please let me know if there's a more appropriate thread I can post this in\n\n(P&V):\n#IV. pg. 19, ¶1\n\n> \"From what I've heard,\" Pierre, blushing, again mixed into the conversation, \"almost all the nobility have already gone over to Bonaparte's side.\"\n> \"It's the Bonapartists who say that,\" said the viscount, not lookning at Pierre. \"Right now ....\"\n\nI thought Pierre was the viscount (per the \"Principal Characters\" portion: \"Count Pyotr Kirillovich or Kiilych (Pierre) his son\")\n\nWho's talking here??"}, {"comment_id": "drwcmho", "post_id": "7ls817", "comment": "Mortemart is the viscount.:) Check out Chapter 1, page 5:\n\n> \"I'll have two very interesting men here tonight, *le vicomte de Mortemart* ....\""}, {"comment_id": "drzi00l", "post_id": "7ls817", "comment": "Im so glad you’re doing this! I’m only about 70 pages in and already feeling overwhelmed, mainly because it’s so hard to keep track of the characters. The way you broke this down makes it feel much more manageable and I’m looking forward to reading along. Have you read it before OP?"}, {"comment_id": "ds0eela", "post_id": "7ls817", "comment": "Nope! My only Russian lit before this year was Bulgakov. I'm already liking what I'm reading, though."}, {"comment_id": "drzjqik", "post_id": "7ls817", "comment": "I love this book, you guys reading this together is making me feel reaaally compelled to jump in and re-read it too."}, {"comment_id": "ds0dksc", "post_id": "7ls817", "comment": "A forewarning for those who haven’t bought the book yet—I learned this morning while reading that the Louise & Alymer Maude translation does not include “parts”, nor do the chapters seem to line up with that of the Volokhonsky translation that it appears most readers will be using, both of which will make it more difficult albeit not impossible to follow the group."}, {"comment_id": "ds0eby8", "post_id": "7ls817", "comment": "Do any of the chapters start with the opening sentences I've typed out in this post? They won't be exactly the same but they'll be somewhat similar if they do."}, {"comment_id": "ds35eoz", "post_id": "7ls817", "comment": "Is there anyone who can provide the reading schedule in relation to the Maude version? It's completely different and I'm lost! "}, {"comment_id": "ds4c7zm", "post_id": "7ls817", "comment": "I have that translation and it does indeed include \"parts,\" as well as the four \"books,\" the epilogues, and the chapters. The parts are just not in the table of contents in my book.\n\nThe epilogue is split into two: first epilogue and second epilogue, but so far the opening sentences are matching so I'll update if I run into any problems."}, {"comment_id": "ds0nhl6", "post_id": "7ls817", "comment": "Yes, chapter 7 in the Volokhonsky text is chapter 10 in the Maude text. Not sure if this holds for the others...will check if/when I have time."}, {"comment_id": "ds1tp2g", "post_id": "7ls817", "comment": "This is great, thank you! Have read 4 chapters so far and really enjoying  it "}, {"comment_id": "drtvy2s", "post_id": "7ls817", "comment": "Oh fun.  Just got it for my kindle.  I tried to read it in high school, but lost my patience.  After 22 years its time to take a crack at it again."}, {"comment_id": "drtx8ur", "post_id": "7ls817", "comment": "Have you settled on which version we will use?"}, {"comment_id": "drty5rd", "post_id": "7ls817", "comment": "In order to keep things affordable and accessible, we don't specify an official version, though I've been making translation recommendations since I discovered with *Crime and Punishment* that there can be significant differences in readability between versions. I'm using the Pevear & Volokhonsky translation because they've treated me well before, but they footnote the French translations and it's annoying AF, so you might want to go for something different.\n\nAny version you want to use is absolutely acceptable; we'll adapt to any wording differences. With *Don Quixote* we noticed that some chapter and section numbers were different, so we'll adapt to that too, we just need to know that there is a difference."}, {"comment_id": "ds1u0g0", "post_id": "7ls817", "comment": "What if we all have different editions? Any idea on how different the different editions really are?"}, {"comment_id": "ds1u6q6", "post_id": "7ls817", "comment": "Not sure, that's why I included the first lines in the schedule, so it'd be easier to match up chapters if they correspond. It might take some talking to get ourselves on the same page.\n\nI was going to summarize chapters only for the first few sections, until we've met most of the characters, but I'll ask before I quit to see if that's helping people along any."}, {"comment_id": "dsdygn8", "post_id": "7ls817", "comment": "I've written out the reading schedule for my version on the back of a postcard which I can use as a bookmark for easy reference.\n\nhttps://i.imgur.com/is7d3mQ.jpg\n\nI'm using the Maude translation. Excited to get started! "}, {"comment_id": "dszrmz9", "post_id": "7ls817", "comment": "I planned on reading War and Peace this year, sometime between now and December.  Finding this reading schedule has motivated me to start reading right away.  Thank you.  Your schedule follows my edition perfectly.  "}, {"comment_id": "e01cfz1", "post_id": "8o7y04", "comment": "Gentleman, start your engines!"}, {"comment_id": "e01d2ir", "post_id": "8o7y04", "comment": "and may the best *russki* win!"}, {"comment_id": "e01dn0g", "post_id": "8o7y04", "comment": "I must confess i already read book one today over the course of the afternoon! It helps that its the shortest book (i think) out of all the books.  It's pretty interesting!!!!!\n\n I had very little prior knowledge about bros k. Just that the dad was murdered. (Which is not a spoiler!! You read it in the first or second sentence of the book!!)  So I'm pretty surprised at its readability and the easy flow of the story. I had the impression that it would be a hard reading. "}, {"comment_id": "e01h5qd", "post_id": "8o7y04", "comment": "I'm gonna play devil's advocate here and say that if you started early, we should be able to finish late."}, {"comment_id": "e01lg9t", "post_id": "8o7y04", "comment": "Hi, what translation is best?"}, {"comment_id": "e01n0o8", "post_id": "8o7y04", "comment": "I've heard the P&V translation is the best for Karamazov "}, {"comment_id": "e01y2mm", "post_id": "8o7y04", "comment": "imo MacAndrew or Avsey, you can check out comparisons between translations from this article: \n\nhttp://www.patrikbergman.com/2017/07/23/choosing-best-karamazov-translation/\n\nYou'll see P&V recommended everywhere, I do think their translation is good, but just not better than other translations. Garnett and McDuff are considered outdated (by no means bad though, just not usually a first choice). This article talks about the hype surrounding P&V, https://www.firstthings.com/blogs/firstthoughts/2013/01/the-pevearvolokhonsky-hype-machine-and-how-it-could-have-been-stopped-or-at-least-slowed-down"}, {"comment_id": "e01cq7j", "post_id": "8o7y04", "comment": "I'm excited. Thanks for setting this up. "}, {"comment_id": "e01x0w5", "post_id": "8o7y04", "comment": "Can we talk about the differences in translation? Can that be a talking point? Constance Garnett translated my version. I'm curious to what degree the translation affects the story."}, {"comment_id": "e02oom6", "post_id": "8o7y04", "comment": "I wouldn't mind comparing and contrasting certain passages in different translations as we go, as long as we don't get too tied up in it. Wouldn't want discussion threads getting sidetracked by semantic nitpicking."}, {"comment_id": "e01z0oj", "post_id": "8o7y04", "comment": "I think it's wise to not overthink translations. A lot of people consider Garnett outdated, but I read the first few chapters of Garnett's translation and fully enjoyed it. I ended up purchasing MacAndrew's translation, and I like it a little bit better (seems to flow more). Garnett uses Victorian English, her translation is a bit more formal. If the formal language doesn't bother you, then I don't see a need to change translations. I've been comparing Garnett with MacAndrew and Garnett hasn't omitted anything (I've seen a criticism that she skipped over parts). It's all basically the same thing, just worded a bit differently. \n\nP&V is recommended all the time, but  I personally didn't care for their prose. The sentence structure felt clunky, and  other translations conveyed the meaning of the text in a better way to me. I seem to be in the minority with this opinion, but I suggest checking out [this article](http://www.patrikbergman.com/2017/07/23/choosing-best-karamazov-translation/) so you can compare the translations yourself. Other people have commented that they loved the P&V translation and found this version easier to read. The translation is good, but it's by no means the *best* or necessarily better than others. \n\nUltimately it comes down to personal preference, but I haven't heard of people getting a vastly different experience from reading different translations. \n\n"}, {"comment_id": "ebxav4r", "post_id": "a6qhov", "comment": "Congrats! I'm Reading it right now ... well I have been for over a year now lmao. Hopefully I'll finally get it done by the end of this year haha "}, {"comment_id": "edrivni", "post_id": "a6qhov", "comment": "Just started, hoping to finish by Feb"}, {"comment_id": "ebxf4xh", "post_id": "a6qhov", "comment": "Good luck, you can do it!! It took me a year too :)"}, {"comment_id": "ebyv4bv", "post_id": "a6qhov", "comment": "Nice job! Kudos to your perseverance and sticking with the book.\n\nI still need to go back to it and finish it, too, but I had barely started before things got busy.\n\nI first need to finish *Don Quixote* and *Blindness*.  Those were book selections from more than a year ago (maybe two years ago?) and I got to the halfway point in both books, but I was juggling way too many books at the time, so I had to put them on pause.\n\nBTW, what version of *War and Peace* did you read? Was it a hassle to keep flipping to the footnote translations of the French sections? I also still very badly want to read Tolstoy's other masterpiece, *Anna Karenina*, but unfortunately I had joined this bookclub after they just had read it."}, {"comment_id": "ebzavbp", "post_id": "a6qhov", "comment": "Both are absolutely worth the time they take, but the translation is super important. I read Constance Garnet’s first and it was a labor—there are better versions for sure. "}, {"comment_id": "ebzkq2n", "post_id": "a6qhov", "comment": "Thank you!! I got quite used to the footnotes, but there are also full english versions available. I used the pevear and volokonsky translation. How do you like don quixote so far?"}, {"comment_id": "ec1d8z6", "post_id": "a6qhov", "comment": "Thats funny. I loved following the war parts. Couldnt wait for Rostov. The hunt scene was awesome. I find the longer books like this or count of monte cristo are best read very consistently a chapter or 2 a night or during a holiday when you can pump it out in 2 weeks. Otherwise I forget whats going on and have to read spark notes to remind myself."}, {"comment_id": "ec1zgr6", "post_id": "a6qhov", "comment": "Makes sense! It took me about a year, and sometimes I didn’t touch the book for about a month or so.. do you have other literary highlights i should pick up on?"}, {"comment_id": "dzdsycg", "post_id": "8l78wa", "comment": "I've never read any dostoevsky or any russian authors at all. Also only the 2nd time participating in rbookclub. And the first time wasnt a long read like this one. So I'm hoping this will be a good experience. \n\nI initiated this with a little bit of selfishness on my part as well because i feel like the commitment will force me to go thru with actually reading it, and to read it with more of an effort to go deeper with reflections and thoughts."}, {"comment_id": "dzix92c", "post_id": "8l78wa", "comment": "I'm excited I stumbled upon this sub and thread today! I've been meaning to read this book for a long time now, but have been intimidated by the length. I like the weekly structure, it makes the novel seem more readable, and less like a massive undertaking. \n\nedit: For anyone else like me that's not familiar with Russian naming conventions, here's a guide I've already found helpful: \n\n**Dmitri Fyodorovich Karamazov** -- Mitya, Mitka, Mitenka, Mitri\n\n**Ivan Fyodorovich Karamazov** -- Vanya, Vanka, Vanechka\n\n**Alexei Fyodorovich Karamazov** -- Alyosha, Alyoshka, Alyoshenka, Alyoshechka, Alexeichik, Lyosha, Lyoshenka\n\n**Agrafena Alexandrovna Svetlova** -- Grushenka, Grusha, Grushka\n"}, {"comment_id": "e089q70", "post_id": "8l78wa", "comment": "Omg, bless your heart. Only 13 pages in and I was already getting lost!!!!!!"}, {"comment_id": "dzlvnt3", "post_id": "8l78wa", "comment": "Also: name = FirstName Patronymic LastName\n\n1. The middle name aka the patronymic is derived from the father's name, so if someone is Fyodorovich, then Fyodor XXX in the novel is most likely their father. This may help?\n2. People can be, in certain circumstances, referred to by their last name, a.k.a Karamazov. \n3. The \"formal\" way of referring to someone \\(i.e. when showing respect, or when they're older/not your family\\) is FirstName Patronymic, i.e. Dmitry Fedorovich. Using the softer forms listed above shows a degree of familiarity, with different forms having subtly different meanings. If I had to rank them, Alyosha == Lyosha \\< Alyoshen'ka == Lyoshen'ka \\< Alyoshechka. Alyoshka has a certain connotation of naughtiness in it, i.e. when referring to a slightly erring child. Similarly, Grusha \\< Grushka \\(for women, either naughtiness or that they're a maid in the XIX century\\) \\< Grushen'ka; Vanya \\< Van'ka \\< Van'echka\n4. . In addition to all of the \"M\" variants you list, Dmitry/Dmitri can also be \"Dima/Dimochka etc...\" \\- although I don't think Dostoevsky uses these in the novel.\n\nHappy to clarify any connotations anyone runs into."}, {"comment_id": "dzdexuz", "post_id": "8l78wa", "comment": "Thank you for doing this!"}, {"comment_id": "dzdsz06", "post_id": "8l78wa", "comment": "Ur welcome!! Hope we all participate till the end!! =D"}, {"comment_id": "dzds0ij", "post_id": "8l78wa", "comment": "About translations:  \\[here's an article one person wrote with some  example passages\\]\\([http://www.patrikbergman.com/2017/07/23/choosing\\-best\\-karamazov\\-translation/](http://www.patrikbergman.com/2017/07/23/choosing-best-karamazov-translation/)\\).  To my \\(first language english\\) ear, I agreed with his/her preferences.\n\n~~The devil~~Amazon has MacAndrew for $6 in US \\(they list it as \"by Fyodor Dostoevsky and Konstantin Mochulsky\" because they are hapless about translation attribution; Mochulsky wrote an intro\\).\n\nOxford World Classics, xlated by Ignat Avsey, $7 in US, and Pevear is $10.  Constance Garnett's is free.  Note that they have a $3.00 version showing the Pevear cover but it's not Pevear, it's Garnett."}, {"comment_id": "dzdvb1p", "post_id": "8l78wa", "comment": "Awesome I’ll join! I’ve already read Dune so I’m glad you are doing this! "}, {"comment_id": "dzdg4v3", "post_id": "8l78wa", "comment": "I never finished this book. I really liked it, though it does drag at times. Count me in!"}, {"comment_id": "dzdp3j6", "post_id": "8l78wa", "comment": "Thanks !! I can’t wait!!"}, {"comment_id": "dzqg18q", "post_id": "8l78wa", "comment": "Heey I wanna in! I love Dostoyevsky (make me very emotional) and I wanted to read the Brothers for forever now. \nI have never been in a book club but I'm very exciting! And russian being my mother tongue will make it somewhat easier for me :)"}, {"comment_id": "dzz4lom", "post_id": "8l78wa", "comment": "I’ll be really interested to hear your perspectives, especially on the cultural aspects of the book. I’ll be curious what seems still very modern or relatable about the characters and their lives to you, and what feels archaic to you! I’m in the USA, never been to Russia nor had much exposure to your culture.  I hope we can have some dialogue and I can learn from you a bit over the next few months! "}, {"comment_id": "dzdjpfe", "post_id": "8l78wa", "comment": "I’ve not done a longread through bookclub before. Does anybody have recommendations for physical book v. ebook? "}, {"comment_id": "dzdxh6p", "post_id": "8l78wa", "comment": "I like physical books better. Depends on your preference."}, {"comment_id": "dzdwmwk", "post_id": "8l78wa", "comment": "Looks like a good schedule. I'm in. :)"}, {"comment_id": "dzdwybv", "post_id": "8l78wa", "comment": "I've been meaning to read it, started so many times. Hopefully this forces me to do it!"}, {"comment_id": "e0b82uw", "post_id": "8l78wa", "comment": "Me and you both"}, {"comment_id": "dzehuhd", "post_id": "8l78wa", "comment": "[deleted]"}, {"comment_id": "dzf5uap", "post_id": "8l78wa", "comment": "Thanks so much!! I've always wondered how other people did that"}, {"comment_id": "dzgdrqv", "post_id": "8l78wa", "comment": "I’m in! Never read it, always wanted to. "}, {"comment_id": "dzgtfk3", "post_id": "8l78wa", "comment": "I'd like to reread this with a group, I had no one to talk to about it the first time around so it should be fun."}, {"comment_id": "dzh9o2k", "post_id": "8l78wa", "comment": "I’m in, I purchased the book but haven’t gotten around to reading it "}, {"comment_id": "dzhcry6", "post_id": "8l78wa", "comment": "I’m also in!"}, {"comment_id": "dzdr0ml", "post_id": "8l78wa", "comment": "Oh this looks good. Ive always intended to tackle some Fyodor again (got halfway through The Idiot more than a decade ago- not sure why I put it down because I remember liking it.) I’m in. I bought the kindle edition.  "}, {"comment_id": "dze1ydg", "post_id": "8l78wa", "comment": "Count me in! Haven’t read Dostoyevsky before :D "}, {"comment_id": "dze55nb", "post_id": "8l78wa", "comment": "I'm in. Been wanting to read The brothers K for a long time. \n\nI vaguely remember reading a commentary about Dostoievski made by Stephen King, he said something along the lines of him actually writing horror. Wish I could find that quote again."}, {"comment_id": "dzf7uf0", "post_id": "8l78wa", "comment": "I'm looking forward to this one. I've had a copy on my shelf for years and think it will make a great group read. Thanks for organizing!"}, {"comment_id": "dzfd901", "post_id": "8l78wa", "comment": "I haven't participated in any of the book clubs, so this will be my first time! Very excited."}, {"comment_id": "dzfk1sy", "post_id": "8l78wa", "comment": "Yessss this is being posted and the perfect time. Thanks!!!"}, {"comment_id": "dzfkdsi", "post_id": "8l78wa", "comment": "Looking forward to joining in. Haven't joined in on a r/bookclub read before, so kinda excited."}, {"comment_id": "dzg0sjy", "post_id": "8l78wa", "comment": "I've never done something like this before but I've intended to read The Brothers for such a long time now. Some additional motivation won't hurt. "}, {"comment_id": "dzie1bs", "post_id": "8l78wa", "comment": "I'll join in although i'm already on book 5 , i would like to continue reading it until the end . And guys it's a reeeeally good book "}, {"comment_id": "dzjip3s", "post_id": "8l78wa", "comment": "Yessss I'm definitely joining! Bros Karamazov has been on my reading list forever! It's obviously a classic for a reason so can't wait. :)"}, {"comment_id": "dzk7yqw", "post_id": "8l78wa", "comment": "I already read books one through six in the beginnig of the year but never finished, so I'll join you later at book 7. gonna read it until the end this time."}, {"comment_id": "dzmbqea", "post_id": "8l78wa", "comment": "I picked this up years ago and never got into it. Just what I need to get some summer reading in between semesters!"}, {"comment_id": "dzmcsga", "post_id": "8l78wa", "comment": "Was planning to read Demons this summer, but I guess I'm doing this now!"}, {"comment_id": "dzn75f3", "post_id": "8l78wa", "comment": "Hey guys, I’m jumping in late to this because it was mentioned over on r/suggestmeabook.  I’ve always wanted to read Dostoyevsky and I’m looking forward to it.\n\nIs there a way to “subscribe” to the Bros K threads, or do we just check the subreddit for updates?"}, {"comment_id": "dzn7cei", "post_id": "8l78wa", "comment": "Hey! Nice you can join us. You just have to check the subreddit for updates. And ur not actually late because we arent officiall starting until the first week of June as per schedule. =)"}, {"comment_id": "dznnqr9", "post_id": "8l78wa", "comment": "I've tried to start BrosK a month ago but I couldn't  really continue...Right now, I am reading another book but I'm gonna finish it by the 4th of June in order to be able to start BrosK with all of you.. Count me in! \\^"}, {"comment_id": "dznv7tw", "post_id": "8l78wa", "comment": "I'm in, never even heard of the book but came across this thread while looking for something philosophical. Sounds really interesting! Is there a recommended translation?"}, {"comment_id": "dzq2mmc", "post_id": "8l78wa", "comment": "I'm not OP, but I always look for Pevear/Volokhonsky translations for Russian lit. They're newer so more expensive than Garnet (whose works are in the public domain now), but they're more accurate, don't cut corners, and I find them more readable."}, {"comment_id": "dzqd6zs", "post_id": "8l78wa", "comment": "Check out [this article](http://www.patrikbergman.com/2017/07/23/choosing-best-karamazov-translation/) that someone posted above. The author of that article directly compares several translations, and it's really useful. I'm glad I came across it because I was going to purchase a P&V translation, but after comparing it directly with other translations I found MacAndrews was more fluid and seemed to communicate the meaning in a better way. So imo P&V is over-hyped and the translations done by Ignet Avsey or Andrew MacAndrew are preferable. That article is useful though because you can get a sense of the prose and language that several translators use and decide for yourself which one you like. \n\nYou'll see P&V touted as the best translation all over the place, but this is a bit unfounded, [here's an article that's more critical of them and takes them off the pedestal] (https://www.firstthings.com/blogs/firstthoughts/2013/01/the-pevearvolokhonsky-hype-machine-and-how-it-could-have-been-stopped-or-at-least-slowed-down). Their translation is by no means bad, but I don't think it deserves to hold the trophy for best translation. "}, {"comment_id": "dzolgez", "post_id": "8l78wa", "comment": "Wow this is really cool. I was searching for some notes on brothersK and found this sub. \n\nDefinitely count me in. First dip in Russian literature."}, {"comment_id": "dzpqm64", "post_id": "8l78wa", "comment": "Late to the party, but count me in! It'll be good to have a group to tackle this one with. Thanks for setting this up!"}, {"comment_id": "dzwgpvu", "post_id": "8l78wa", "comment": "I'd love to join in too! I don't have too much experience with Russian literature but I've seen this book recommended so much that I'd love to read it."}, {"comment_id": "dzwr5u8", "post_id": "8l78wa", "comment": "Will there be a mega thread posted for each book?"}, {"comment_id": "dzwsubu", "post_id": "8l78wa", "comment": "Yup there will be a thread posted each week on sunday. You can see the specific dates listed above."}, {"comment_id": "e01uu1y", "post_id": "8l78wa", "comment": "Please count me in! "}, {"comment_id": "e09qsay", "post_id": "8l78wa", "comment": "I'm in too!"}, {"comment_id": "e0ao7vt", "post_id": "8l78wa", "comment": "Thats great! We have already started reading. Look out for the discussion thread for book1 on sunday =)"}, {"comment_id": "ezm69fv", "post_id": "d1iwqb", "comment": "Head on over to the Hemingway list subreddit.  We are reading it right now.  We are on part 2 chapter 14."}, {"comment_id": "ezm6pxh", "post_id": "d1iwqb", "comment": "Wait really? What page is that about. Ill totally try to cstch up"}, {"comment_id": "ezn4f4z", "post_id": "d1iwqb", "comment": "I did not expect to love Anna Karenina so much when I read it for the first time. The Kitty and Levin story always gets watered down for the movies and I absolutely LOVED how true to life it was."}, {"comment_id": "ezq8tpq", "post_id": "d1iwqb", "comment": "Me too!! I loved their story."}, {"comment_id": "ezpl1uw", "post_id": "d1iwqb", "comment": "One of my favorite memories ever is reading Anna Karenina while perched in a blossoming cherry tree on a beautiful spring day. Too perfect for words."}, {"comment_id": "ezpldyw", "post_id": "d1iwqb", "comment": "Dam thats sounds perfect. I can imagine the scene"}, {"comment_id": "ezmpzrc", "post_id": "d1iwqb", "comment": "I like Lev a lot"}, {"comment_id": "ezmc5ru", "post_id": "d1iwqb", "comment": "My all time fav!"}, {"comment_id": "ezmcdsj", "post_id": "d1iwqb", "comment": "Whos your fav character?"}, {"comment_id": "ezmh2mk", "post_id": "d1iwqb", "comment": "I have a copy of this waiting on me to finish A Tale of Two Cities :)"}, {"comment_id": "ezo3oua", "post_id": "d1iwqb", "comment": "It’s written so beautifully, but the story makes me want to run head-first into a wall."}, {"comment_id": "ezp4to7", "post_id": "d1iwqb", "comment": "Cause it ends so badly or cause its so spot on with ur life?"}, {"comment_id": "f03dgez", "post_id": "d1iwqb", "comment": "I found this book (like others have already said) to be one of the most realistic books I have ever read. The characters, their actions, their feelings, are described in such a way that is difficult to describe. When I read Victor Hugo or Alexandre Dumas, I think they give a depth of detail that is excessive at times.   \n\n\nTolstoy gives just enough of an explanation of setting and detail to enhance what he really excels at, that is, giving characters life, emotion, trials, and triumphs. He leverages the locations and moods of a setting just to tweak a character's feelings ever so slightly; but then over the course of the whole work, you find that each small interaction and setting is perfectly calculated to bring about dramatic changes in who his characters are.  \n\n\nI highly recommend that you keep reading. Levin is one of my favorite characters, but I believe that is due to the contrast derived from Anna's story side by side. Having one story without the other intertwined does not have the same, powerful effect."}, {"comment_id": "f03djs9", "post_id": "d1iwqb", "comment": "Made it to 110 or so. Working overnight and gonna read more tonight"}, {"comment_id": "ezn4y1l", "post_id": "d1iwqb", "comment": "Just found the audio version on LibriVox. I'll see how it goes and maybe jump in this book study too."}, {"comment_id": "ezp52xv", "post_id": "d1iwqb", "comment": "I personally cant imagine the story the same when hearing audiobooks. I need to see the words. But def try to catch up. Story is great. Reminds me of east of eden eithout the slow start"}, {"comment_id": "ezta0ni", "post_id": "d1iwqb", "comment": "I got the audible version for 5 bucks. It's read by Maggie Gyllenhaal and she does an amazing job."}, {"comment_id": "ezo2p2d", "post_id": "d1iwqb", "comment": "It's hard to name a favourite character. They all feel so alive and fleshed out. I think Anna is the best written character."}, {"comment_id": "ezp4yqe", "post_id": "d1iwqb", "comment": "I just got introduced to anna on the train. \n\nSo far i like stephan, dolly and levin is prob my fav."}, {"comment_id": "ezp5vik", "post_id": "d1iwqb", "comment": "I read it a few months ago and found it to be deeply immersive. I do want to read Tolstoy's other works, although it's definitely a long read."}, {"comment_id": "ezp5ysu", "post_id": "d1iwqb", "comment": "I told myself this is the one book of his im going to sit through since their all long commitments. One day ill read his other works but when im old"}, {"comment_id": "ezpaevw", "post_id": "d1iwqb", "comment": "I really loved the development of Levin’s character throughout the novel - he’s probably my favorite character!"}, {"comment_id": "ezpcdrp", "post_id": "d1iwqb", "comment": "Im glad he gets to marry katy. I  would be tight if he didn’t."}, {"comment_id": "ezprh7l", "post_id": "d1iwqb", "comment": "this book >>>> \n\nTolstoy’s prose is so descriptive it’s terrifying yet spellbinding. I’ve read it once but I plan on reading it again next year."}, {"comment_id": "ezpv8hc", "post_id": "d1iwqb", "comment": "Women out there or ones you know do you think Tolstoy is a feminist or at least an ally and do you think his portrayal of Anna's life is realistic? I also noticed this in War and Peace too."}, {"comment_id": "ezq9a0k", "post_id": "d1iwqb", "comment": "I have read somewhere - dunno if it's true - that he was deeply critical of Anna in the first version (which also, supposedly, was mainly about Anna and didn't have all those other subplots in it). Then he changed it so the reader feels more for Anna instead. Whether that was because he'd had some realisation about women's situation or something, I can't say."}, {"comment_id": "f0dob69", "post_id": "d1iwqb", "comment": "Nothing feminist about Tolstoy himself IMO. Although we do empathize with Anna (her loneliness and helplessness etc.), Tolstoy had a moral agenda that was strongly pro-marriage: you are sound and safe in a social and affective union. In AK, Lev and his wife are the models for this social institution. Anna's downfall is built around her inability to find happiness in marriage. Of course one could suggest a feminist reading by arguing that, in the novel, women find either \"family happiness\" or death.\n\nTolstoy has a novella titled \"Family Happiness\" which is also about marriage."}, {"comment_id": "ezpw6yq", "post_id": "d1iwqb", "comment": "I just love it! The only advice I’d give is to NOT watch the movie. It can never measure up to the book and I don’t want it to spoil your mood to finish the book 📖"}, {"comment_id": "ezqnrtw", "post_id": "d1iwqb", "comment": "Never. The movies are always horrible in comparison."}, {"comment_id": "ezq8m64", "post_id": "d1iwqb", "comment": "I loved Anna Karenina. I totally agree that there's a lot of detail but it still doesn't feel excessive or get boring. I also liked the ruminations about agriculture that Levin delved into now and then. Levin was also a favourite character of mine in that book, as was Kitty."}, {"comment_id": "f1ajys2", "post_id": "d1iwqb", "comment": "YES. You’d think descriptions of agriculture would be boring. But it’s soooo good! I’ll often be driving or something and I’ll remember the scene that I conjured in my head while reading of Levin in the wheat fields like it’s an actual memory. And it’s beautiful. It’s so hard to get people to read this book when my review is “you’ve never read a better book in your life bc it makes you love wheat.”"}, {"comment_id": "ezsaumf", "post_id": "d1iwqb", "comment": "I might get lot of downvotes for this comment. I just came on this subreddit to join, and this was the first post I started reading. I am not an avid reader like most of you here, but from last couple of years I am slowly reading or listening audio books (I don't know if people like audio books here or not).  Long ago, I watched Anna Karenina movie. I liked the movie, like Lavin's love story, Anna's struggle, Russian countryside, cinematography. \nRecently I decided to read the book, but I hated it. I was bored of long descriptions. I guess as a beginner, I shouldn't have read a classic. Don't know. I hope I would like to read it one day."}, {"comment_id": "ezsb7k1", "post_id": "d1iwqb", "comment": "Its ok. If you liked the movie, we probably wont have similar taste.   \n  \n  Def cant read a book like anna karenina as a beginner. Im like 100 books deep rn, not for the year, but since i started reading more frequently. Idk st what point u consider one a beginner ir not"}, {"comment_id": "f05prqd", "post_id": "d1iwqb", "comment": "Constant itch to reread this. Recently listened to the audiobook version by Maggie Gyllenhaal via Audible. What a bliss. Could spend months doing that every night -- sadly the book is too short for that."}, {"comment_id": "f0tqg64", "post_id": "d1iwqb", "comment": "Which translation do you read?"}, {"comment_id": "f0txm06", "post_id": "d1iwqb", "comment": "Don’t remember the name but some graduates translation from city college i believe. Will check later"}, {"comment_id": "f18ryi0", "post_id": "d1iwqb", "comment": "Anna karenina is a bit overrated for me. I think that there are good alternatives as Madame Bovary, the Idiot ecc....\nIf you wanna my advice you should read War and Peace by the same Author: MASTERPIECE"}, {"comment_id": "eprbqzd", "post_id": "bvoqqv", "comment": "Thanks! I am excited to do this first time reading along"}, {"comment_id": "eps71ur", "post_id": "bvoqqv", "comment": "Ohh.  This is my fav book of all time.  Better read it for the 10th time."}, {"comment_id": "epxgzln", "post_id": "bvoqqv", "comment": "There’s no such thing as too much Jane Eyre."}, {"comment_id": "eq33x7e", "post_id": "bvoqqv", "comment": "That's perfect. I'm doing a 2019 reading challenge and one of the bucket point is to read a book with over 500 pages. I didn't know what I wanted to read. I have bought Jane Eyre last year and I've always wanted to join a bookclub. Perfect timing. \nWell, for those who care, it will be my first time in this subreddit AND the first time I read Jane Eyre. I'm so excited."}, {"comment_id": "eq6957z", "post_id": "bvoqqv", "comment": "I'm in the same boat! I've been wanting to join another book club to get myself back into reading and my boyfriend suggested checking Reddit. I'm a book collector and have an obscene number of books I've not read, including a few novels by the  Brontë sisters. I loved the book discussions in my high school lit classes, so I'm really looking forward to this opportunity to read Jane Eyre with others."}, {"comment_id": "eq2wsou", "post_id": "bvoqqv", "comment": "I've started reading Jane Eyre before and never gotten through it. I am starting it again today and am looking forward to joining in the discussion of it here!"}, {"comment_id": "eq303jk", "post_id": "bvoqqv", "comment": "I find that reading along (sometimes) helps me finish a book I need some motivation for. We're here for you!"}, {"comment_id": "epsfecj", "post_id": "bvoqqv", "comment": "I am so very excited for this!!"}, {"comment_id": "eptfssv", "post_id": "bvoqqv", "comment": "[I'm ready](https://i.imgur.com/vEkNKBe.jpg)"}, {"comment_id": "epsz81l", "post_id": "bvoqqv", "comment": "I'll be joining! My first time here.\n\nI read Jane Eyre in high school and didn't really enjoy it, but I've been meaning to re-read it now that I have more of an appreciation for classics."}, {"comment_id": "epub03s", "post_id": "bvoqqv", "comment": "That's what happened to me with Gatsby, I think some of these books are better appreciated by older people."}, {"comment_id": "eptd6dl", "post_id": "bvoqqv", "comment": "I just received this book in a book swap and am looking forward to giving it a read. My first time participating here! Can’t wait to discuss 😊"}, {"comment_id": "eqfsdz8", "post_id": "bvoqqv", "comment": "First time trying Book Club. I’ve read Ch 1-4. I’ve been returning to this subreddit and also this post. I’m not seeing any activity beyond this. Perhaps that’s normal, but as a first-timer wanted to see if I was missing something."}, {"comment_id": "eqgtbnp", "post_id": "bvoqqv", "comment": "I'm in the same boat. I'm eager to discuss them so that I can keep going into the next set of chapters. I'm not sure if it will be a separate topic or if we are meant to discuss in this thread."}, {"comment_id": "eqh622r", "post_id": "bvoqqv", "comment": "No, I'll have a post up later tonight. I'm on Pacific time and it's early yet!"}, {"comment_id": "epsv35a", "post_id": "bvoqqv", "comment": "I have read this very often love the book. Have fun!"}, {"comment_id": "epwm3ja", "post_id": "bvoqqv", "comment": "Never done a book club before!! Can’t wait"}, {"comment_id": "eq8ba8u", "post_id": "bvoqqv", "comment": "When you finish it check out the two part episode of The Adapt or Perish podcast."}, {"comment_id": "eqfoew6", "post_id": "bvoqqv", "comment": "Oh noooo Im late already i wanted to read it again but I already have other books on my list :( what a shame!"}, {"comment_id": "eqq2mw6", "post_id": "bvoqqv", "comment": "i’m a little late - just found out abt this sub lol - but ive been meaning to read this book and hopefully will catch up and participate from next week on :)"}, {"comment_id": "ewa0iai", "post_id": "bvoqqv", "comment": "I’m super late, but I’ll try catching up for August 10th discussion! Wish me luck! ❤️"}, {"comment_id": "dzbs0j0", "post_id": "8kz46s", "comment": "Oh yes please!"}, {"comment_id": "dzbsa8y", "post_id": "8kz46s", "comment": "I would absolutely be interested. "}, {"comment_id": "dzbshv0", "post_id": "8kz46s", "comment": "I just started The Brothers Karamazov and would absolutely love to do discuss it!"}, {"comment_id": "dzbtpc0", "post_id": "8kz46s", "comment": "Bought this book a few months ago, definitely need to read it before I forget about it! "}, {"comment_id": "dzbv4ez", "post_id": "8kz46s", "comment": "This would be awesome! I've been meaning to reader Brothers Karamzov for a while. Please choose this!"}, {"comment_id": "dzbvg7a", "post_id": "8kz46s", "comment": "Heck yes!!"}, {"comment_id": "dzbvr2n", "post_id": "8kz46s", "comment": "I'm in."}, {"comment_id": "dzbzi7l", "post_id": "8kz46s", "comment": "I am so in"}, {"comment_id": "dzc0uuq", "post_id": "8kz46s", "comment": "I’m in! I started reading it and felt kinda lost. I’d enjoy it and understand it better with more people for sure! "}, {"comment_id": "dzd5msp", "post_id": "8kz46s", "comment": "There's never been a response like this to an evergreen proposal, that's really great.  I think you should put together a schedule and fire it up.  \n\nI'll be in, I've just been re\\-reading C&P myself, which we read here last Feb\\-April.  I last tried BK 33 years ago, and I lost interest like 40 pages from the end, so I've been meaning to come back for awhile now."}, {"comment_id": "dzcg1fm", "post_id": "8kz46s", "comment": "I’m in. "}, {"comment_id": "dzci7av", "post_id": "8kz46s", "comment": "I'm in ! :)"}, {"comment_id": "dzcp05g", "post_id": "8kz46s", "comment": "I'm interested! Bought it a while ago but haven't made time to sit down and read it."}, {"comment_id": "dzctz9u", "post_id": "8kz46s", "comment": "Let’s do it! "}, {"comment_id": "dzcz0lp", "post_id": "8kz46s", "comment": "Yes please! I listened Crime and Punishment recently and would love to read another Dostoevsky book with a group."}, {"comment_id": "dzczdjh", "post_id": "8kz46s", "comment": "Read this a couple years ago on my own and got lost in some parts, would love to discuss it with others!"}, {"comment_id": "dzczrkg", "post_id": "8kz46s", "comment": "Totally in"}, {"comment_id": "dzdbvdj", "post_id": "8kz46s", "comment": "I'm in!"}, {"comment_id": "dzdcr24", "post_id": "8kz46s", "comment": "I’d love this as well! "}, {"comment_id": "dzde6it", "post_id": "8kz46s", "comment": "Yes please! It will make up for the disappointing choice of long read!"}, {"comment_id": "dzdrlms", "post_id": "8kz46s", "comment": "I’m in!"}, {"comment_id": "dzfea8m", "post_id": "8kz46s", "comment": "Joining in as well, thanks for organizing this!"}, {"comment_id": "dzgo0tt", "post_id": "8kz46s", "comment": "Would love to!"}, {"comment_id": "dzkr0g8", "post_id": "8kz46s", "comment": "I'd really enjoy this too"}, {"comment_id": "dzlv7tt", "post_id": "8kz46s", "comment": "\\+1"}, {"comment_id": "dzmfi0j", "post_id": "8kz46s", "comment": "I am in "}, {"comment_id": "dzuva73", "post_id": "8kz46s", "comment": "Little late to the party but just wanted to chime in to say I’ll be taking part as well!"}, {"comment_id": "dzbw5c1", "post_id": "8kz46s", "comment": "I would love that!"}, {"comment_id": "dzc26ys", "post_id": "8kz46s", "comment": "Been wanting to start up on Brothers Karamazov for a while, count me in. "}, {"comment_id": "dzc2789", "post_id": "8kz46s", "comment": "I wouldn't mind jumping on this, first time here so it'd cool. "}, {"comment_id": "dzc41hg", "post_id": "8kz46s", "comment": "I'm in depending on the time frame regarding beginning date and duration of read."}, {"comment_id": "dzckx1x", "post_id": "8kz46s", "comment": "I am probably not gonna read because I read it two years ago, but I would love to join in the discussions. There is so much to discuss there. "}, {"comment_id": "dzcoiu1", "post_id": "8kz46s", "comment": "I‘m in from the 12th of June onwards. Will probably have to do some catch-up-reading..."}, {"comment_id": "dzmlktz", "post_id": "8kz46s", "comment": "So is this happening? If so when? Very interested. New to the sub so unfamiliar with how things work."}, {"comment_id": "dzmravh", "post_id": "8kz46s", "comment": "Hi! Yes its happening. Check out the other thread that has the reading schedule. "}, {"comment_id": "dzq3hn5", "post_id": "8kz46s", "comment": "I just read this late last year and I can attest to it being a fantastic (and fat) read!"}, {"comment_id": "dzvsi9n", "post_id": "8kz46s", "comment": "I’m a few days late to the party, but I’d totally be interested. I read this book a couple of years ago and have been looking for an excuse to read it again. "}]