[{"comment_id": "dg4u36a", "post_id": "64r4de", "comment": "I read this in January and had the same experience. Absolutely couldn't put it down. Enjoy it!"}, {"comment_id": "dg4x1tf", "post_id": "64r4de", "comment": "I own it but havnt read it yet. I look forward to reading it!"}, {"comment_id": "dh7wam5", "post_id": "64r4de", "comment": "I absolutely love this book! I read it last year and I could not put it down! "}, {"comment_id": "djd0uw3", "post_id": "64r4de", "comment": "I was surprised by how much I enjoyed this book, I really fell in love with the two main characters and their journeys.  WWII is a favorite time period of mine to read about, but sometimes it can get a little repetitive, Doerr really wove together a fresh and amazing story."}, {"comment_id": "dg53qpc", "post_id": "64r4de", "comment": "I love his writing. You may enjoy his short stories as well. \"The Shell Collector\" was my favorite of the short story collections."}, {"comment_id": "dg6k2b7", "post_id": "64r4de", "comment": "I'll check that out.  Thank you!"}, {"comment_id": "dlw48n4", "post_id": "6uwejv", "comment": "I'm so jealous.  I wish I could read it all again for the first time.  Enjoy the journey! "}, {"comment_id": "dlxmlay", "post_id": "6uwejv", "comment": "I need to do this. I only read the first 3 as a kid and I want to re-start and go from beginning to end."}, {"comment_id": "dmed5ep", "post_id": "6uwejv", "comment": "Never too late. At least you don't have to wait for any new books to come out."}, {"comment_id": "dlw8esp", "post_id": "6uwejv", "comment": "That's awesome! I still remember my first time reading Harry Potter, and waiting anxiously for the next book to come out. \n\nWhat I want to know is whether you know all the big spoilers or not? "}, {"comment_id": "dlw8oll", "post_id": "6uwejv", "comment": "I guess I'm kind of lucky that I don't have to wait! Lol. I remember going through grade school trying to figure out why all these kids were so into these books and now I wish I would've gotten into them as a kid rather than as an adult. \n\nAlso yes, unfortunately, I watched all of the movies a couple of years ago when I was still not into reading ):"}, {"comment_id": "docznl5", "post_id": "6uwejv", "comment": "Honestly, The Goblet of Fire is my favorite one :) Enjoy!!"}, {"comment_id": "ekjxjhj", "post_id": "bbiz6y", "comment": "I read it once ever year or two. Hands down my favorite book"}, {"comment_id": "ekjzm9t", "post_id": "bbiz6y", "comment": "I just listened to this as an audiobook last month for the first time and I loved it!! I'm super excited for the show to come out."}, {"comment_id": "ekljl00", "post_id": "bbiz6y", "comment": "I'm currently reading this too! I love it so much!"}, {"comment_id": "cibfkrg", "post_id": "28j5de", "comment": "You're on a roller coaster that only goes up my friend."}, {"comment_id": "cibfne5", "post_id": "28j5de", "comment": "Whoot! Excellent. I haven't been able to read much fiction for the past few years, so this is a great find. "}, {"comment_id": "cibjo96", "post_id": "28j5de", "comment": "If you thoroughly enjoy the book I would recommend you read the entire series. It is a delightful, insightful, and comical work of fiction which will take you to the farthest depths of the galaxy and back. "}, {"comment_id": "cjf788r", "post_id": "28j5de", "comment": "IMHO it keeps getting better and better for the first 3 books, so keep it up :D\n\nThe 4th is... different. It is not bad, just very different. The 5th is similar to the first ones, but is not my favorite. I would still recommend the whole series.\n\nWhere are you in the book right now?"}, {"comment_id": "c9efy41", "post_id": "1c9txm", "comment": "by far my favorite author!"}, {"comment_id": "c9ek91w", "post_id": "1c9txm", "comment": "Fantastic book!"}, {"comment_id": "c9emyjy", "post_id": "1c9txm", "comment": "Really nice read"}, {"comment_id": "c9o4gls", "post_id": "1c9txm", "comment": "Would this be a good starter book for someone who hadn't yet read anything by Gaiman? I suspect I'd like him a lot, but not sure what to grab for my Kindle."}, {"comment_id": "cc017dn", "post_id": "1c9txm", "comment": "This is definitely a good book on which to cut your teeth!  You will find yourself completely wrapped up in this fictional world.  Just be prepared to look up a few of the less-familiar gods."}, {"comment_id": "ccqw810", "post_id": "1c9txm", "comment": "It was my first Gaiman book and I think it was a great way to start with this amazing writer."}, {"comment_id": "cb1d1v4", "post_id": "1c9txm", "comment": "I finished this before starting my most recent. I love Gaiman--my favorite so far is the Graveyard Book, followed by Good Omens (co written with Terry Pratchett). "}, {"comment_id": "cc014t3", "post_id": "1c9txm", "comment": "WOW!  This was an amazing book.  I was teaching a class on mythology, and I made this an optional, EC read.  Fantastic narrative, brilliant creation of the \"gods,\" charismatic characters, and a dynamite ending.  A++.\n\nI have all of his works, but this was definitely one of the top two."}, {"comment_id": "ddnd7vp", "post_id": "5tjy01", "comment": "This is one of my favorite novels! I love the book because it provides so much intricate detail to everything. Although Malcolm annoys me with his long rants after a while, they're still masterful. Highly recommend the second book as well. "}, {"comment_id": "ddnxzez", "post_id": "5tjy01", "comment": "yeah the detail in it is fantastic. i love the film but the film really is just \"hey heres some interesting characters and some cool dinosaurs on an island\". where as the book is a delve into the power that genetic science affords us and if/how we should use that. and also some great characters getting chased by same freaking cool dinosaurs"}, {"comment_id": "ddn3pm9", "post_id": "5tjy01", "comment": "I have and also really enjoyed it much better than the movie( though I do really like the movie). I would highly recommend you also read the second book lost world if you enjoyed Jurassic park :)"}, {"comment_id": "ddn3u26", "post_id": "5tjy01", "comment": "definitely will get around to that. i think im going to like a lot of Michael Crichton's stuff"}, {"comment_id": "dec64y5", "post_id": "5tjy01", "comment": "I absolutely loved it, not having had high expectations when I started it. So much better than the movie -- although the movie was actually pretty good."}, {"comment_id": "c84odol", "post_id": "17dfl6", "comment": "I just finished the book...wow! It was so fantastic!  So many people refuse to read ASOIAF because it's so long, drawn out, boring, confusing, etc. While at times I sympathize with these people, I am so glad that I chose to continue with the series. A Storm of Swords is easily one of the best books I've ever read."}, {"comment_id": "c869pdj", "post_id": "17dfl6", "comment": "Haha congrats, I just finished up with the 5th one and I must say the series has been enjoyable. I agree though, they can be quite exhausting. 3rd book was definitely eventful."}, {"comment_id": "c86injn", "post_id": "17dfl6", "comment": "Yeah, great book. My favorite in the series. \nCan't wait for the 6th one. "}, {"comment_id": "c8sxc1b", "post_id": "17dfl6", "comment": "This is my favorite in the series. So much happens, it's hard to put down!"}, {"comment_id": "c56ksuw", "post_id": "vommt", "comment": "I avoided Vonnegut for so many years, as I was afraid it wouldn't live up to everything I hoped it would be... \n\nDear gosh though, Slaughterhouse 5 is brilliant. I read it in a day, straight after reading Forever War by halderman, could not recommended either book too highly... \n"}, {"comment_id": "c57dsi5", "post_id": "vommt", "comment": "Slaughterhouse Five is absolutely brilliant. I was forced into reading it in a high school class and fell in love with Vonnegut from that point.\nJust finished up reading Sirens of Titan not too long ago. I can't say I've ever read a Vonnegut book I haven't liked."}, {"comment_id": "c56fk32", "post_id": "vommt", "comment": "i thought this was a video game. \n\nis it a history book, or a work of fiction? "}, {"comment_id": "c56qole", "post_id": "vommt", "comment": "It's science fiction/ historical fiction, I guess - but the POV from the narrator of the story draws on Vonnegut's own experiences in the war. It's a quick read, you could grab a copy from the library, ensconce yourself somewhere, and have if returned in a few hours."}, {"comment_id": "c56xgrx", "post_id": "vommt", "comment": "I'm hoping to read this after Cats Cradle. Hope it lives up to my expectations. "}, {"comment_id": "c578frg", "post_id": "vommt", "comment": "I liked Cat's Cradle at the time, but again, not a big hit because after 5 years I don't remember anything about it. I think that's more to do with my head space at the time, though. We have it around here somewhere, along with Breakfast of Champions which I DO remember... depressed the hell out of me. I just need to start over, I think. \nHow are you liking Cat's Cradle?"}, {"comment_id": "c57f9g8", "post_id": "vommt", "comment": "I like Cat's Cradle more, for what it's worth. Slaughterhouse Five is more \"important\" and literary I think, but Cat's Cradle fascinates me more."}, {"comment_id": "c589uxs", "post_id": "vommt", "comment": "I actually believe Cats Cradle is his best work followed closely by Sirens of Titan. Doesn't matter though all of his works are great."}, {"comment_id": "c571fzm", "post_id": "vommt", "comment": "I haven't read this yet, it's going to be one of my holiday reads in a couple of weeks. \n\nI have only read \"Welcome to The Monkey House\" - Short stories by VG, can honestly say I've never been as taken and addicted by a short story collection since the first time I read Kiss Kiss by Roald Dahl when I secretly read my Dad's copy as a 10 year old after being told it would scare the crap out of me! \n\nSo exited about reading Slaughterhouse Five, his visions are so brick-shittingly plausible (with my slightly melodromatic, pessimistic \"what if\" paranoid) thoughts about the future,he just grabs you by the imagination and manages to plant deliciously jaw clenching no hope disaster scenarios! "}, {"comment_id": "eipk348", "post_id": "b1xe3q", "comment": "Yo I read this book years ago and I still think about it all the time. Such a beautiful snapshot of someone else’s mind. "}, {"comment_id": "eisvvix", "post_id": "b1xe3q", "comment": "Just finished it and I looooveed it!\nAmazing narative, I agree."}, {"comment_id": "ex4sktb", "post_id": "b1xe3q", "comment": "I loved this book."}]