[{"comment_id": "eytgt3x", "post_id": "cyppjo", "comment": "Great composition, it has wonderful flow"}, {"comment_id": "eytnob2", "post_id": "cyppjo", "comment": "The yellow cloth reminds me of the yellow turban rebellion in China. I wonder if that was intentional."}, {"comment_id": "eyu0zzs", "post_id": "cyppjo", "comment": "Love this"}, {"comment_id": "eyu3x5g", "post_id": "cyppjo", "comment": "Very Art Nouveau-ish vibe from this, love it!"}, {"comment_id": "eyu4nag", "post_id": "cyppjo", "comment": "We build and send HK a statue of liberty, or one of our extra classy ones in Vegas"}, {"comment_id": "eyu79kz", "post_id": "cyppjo", "comment": "Truth lol"}, {"comment_id": "eytiucn", "post_id": "cyppjo", "comment": "This is amazing. Do you do commissions?"}, {"comment_id": "eytq4qm", "post_id": "cyppjo", "comment": "Thank you very much! I do from time to time but it can be difficult juggling that with my day job 😅"}, {"comment_id": "eytm14u", "post_id": "cyppjo", "comment": "That representation of the flames against the smoke grenades is brilliant."}, {"comment_id": "eyu3ndt", "post_id": "cyppjo", "comment": "I think it’s tear gas, not just smoke."}, {"comment_id": "eytlra8", "post_id": "cyppjo", "comment": "You are extremely talented"}, {"comment_id": "eytpvnf", "post_id": "cyppjo", "comment": "Thank you so much! 🙇‍♂️"}, {"comment_id": "eyu5tk3", "post_id": "cyppjo", "comment": "And equally well practiced."}, {"comment_id": "eytnscq", "post_id": "cyppjo", "comment": "People say this evokes Communist propaganda posters but I can't help but think of Delacroix's Liberty Leading the People instead\n\nGiven the subject matter, either would be cutting parallels.\n\nExcellent work!"}, {"comment_id": "eytsj3s", "post_id": "cyppjo", "comment": "yeah, unfortunately i think a lot of people ONLY recognize communist propaganda & forget all the incredible art deco iconography-- including both populist & fascist themes!-- that came right before it"}, {"comment_id": "eytyjxd", "post_id": "cyppjo", "comment": "Thats becouse they only know communist propaganda posters\n\nIf you ask me it reminds me more of Austrian World War 1 stuff, with their Golden flags and female personifications of Germany/Austria leading troops etc."}, {"comment_id": "eytwtp8", "post_id": "cyppjo", "comment": "Yeah. It’s clearly Delacroix-inspired. It doesn’t look like socialist realism at all."}, {"comment_id": "eyubl3d", "post_id": "cyppjo", "comment": "Doesn’t look communist at all to me"}, {"comment_id": "eyud0h6", "post_id": "cyppjo", "comment": "I can see some similarities to the manifest destiny painting in terms of design (but not in message obviously)."}, {"comment_id": "eyu0qc3", "post_id": "cyppjo", "comment": "Either way it's still very much propaganda."}, {"comment_id": "eytxs8s", "post_id": "cyppjo", "comment": "\nHey /u/OllieOrly,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts."}, {"comment_id": "eytllil", "post_id": "cyppjo", "comment": "Wow this looks amazing congrats"}, {"comment_id": "eytj58j", "post_id": "cyppjo", "comment": "This is great. Kind of reminds me of those impeccably designed Soviet Propaganda posters.\n\nClear message which the visual narrative directly upholds."}, {"comment_id": "eyu4fpw", "post_id": "cyppjo", "comment": "The woman is definitely inspired by the Goddess of Democracy statue from the Tiananmen Square protests, which itself had its roots in American propaganda for Manifest Destiny with Lady Columbia, who was the personification of the United States (and is who the Statue of Liberty is depicting).\n\nThe style is very much like Soviet Realism and other propaganda from the 1920s/1930s.\n\nPropaganda proceeds propaganda."}, {"comment_id": "eytqkig", "post_id": "cyppjo", "comment": "Soviet propaganda meets 90s graphic novel artists."}, {"comment_id": "eytvvfn", "post_id": "cyppjo", "comment": "Chinese and Soviet propaganda shared a lot in common in their days, there is even a series of joint posters where the message is written in both languages.\n\nIMHO, if OP used a little less modern typography, you could really pass it for the period correct poster, they did an amazing job."}, {"comment_id": "eytu25d", "post_id": "cyppjo", "comment": "Fun fact: student protestors at Tianamen Square constructed a paper mache statue of the guardian of democracy, very similar to the one depicted here"}, {"comment_id": "eytzasj", "post_id": "cyppjo", "comment": "OP based her off of that"}, {"comment_id": "eyu4lhb", "post_id": "cyppjo", "comment": "Interesting fact about the Guardian/Goddess of Democracy is that it was based on Lady Columbia who was the personification of manifest destiny and the United States during its westward expansion and massacre of the native people of North America.\n\nSymbology is so interestingly tied to causes that tend to not understand the artistic heritage of their origins."}, {"comment_id": "eyu4nns", "post_id": "cyppjo", "comment": "Which the CCP elites misinterpreted as the Statue of Liberty which pissed them off. It was the one of the last straws that broke the camel's back for them."}, {"comment_id": "eyufep4", "post_id": "cyppjo", "comment": "So how did that work out for them?"}, {"comment_id": "eytl9lp", "post_id": "cyppjo", "comment": "This is absolutely gorgeous!! Well done!"}, {"comment_id": "eyu1oc7", "post_id": "cyppjo", "comment": "Beautiful composition and coloring! \n\nIf I could make one suggestion, the font choice feels a bit off and I believe detracts from the overall piece. Try experimenting with others if you haven't! Or even mixing two different ones, you might like the result!"}, {"comment_id": "eyu3os9", "post_id": "cyppjo", "comment": "Yeah, love the piece but the typeface choice doesn't feel right... very out of place, throws off the harmony in an otherwise elegant piece."}, {"comment_id": "eytsd7a", "post_id": "cyppjo", "comment": "Does that represent lady liberty or a different figure from chinese culture?"}, {"comment_id": "eyttfyr", "post_id": "cyppjo", "comment": "She’s the Goddess of Democracy, a sort of syncretic symbol originally created for the Tiananmen Protest in 89. I put her in a cheongsam, which is a modern yet traditional garment that’s become closely associated with Hong Kong culture over the years."}, {"comment_id": "eytm2gr", "post_id": "cyppjo", "comment": "You should post this over at /r/retrofuturism \n\nI'm sure they would enjoy it. The design is 10/10"}, {"comment_id": "eytpszu", "post_id": "cyppjo", "comment": "Thank you so much! Yes my stuff tend to look retro because I draw so much inspiration from the past. In this instance La Liberté is definitely one of them, as well as early 20th century Chinese poster art... The Goddess of Democracy was originally created for the Tiananmen Protest in 89, her torch was meant to banish the darkness of totalitarianism 😊"}, {"comment_id": "eytn2ed", "post_id": "cyppjo", "comment": "How is this retro futurism?"}, {"comment_id": "eyu494a", "post_id": "cyppjo", "comment": "This looks retro inspired, but there is literally not a single futuristic aspect to this."}, {"comment_id": "eytpw3r", "post_id": "cyppjo", "comment": "The typography feels rather hurried, but otherwise it’s a very good poster."}, {"comment_id": "eytqpcz", "post_id": "cyppjo", "comment": "Yeek thank you for the feedback! Typography’s never been a strong suit of mine, good thing it’s on a separate layer 😆"}, {"comment_id": "eyu1gv2", "post_id": "cyppjo", "comment": "Agreed, that's my only complaint on this otherwise awesome piece"}, {"comment_id": "eyu0dq5", "post_id": "cyppjo", "comment": "Ever thought about making this a sticker? If so, I would love to do that for you!"}, {"comment_id": "eyu0fw2", "post_id": "cyppjo", "comment": "That’s a great idea."}, {"comment_id": "eytju4g", "post_id": "cyppjo", "comment": "This'll be in a textbook someday as an example of a political cartoon."}, {"comment_id": "eyufirf", "post_id": "cyppjo", "comment": "Everything about this is absolutely beautiful."}, {"comment_id": "eytf6k3", "post_id": "cyppjo", "comment": "Try crossposting to r/propagandaposters"}, {"comment_id": "eytn34s", "post_id": "cyppjo", "comment": "Better yet: r/modernpropaganda"}, {"comment_id": "eytudy2", "post_id": "cyppjo", "comment": "That one is for historical propaganda posters."}, {"comment_id": "eyucr7r", "post_id": "cyppjo", "comment": "Ooh, interesting!"}, {"comment_id": "eytsf7t", "post_id": "cyppjo", "comment": "this is fucking beautiful, both visually and conceptually/politically. thank you for using your skills for the benefit of the people!"}, {"comment_id": "eyts3vg", "post_id": "cyppjo", "comment": "Love this, thank you for sharing it <3"}, {"comment_id": "eytuqaw", "post_id": "cyppjo", "comment": "This could really fit on r/PropagandaPosters"}, {"comment_id": "eytyqkn", "post_id": "cyppjo", "comment": "This is very well done! reminds me a lot of \" Liberty Leading the People\""}, {"comment_id": "eyubk9u", "post_id": "cyppjo", "comment": "Tankie admin will delete this in 3...2...1...."}, {"comment_id": "eyudjlz", "post_id": "cyppjo", "comment": "I like that the style reminds me of the propaganda posters used by China but flipped to represent the message of democracy and freedom. Amazing work!"}, {"comment_id": "eytpvbh", "post_id": "cyppjo", "comment": "Lovely composition and colours, and as someone with ties to Hong Kong this suddenly and quite unexpectedly gave me a lump in my throat."}, {"comment_id": "eytz8ko", "post_id": "cyppjo", "comment": "Too bad the rest of the world is more concerned with hurting their buisness relationship with China than helping Hong Kong. My government (Norway) has not made a single statement about what's happening. But new deals with China just last month is okay. I'm fucking ashamed of them."}, {"comment_id": "eyu8k6u", "post_id": "cyppjo", "comment": "I don't see the rest of the world doing much to stand with Hong Kong.  Who has cut off trade with China over their treatment of Hong Kong? What sanctions are in place to stop China for simply continuing to do what they do until they've broken the will of the people of Hong Kong?"}, {"comment_id": "eytsf9x", "post_id": "cyppjo", "comment": "This kinda inspires me dude..."}, {"comment_id": "eytsj3b", "post_id": "cyppjo", "comment": "Amazing job, like the top comment said, incredible composition. A FUCKIN PLUS."}, {"comment_id": "eyttwni", "post_id": "cyppjo", "comment": "I sincerely wish this was true"}, {"comment_id": "eytuhif", "post_id": "cyppjo", "comment": "It makes me so sad we still deal with this"}, {"comment_id": "eyu1qli", "post_id": "cyppjo", "comment": "Are those people key figures from the videos of the protests?"}, {"comment_id": "eyu28w2", "post_id": "cyppjo", "comment": "Amazing. Love the colors and perspective. Really great work"}, {"comment_id": "eyu6bri", "post_id": "cyppjo", "comment": "Hey just wanted to let you know I'll be using your art to compare and contrast historical pushes for democracy to the current events of Hong Kong in my classroom this year and for the foreseeable future. Good job, and thanks!"}, {"comment_id": "eyu98qh", "post_id": "cyppjo", "comment": "Remember to credit art 👍"}, {"comment_id": "eyuaqdh", "post_id": "cyppjo", "comment": "great.  looks like an updated Mucha poster"}, {"comment_id": "eytzbll", "post_id": "cyppjo", "comment": "I just awoke from a dream where protesters were marking police with yellow-orange dye powder as a counter to the blue dye. Seeing this is eerie."}, {"comment_id": "eyu252r", "post_id": "cyppjo", "comment": "They should. Fuck Imperial China."}, {"comment_id": "eyu3x7k", "post_id": "cyppjo", "comment": "Blue dye?"}, {"comment_id": "eytykvp", "post_id": "cyppjo", "comment": "I’m not tied to Hong Kong or China in any way but this poster makes me want to put on a mask and protest alongside them"}, {"comment_id": "eytq7at", "post_id": "cyppjo", "comment": "Democracy is great and all until it’s the Democracy you don’t want"}, {"comment_id": "eytsi0x", "post_id": "cyppjo", "comment": "I think it’s a quote from Winston Churchill and I’m paraphrasing it: “Democracy is the worst government there is except for all of the others.”"}, {"comment_id": "eyts26m", "post_id": "cyppjo", "comment": "What is with these Hong Kong pieces and stellar framing? \n\nI can't think of a single aspect of this I would change, it's beautiful!"}, {"comment_id": "eyuaglr", "post_id": "cyppjo", "comment": "It’s strange to see people in Asia taking democracy more seriously than people in the West and being more willing to stand up for their values than them as well."}, {"comment_id": "eyth0i1", "post_id": "cyppjo", "comment": "Can you post it without the text? That would make it absolutely impeccable"}, {"comment_id": "eytsvax", "post_id": "cyppjo", "comment": "wat. the text is part of the design. that's like asking boticelli to remove venus' shell"}, {"comment_id": "eytxdj8", "post_id": "cyppjo", "comment": "unfortunately, this was probably composed with the text in mind, so simply removing it would throw things off a bit."}, {"comment_id": "eytou6z", "post_id": "cyppjo", "comment": "Absolutely beautiful. Striking visuals and an awesome message. You should post this in r/sino and watch those tankies ree tf out."}, {"comment_id": "eytqfpx", "post_id": "cyppjo", "comment": "Hahaha thank you! It’s tempting although I’m too chicken shit for that kind of excitement. Everyone else is free to post this wherever though! I just thought.. what’s a lowly illustrator to do when his home is being terrorised, my intention is simply to spread awareness 😊"}, {"comment_id": "eytue3e", "post_id": "cyppjo", "comment": "This shit looks like something from mirrors edge."}, {"comment_id": "eytv5az", "post_id": "cyppjo", "comment": "This is beautiful, definitely reminds me of the look of Soviet propaganda from the 50s and 60s."}, {"comment_id": "eyu08pd", "post_id": "cyppjo", "comment": "I hope they can be free. It’s a shame Chiang Kai-shek lost the civil war."}, {"comment_id": "eyu1l2e", "post_id": "cyppjo", "comment": "I love it. It's gorgeous.\n\nDoesn't wearing white signify death and mourning? Was that a design choice? I might be wrong but thought I'd ask."}, {"comment_id": "eyu2ewe", "post_id": "cyppjo", "comment": "I was wondering the same thing. I know traditionally in China white clothing was worn to funerals but there's also been a huge boom in white wedding dresses in recent years so maybe the meaning's not so important anymore."}, {"comment_id": "eyu2n9x", "post_id": "cyppjo", "comment": "China is trying to secure their land before the big catastrophe. Every country is preparing for it."}, {"comment_id": "eyu3qbz", "post_id": "cyppjo", "comment": "This is an incredible piece, thank you for creating and sharing this with the world."}, {"comment_id": "eyu3uyk", "post_id": "cyppjo", "comment": "Welcome to AntiMaidan, my friends"}, {"comment_id": "eyu466y", "post_id": "cyppjo", "comment": "Democracy is so hot right now"}, {"comment_id": "eyu4bwt", "post_id": "cyppjo", "comment": "“Gentlemen, this is democracy made manifest!”"}, {"comment_id": "f00pkbl", "post_id": "d38qod", "comment": "the Astro van I think is the best detail. when I first got started in carpentry. I got one for $1,500 and it served me with no major repairs for almost 10 years."}, {"comment_id": "f00vsoe", "post_id": "d38qod", "comment": "I just looked and the Astro Van has been out of production since 2005 😲"}, {"comment_id": "f0175jw", "post_id": "d38qod", "comment": "Now my eyes are playing tricks on me. The left side of the van looks lower than the right side."}, {"comment_id": "f01d7bv", "post_id": "d38qod", "comment": "My dad has a 1999 Astro van. It’s the most dependable vehicle in the family, I was brought home from the hospital in it and it was the car I learned to drive in. It’s also the car I used to move out of my family home. It means a lot to my family, lots of trips and hauls to and from Home Depot. Very cool."}, {"comment_id": "f0196gc", "post_id": "d38qod", "comment": "Yeah but the bumper and window lines not matching up from left to right is really bothering me."}, {"comment_id": "f01n4qy", "post_id": "d38qod", "comment": "I want to buy a 96 Astro van for $500 to travel. There’s around 120k miles. Bad idea?"}, {"comment_id": "f018rrb", "post_id": "d38qod", "comment": "I bought a 2001 as my first vehicle in 2013 for 2k, and I unfortunately had every problem. Transmission, brake lines, alternator, all went out within a year of me owning it."}, {"comment_id": "f0180qe", "post_id": "d38qod", "comment": "During the mid 90s I replaced 7 fuel pumps in my Astro van in less than a year. That was a hell of a couple months."}, {"comment_id": "f01cjgb", "post_id": "d38qod", "comment": "r/vanlife"}, {"comment_id": "f01h42n", "post_id": "d38qod", "comment": "Astro Vans are the ubiquitous vehicle of the immigrant workers in my area too. That's what initially caught my eye in the painting."}, {"comment_id": "f0248e0", "post_id": "d38qod", "comment": "This just happened **today:** A (Latino) guy was replacing the carpet in the apartment next to mine, and when I got to the parking lot and saw his vehicle:   \nChevy Astrovan."}, {"comment_id": "f02bpsp", "post_id": "d38qod", "comment": "Bumper alignment is off"}, {"comment_id": "f02gfbh", "post_id": "d38qod", "comment": "We had one as a family vehicle when I was growing up. Motherfucker made it to 300,000 miles before we got a new SUV."}, {"comment_id": "f02ko2q", "post_id": "d38qod", "comment": "I'm wondering why the artist left the hinge at right, but omitted the seam where right and left door meet?"}, {"comment_id": "f00zuxv", "post_id": "d38qod", "comment": "Incorrect!!! Where's the Fabuloso!"}, {"comment_id": "f01oq2j", "post_id": "d38qod", "comment": "I grew up helping my mom clean houses with Lemon Pledge as the all-purpose cleaner. That was 30 yrs ago. A friend only recently introduced me to fabuloso. Holy crap that is some good stuff! How long has that stuff been around?"}, {"comment_id": "f017ngl", "post_id": "d38qod", "comment": "Fabuloso - the smell of clean"}, {"comment_id": "f027swo", "post_id": "d38qod", "comment": "My drill Sargent told me there was a shortage of fabuloso, so the military bought it all, but we could only have one cap-full to mop our barracks every night"}, {"comment_id": "f0250ij", "post_id": "d38qod", "comment": "LMAO! I still buy this cuz my mom swears by it. She started making her own experimentally friendly cleaning solutions a couple years back but still managed to keep the Fabuloso because nothing else would clean the floors that good."}, {"comment_id": "f01eso9", "post_id": "d38qod", "comment": "Wasn't just me then"}, {"comment_id": "f02r6ej", "post_id": "d38qod", "comment": "[Fabuloso](http://www.pjdistributors.com/fabuloso-lavanda-12-1lt/)\n is my favorite soft drink. \n\nSome people try to convince me \"you're not supposed to drink it\" but [it says \"soda\" right on the bottle](http://www.majorkats.com/Fabuloso-2-pack-special-_p_91.html)!"}, {"comment_id": "f00qkmi", "post_id": "d38qod", "comment": "FYI, the original 'American Gothic' features a house which was ordered from the Sears-Roebuck catalog, and included the \"ornate window\" option.\n\nOff topic, but I thought people might find that interesting.\n\nEdit: I am sorry, I've been corrected. Only the windows were ordered from Sears. For what it's worth, I learned this apparently-incorrect fact from Rich Halls documentary 'Working for the American Dream'"}, {"comment_id": "f00y4yc", "post_id": "d38qod", "comment": "The windows were ordered from the Sears catalog, not the house. [And it's still standing in Eldon, Iowa to this day.](https://en.wikipedia.org/wiki/American_Gothic_House)"}, {"comment_id": "f00rak6", "post_id": "d38qod", "comment": "I do find that interesting.  Thank you."}, {"comment_id": "f00wz59", "post_id": "d38qod", "comment": "Sometimes I forget about sears homes. Thank you never knew that about that piece."}, {"comment_id": "f0166ad", "post_id": "d38qod", "comment": "And just to add.  The window is shaped into a pointed arch which is referential to the gothic style of architecture, hence the “ironic name” of the piece."}, {"comment_id": "f00yr2j", "post_id": "d38qod", "comment": "Are you certain? The house is known as The Dibble House and was built in 1882  whereas Sears sold homes from 1908.\n\nHowever the gothic window in the house WAS ordered from a Sears catalogue."}, {"comment_id": "f00vycg", "post_id": "d38qod", "comment": "Wow! Those homeowners must have had at least 90 construction to get the ornate window!"}, {"comment_id": "f00yoiv", "post_id": "d38qod", "comment": "I'm pretty sure 99% invisible did an episode on the sears catalog and tracked some of the houses to see if they were still standing"}, {"comment_id": "f00tf10", "post_id": "d38qod", "comment": "Did not know that , thank you !"}, {"comment_id": "f018a2g", "post_id": "d38qod", "comment": "Also, the original featured a father and daughter. Most re-makes feature a husband and wife."}, {"comment_id": "f00yfjf", "post_id": "d38qod", "comment": "It was only the window that was ordered, though."}, {"comment_id": "f00yss2", "post_id": "d38qod", "comment": "Atlanta’s current Ponce City Market was the Sears hub for the South. It was huge. Trains would deliver homes via rail road, among other things."}, {"comment_id": "f016epm", "post_id": "d38qod", "comment": "Rich Hall is an unsung national treasure."}, {"comment_id": "f02cgbf", "post_id": "d38qod", "comment": "My current house is a sears house. The Chelsea model to be exact. Almost nothing changed and still has a few original floors."}, {"comment_id": "f02lpc5", "post_id": "d38qod", "comment": "Off off topic. The sears catalog was popular among black americans because they could order w/o dealing with a bigot at the cash register."}, {"comment_id": "f00i8ss", "post_id": "d38qod", "comment": "This is great, also, love the Astro van they're driving. \n\nI used to drive one back in the day. She was a beautiful whale princess with a bumpin' sound system."}, {"comment_id": "f00pwru", "post_id": "d38qod", "comment": "Astro van with the “Dutch rear door” (I think that’s what they called it).\n\nI remember being fascinated with that option, we had a similar van at the time that was purchased prior to the Dutch door being available."}, {"comment_id": "f00kv1l", "post_id": "d38qod", "comment": "Given the original picture depicted the couple’s house in the background, I wonder if this version implies that they’re living out of that van."}, {"comment_id": "f00om51", "post_id": "d38qod", "comment": "I concur. I have had 2 Astro vans.  They were rock solid!"}, {"comment_id": "f01cv5j", "post_id": "d38qod", "comment": ">with a bumpin' sound system.\n\nIs this a thing with vans? I drove a small van in highschool/college, and my family owned one as well, and both had *superb* sound systems. They were all the standard option models too.."}, {"comment_id": "f01yaor", "post_id": "d38qod", "comment": "Fun fact: Jesus drives an astrovan"}, {"comment_id": "f00i09w", "post_id": "d38qod", "comment": "I love this. I come from a family of farmers and that original painting really did capture the spirit of the hardworking individuals who help keep this country afloat (and, ya know, fed). Working immigrants are exactly the same. Putting in the work, building a life, establishing themselves in a needed industry. Well done this is amazing."}, {"comment_id": "f00w9bw", "post_id": "d38qod", "comment": "I work alongside several landscaping companies and I have no idea how there’s still a stereotype of Hispanics being lazy. Most of the landscapers I see are working at dawn until dusk. Many of them 6+ days a week."}, {"comment_id": "f00ri5p", "post_id": "d38qod", "comment": "I saw a meme yesterday about how the hardest part of work is pretending to look busy for 8 hours and I was like this is why we are the way we are."}, {"comment_id": "f00klyo", "post_id": "d38qod", "comment": "While Americans are bitching about the old folks with their \"pull your bootstraps\" mentality, immigrants actually do it on a daily basis."}, {"comment_id": "f00x3ri", "post_id": "d38qod", "comment": "I’m an immigrant and I never worked in the fields or on farms, I went into HR and banking. But obviously was able to get that far by my parents hard work ."}, {"comment_id": "f00t9qb", "post_id": "d38qod", "comment": "I'm from a community with a large amount of hispanic people and those fuckers are crazy. They bust their assess off at work all day harder than you can , then party at night even harder than you can, and get back up at 5AM to do it all again. If even half of the country (myself included) could be like them it would be insane the shit we would get done."}, {"comment_id": "f00qce6", "post_id": "d38qod", "comment": "Agreed"}, {"comment_id": "f023ka3", "post_id": "d38qod", "comment": "[deleted]"}, {"comment_id": "f01n2gw", "post_id": "d38qod", "comment": "The expression is just priceless! \"A Chingarle que el dinero no crece en arboles\" - money don't grow on trees"}, {"comment_id": "f014z8g", "post_id": "d38qod", "comment": "For us it was the Mercury van (it was navy blue and i forge the model). My dad wasn't in landscaping, but worked nights and my mom has been cleaning houses for the last 20 years. I am humbled that my parents were able to do what they did and still smile. Got la chancla my fair share of times for my pendejadas, but wouldn't have had it any other way :)"}, {"comment_id": "f01leqw", "post_id": "d38qod", "comment": "This comment is beautiful\n\nEdit: You deserve an award."}, {"comment_id": "f01yo5j", "post_id": "d38qod", "comment": "For us it was a Ford Aerostar. my mom cleaned rooms at a hotel and my dad did all the maintenance in the same hotel as well as deliver pizza in the evenings."}, {"comment_id": "f022l44", "post_id": "d38qod", "comment": "My parents are both over 50 and my mom still works housekeeping, my dad still fixes tractors/machinery for a local farm as well as general agriculture"}, {"comment_id": "f0270a8", "post_id": "d38qod", "comment": "My mom worked as a babysitter and house cleaning for almost 25 years. Once my mom got legalized she got an office job with benefits and all. Unfortunately when my dad started to go in and out of the hospital because of his renal failure and he was on her insurance the company all of sudden started to downsize and my mom was laid off. She was so upset and realized corporate america sucks. \n\nMy mom really built great relationship with the kids she babysat or the families she cleaned for. One of her bosses even paid for some of my college tuition when financial aid was short. She felt that even in a dire situation they would have been more understanding. Or at least if she needed to leave she would have a good recommendation if she needed it. But happy ending to this story because she worked her butt off for us my oldest sister had a great paying job and was able to have my parent move in with her and take care of her kids for 11 years now. And pay them for it too!"}, {"comment_id": "f028ixf", "post_id": "d38qod", "comment": "For my family it was station wagons. My father left being an international businessman and worked landscaping, painting and construction. My mother cleaned multiple houses all day long. I am extremely grateful for their sacrifice and dedication to give us a better future."}, {"comment_id": "f00qssp", "post_id": "d38qod", "comment": "I'm a first generation Mexican and this is what I see everyday where I live. My parents took me to pick grapes a couple of times and that shit isn't fun or easy. Definitely makes me grateful that they risked it all so I wouldn't have to do this for a living. I have many family members who live this life everyday. It's definitely a struggle but they're some of the nicest, hardest working people in my life."}, {"comment_id": "f00tmxt", "post_id": "d38qod", "comment": "Thanks for this personal perspective. Then I scroll down and see people calling this painting racist just to score some SJW points...smh"}, {"comment_id": "f016t4q", "post_id": "d38qod", "comment": "Unless you're the first in your family to be born in/immigrate to Mexico, I think you mean \"first generation American.\""}, {"comment_id": "f01cln9", "post_id": "d38qod", "comment": "Every Janitor I've ever met has been a very nice person; the bias against them is totally ridiculous. IMO its 'successful' people who tend to be dickheads"}, {"comment_id": "f01emy2", "post_id": "d38qod", "comment": "first gen mexican or mexican-american?\n\nif the latter, igualmente"}, {"comment_id": "f03cjvg", "post_id": "d38qod", "comment": "I still help my mom clean houses from time to time. When I graduate and get a job hopefully my dad can retire."}, {"comment_id": "f012j3c", "post_id": "d38qod", "comment": "I live in rural Michigan, I see the migrants picking apples and peaches all the time, a hard working bunch."}, {"comment_id": "f0169oq", "post_id": "d38qod", "comment": "She nailed those hands.. Coming from a family where my father did field labor and mom early in her life, also has hands that look rough and over worked.."}, {"comment_id": "f010wzv", "post_id": "d38qod", "comment": "What is happening, r/Art posts that aren't half naked girls making it to the front page? I like it"}, {"comment_id": "f01l7a7", "post_id": "d38qod", "comment": "This is one of the coolest things I’ve seen in a long time. May I share this?"}, {"comment_id": "f03e7ry", "post_id": "d38qod", "comment": "Not the artist but it’s art man it’s meant to be shared and talked about"}, {"comment_id": "f04loh7", "post_id": "d38qod", "comment": "It's sweet that you ask.. But now it's on the front page of reddit. This cat's out of the bag. Just make sure you credit the artist!"}, {"comment_id": "f00ymk9", "post_id": "d38qod", "comment": "I can totally relate to this.  Parents were janitors, and that's how my brothers and I grew up.  Its a difficult life of daily struggle both with physical labors (mostly a grind as it is a daily job 7 days a week) and a mental labor (as in viewed as lower in this society).\nI have moved on but still have family grinding away.  It was a shitty life, cleaning other people's crap, and at the time (high school) I hated it.  Made me a Damn hard worker though, so there's that."}, {"comment_id": "f0108wx", "post_id": "d38qod", "comment": "i heard that’s Criselda’s dentist and sister that posed for the painting"}, {"comment_id": "f016u85", "post_id": "d38qod", "comment": "The context people seem to be missing: \n\nIf you do a quick google search you’ll learn that this is actually a portrait of the artist’s parents. \n\nObviously there’s a social/political element to it as well, but regardless of your thoughts on that, I feel like most people would agree that “I love my mom and dad and I want to paint them” is a fair enough reason to create this picture\n\n(Not that art needs any justification in the first place! But like I said, “I love my mom and dad and I want to paint them” is a pretty damn fair reason)"}, {"comment_id": "f01gof6", "post_id": "d38qod", "comment": "Oh wow, that definitely adds context. People are criticizing it as a stereotype when it's actually a legitimate perspective from the artist's private life."}, {"comment_id": "f00uw5b", "post_id": "d38qod", "comment": "The painting is beautiful but we need more lemon pledge"}, {"comment_id": "f01e93d", "post_id": "d38qod", "comment": "Needs more Fabuloso and Ajax."}, {"comment_id": "f00w96d", "post_id": "d38qod", "comment": "Yes, I knew I'd find this comment. No superman es no here"}, {"comment_id": "f01jhrb", "post_id": "d38qod", "comment": "You misspelled fabuloso."}, {"comment_id": "f01g3bc", "post_id": "d38qod", "comment": "Noooo....nooooo....you buy, you buy. Nooooo...."}, {"comment_id": "f01epir", "post_id": "d38qod", "comment": "[removed]"}, {"comment_id": "f030alq", "post_id": "d38qod", "comment": "Damn, I heard that dialogue you wrote too!"}, {"comment_id": "f00mwvx", "post_id": "d38qod", "comment": "I don’t like it because it makes me feel feelings that challenge my perception of the world and makes me appreciate people different from myself. That’s not what art is for."}, {"comment_id": "f00oqyf", "post_id": "d38qod", "comment": "Yeah, give us back the Campbells soup can!"}, {"comment_id": "f00w9q4", "post_id": "d38qod", "comment": "[removed]"}, {"comment_id": "f03pq4s", "post_id": "d38qod", "comment": "Do people not register this as sarcasm? Seesh."}, {"comment_id": "f00yydl", "post_id": "d38qod", "comment": "the little frowny face on the window of the trunk tho"}, {"comment_id": "f0299h6", "post_id": "d38qod", "comment": "And the happy one :)"}, {"comment_id": "f00rvfe", "post_id": "d38qod", "comment": "Oooooohhh time to sort by controversial and grab some popcorn."}, {"comment_id": "f00vwdv", "post_id": "d38qod", "comment": "\"Because dem Mexicans or because dem injuns?\" - Yosemite Sam"}, {"comment_id": "f019f9j", "post_id": "d38qod", "comment": "I didn’t even realize they were Mexicans till I read the comments. Must have to be American."}, {"comment_id": "f00drtz", "post_id": "d38qod", "comment": "Hate to be THAT commenter, but I believe that the original a father/daughter representation that is often misunderstood as husband/wife - as aspect lost here. I can nonetheless appreciate the thought that went into this work and it's historical roots in Realism."}, {"comment_id": "f00ey7m", "post_id": "d38qod", "comment": "Afaiu it, that was just a what the female model (the artist’s sister) told people because she resented being depicted as married to a man twice her age.\n\nEdit: I am sorry if my acronym upset anyone."}, {"comment_id": "f00ut7f", "post_id": "d38qod", "comment": "> Hate to be THAT commenter,\n\nNo you don't.  You love it."}, {"comment_id": "f00ed8u", "post_id": "d38qod", "comment": "You never know, that could still be his daughter.\n\nHard living does that to you."}, {"comment_id": "f00m7wt", "post_id": "d38qod", "comment": "> Hate to be THAT commenter, but I believe that the original a father/daughter representation that is often misunderstood as husband/wife - as aspect lost here\n\nHow is it lost here? The painting makes no indication of what their relationship is. Just like the original American Gothic."}, {"comment_id": "f00irqc", "post_id": "d38qod", "comment": "also, the name American Gothic comes from the window on the background, and not the look of the couple"}, {"comment_id": "f00gcha", "post_id": "d38qod", "comment": "To add - the title \"American Gothic\" referred to the farmhouse (specifically the window), not the people.\n\nAn appropriate painting that would keep the theme would probably show the same house but the original couple relaxing near the house while in the foreground immigrants were working the farm."}, {"comment_id": "f017krj", "post_id": "d38qod", "comment": "I get what you’re saying but I feel like the message here is about the work they put in to build a better life for their families, so while the father/daughter working family theme is lost with this one, the theme of immigrants working for their future generations/children is represented."}, {"comment_id": "f01cqk3", "post_id": "d38qod", "comment": "That's a good point, but lets not make the same mistake here - There's no indication as to whether he is her son or husband or anything other than some sort of relationship"}, {"comment_id": "f00l4wx", "post_id": "d38qod", "comment": "Never thought I'd see a chevy astro in oil. Well done!"}, {"comment_id": "f00gqto", "post_id": "d38qod", "comment": "Love it, clever reinterpretation of classic Americana."}, {"comment_id": "f00tkbl", "post_id": "d38qod", "comment": "I've been saying it for years, there's nothing more American than a Mexican citizen!\n\nEDIT: This was a joke and some of you took it seriously lol"}, {"comment_id": "f00n0yp", "post_id": "d38qod", "comment": "AAAAAAAAAGH I love the painting\n\nbut the bumper/trunk/window lines are offset/crooked\n\nGAAAAAAAAAH"}, {"comment_id": "f00real", "post_id": "d38qod", "comment": "Thanks alot, now I cant unsee it"}, {"comment_id": "f00texs", "post_id": "d38qod", "comment": "What drives me nuts is that the man and woman are off center. There's a bunch of extra space on the womans side to fit the bucket, but the man is basically on the edge of the painting"}, {"comment_id": "f00rb0l", "post_id": "d38qod", "comment": "They aren't.  \n\nThat's just a trick of your brain because the man is taller than the woman in the painting.\n\nEdit: Since this seems to be a popular debate - [*Mostly* consistent](https://i.imgur.com/wIzHQHS.png)"}, {"comment_id": "f01hblk", "post_id": "d38qod", "comment": "Maybe they got into a fender bender"}, {"comment_id": "f00t96k", "post_id": "d38qod", "comment": "Fun fact, the reason why the original picture is called american gothic is because the style of architecture on the house is the back ground is american gothic and I do believe it was his dentist who posed for the picture"}, {"comment_id": "f010lep", "post_id": "d38qod", "comment": "This is a super powerful image."}, {"comment_id": "f00ytg6", "post_id": "d38qod", "comment": "I actually fucking love this. It's just perfect."}, {"comment_id": "f0354dn", "post_id": "d38qod", "comment": "For someone reason this piece is really speaking to me hitting home 😪honestly"}, {"comment_id": "f03faiv", "post_id": "d38qod", "comment": "Amazing!!! This speaks to me"}, {"comment_id": "f00m00o", "post_id": "d38qod", "comment": "The dusty Astro van is an absolutely inspired choice. Lots of really good details in this piece. You can tell some thought went into it. I love it."}, {"comment_id": "f00xce5", "post_id": "d38qod", "comment": "The dude looks like my brother in law"}, {"comment_id": "f03baw2", "post_id": "d38qod", "comment": "Amazing! Hats off to the artist and every immigrant chasing their American dream! The hard working individual should always be celebrated."}, {"comment_id": "f03ensv", "post_id": "d38qod", "comment": "This is great but am I the only one seeing that the bumper and the names on the car aren’t level."}, {"comment_id": "f00rjqc", "post_id": "d38qod", "comment": "A man with his wife and a hoe."}, {"comment_id": "f00p3ry", "post_id": "d38qod", "comment": "Question: why does the original painting include the word 'gothic'? What is the meaning of the term in that context? I never understood the title."}, {"comment_id": "f00ufdi", "post_id": "d38qod", "comment": "The house they are in front of was built in the American version of the Gothic architectural style, called \"American Gothic\". The artist, Grant Wood, was really into the house and it was what drew him to make this painting. The house was somewhere in Iowa and I think it still stands today."}, {"comment_id": "f00ulmd", "post_id": "d38qod", "comment": "Nobody is noticing the van being wide enough to sit 4-5 people across?"}, {"comment_id": "f019f2t", "post_id": "d38qod", "comment": "Every racist commenter in here posts in the_dipshit \n\nWhy am I not surprised"}, {"comment_id": "f01aq4c", "post_id": "d38qod", "comment": "\"don't sort by controversial\"\n\"don't sort by controversial\"\n\"don't sort by controversial\"\n\"don't sort by controversial\"\n\"what the fuck sorts by controversial\"\n\"proceeds to lose faith in humanity\"\n\n\nRinse and repeat"}, {"comment_id": "f01ikzf", "post_id": "d38qod", "comment": "I've been finding some racist mexicans that don't like mexicans being portrayed by these darker looking mexicans lmao, racist whites of a different kind"}, {"comment_id": "f00due7", "post_id": "d38qod", "comment": "Oh wow! I can’t express how much I love this!"}, {"comment_id": "f00hekg", "post_id": "d38qod", "comment": "Same! Superb idea even better execution!!"}, {"comment_id": "f00jhvo", "post_id": "d38qod", "comment": "Love this. A reminder that even in our fancy digitized world, we rely on hard, manual labor."}, {"comment_id": "f00im9g", "post_id": "d38qod", "comment": "Really cool idea! I like it, also really well done."}, {"comment_id": "f00o1va", "post_id": "d38qod", "comment": "Hey look, a panting based on actual people."}, {"comment_id": "f00q9es", "post_id": "d38qod", "comment": "I love this so much. I really can't relate personally but something about this just feels right."}, {"comment_id": "f00qxji", "post_id": "d38qod", "comment": "that's actually pretty good perspective of the modern physical toil of our labor force"}, {"comment_id": "f00t27r", "post_id": "d38qod", "comment": "hot damn this is beautiful"}, {"comment_id": "f00y6sj", "post_id": "d38qod", "comment": "I like art that makes you feels."}, {"comment_id": "f00ek4l", "post_id": "d38qod", "comment": "Well painted, I love it. I will some day get a portrait like that of my family."}, {"comment_id": "f010v9y", "post_id": "d38qod", "comment": "Immigrants are literally the backbone of our physical labor workforce. I’ve never seen such hard workers as them."}, {"comment_id": "f00kuf5", "post_id": "d38qod", "comment": "This hit too close to home. From the equipment to the van."}, {"comment_id": "f00sn10", "post_id": "d38qod", "comment": "This is amazing and also so very boring"}, {"comment_id": "f00s6nc", "post_id": "d38qod", "comment": "I love the detail in the dust drawings in the back window, and the veins on the arms and hands. Ground shadows seem a bit funky to me though"}, {"comment_id": "f00zrlx", "post_id": "d38qod", "comment": "Grossly underpaid Hispanics ."}, {"comment_id": "dvok40a", "post_id": "84cd5k", "comment": "What was even better is that he did get to dance in zero gravity when he was alive."}, {"comment_id": "dvos49x", "post_id": "84cd5k", "comment": "> when he was alive.\n\n...  *goes with trepidation to front page*"}, {"comment_id": "dvolcyj", "post_id": "84cd5k", "comment": "Is there a link or is this a private experience?"}, {"comment_id": "dvpasny", "post_id": "84cd5k", "comment": "Not zero gravity, zero gs.  Zero gravity doesn't/can't exist in the known universe"}, {"comment_id": "dvp95rj", "post_id": "84cd5k", "comment": "Would’ve been cool if he was stepping out of his wheelchair and walking up a spiral staircase. "}, {"comment_id": "dvohc2u", "post_id": "84cd5k", "comment": "[deleted]"}, {"comment_id": "dvoj2yx", "post_id": "84cd5k", "comment": "Painted months ago. OP killed SH. "}, {"comment_id": "dvol3vg", "post_id": "84cd5k", "comment": "Original was probably just a guy floating and just added glasses and a wheelchair"}, {"comment_id": "dvok8ol", "post_id": "84cd5k", "comment": "I'm a little skeptical myself but it is digital not a painting "}, {"comment_id": "dvol5qv", "post_id": "84cd5k", "comment": "They may have only titled it that given recent events."}, {"comment_id": "dvonnhp", "post_id": "84cd5k", "comment": "[deleted]"}, {"comment_id": "dvopcuu", "post_id": "84cd5k", "comment": "Yea were just whoring out his death now.."}, {"comment_id": "dvomdfc", "post_id": "84cd5k", "comment": "Just needed to add the wheel chair and glasses. "}, {"comment_id": "dvom3od", "post_id": "84cd5k", "comment": "He just added the wheelchair :v"}, {"comment_id": "dvonn0n", "post_id": "84cd5k", "comment": "Probably the background was pre-painted"}, {"comment_id": "dvou7t4", "post_id": "84cd5k", "comment": "why would it take a long time to paint this? it looks like it took 5 minutes"}, {"comment_id": "dvp0vhu", "post_id": "84cd5k", "comment": ">You painted that really fast\n\nYou can tell that without knowing about Hawking's death."}, {"comment_id": "dvolbug", "post_id": "84cd5k", "comment": "All he had to do was add a wheelchair"}, {"comment_id": "dvomi8p", "post_id": "84cd5k", "comment": "Excited to see the profound thoughts and insights and walked away with \"you painted that really fast\" "}, {"comment_id": "dvonkn2", "post_id": "84cd5k", "comment": "Indeed took him a few hours for this."}, {"comment_id": "dvooh0f", "post_id": "84cd5k", "comment": "Is this a proof for time travel. "}, {"comment_id": "dvopgeu", "post_id": "84cd5k", "comment": "When you're desperate for karma and attention..."}, {"comment_id": "dvopojc", "post_id": "84cd5k", "comment": "It’s the strong solar storm today that is taking him onward"}, {"comment_id": "dvoqxfv", "post_id": "84cd5k", "comment": "Artist's Twitter : https://twitter.com/ramaoughly"}, {"comment_id": "dvoz1ht", "post_id": "84cd5k", "comment": "I mean, it's not anything that requires a particularly high degree of skill. Easily achievable in less than 2 hours if you have any experience at all with digital art"}, {"comment_id": "dvok1yl", "post_id": "84cd5k", "comment": "Seen by the quality of the art. I'm sorry but it's just bad."}, {"comment_id": "dvolxil", "post_id": "84cd5k", "comment": "can we get the Pi symbol incorporated in this drawing? since he died on 3.14 aka Pi day"}, {"comment_id": "dvonohq", "post_id": "84cd5k", "comment": "[deleted]"}, {"comment_id": "dvohhr8", "post_id": "84cd5k", "comment": "yeah, it's pretty obvious that OP just wanted some easy upvotes... \nCould've at least put some effort into it, show some respect for the Late Prof. Hawking. But hey, that's none of my business, I guess!"}, {"comment_id": "dvokiau", "post_id": "84cd5k", "comment": "From space dust we come, to space dust we go. This is such a beautiful tribute, and here's hoping that he teams up with Carl Sagan, Nikola Tesla, Albert Einstein and Isaac Newton to go beat up Thomas Edison.\n\nEdit: HOLY FUCK THANKS FOR THE GOLD WHOEVER YOU ARE"}, {"comment_id": "dvon8en", "post_id": "84cd5k", "comment": "That was unexpected."}, {"comment_id": "dvonmuk", "post_id": "84cd5k", "comment": "isn't Edison rotting in hell?\n"}, {"comment_id": "dvoxf14", "post_id": "84cd5k", "comment": "Both Hawking and Sagan would be exceptionally disappointed with the 2nd law of thermodynamics if they were still experiencing anything right now."}, {"comment_id": "dvorvkw", "post_id": "84cd5k", "comment": "Based on his beliefs he won't be teaming up with anything but coffin worms. "}, {"comment_id": "dvos2b3", "post_id": "84cd5k", "comment": "He actually doesn't believe in any kind of afterlife."}, {"comment_id": "dvoogbg", "post_id": "84cd5k", "comment": "r/unexpected"}, {"comment_id": "dvorfdd", "post_id": "84cd5k", "comment": "I'm sure dead Edison is dead again already"}, {"comment_id": "dvpn2sd", "post_id": "84cd5k", "comment": "Well he didn't believe in any sort of afterlife. He called it a fairy tale. So he is just dead. He will not be meeting up with anyone else anywhere else to beat up anyone."}, {"comment_id": "dvoq0s2", "post_id": "84cd5k", "comment": "That's the best tribute I've read today!"}, {"comment_id": "dvop65t", "post_id": "84cd5k", "comment": "Beautiful."}, {"comment_id": "dvonkzo", "post_id": "84cd5k", "comment": "Atheist, atheist, probably an atheist, self described agnostic (but mostly an atheist), religious (but probably because of his time), and atheist... Don't think any of them will be beating up anyone. "}, {"comment_id": "dvordou", "post_id": "84cd5k", "comment": "Why do we always need a villain?\nhttps://www.reddit.com/r/changemyview/comments/7blk7l/cmv_thomas_edison_while_not_perfect_was_a/"}, {"comment_id": "dvokab3", "post_id": "84cd5k", "comment": "Really? This is how I find out that Dr. Hawking died?...damn"}, {"comment_id": "dvoomxv", "post_id": "84cd5k", "comment": "I found out in r/imgoingtohellforthis where they played the windows closing chime as his last words"}, {"comment_id": "dvp3axk", "post_id": "84cd5k", "comment": "I found out from a Simpsons shitposting meme on Facebook..."}, {"comment_id": "dvoid8m", "post_id": "84cd5k", "comment": "Floating up from the bottom of a lake or alien abduction? You decide\n\nEdit: had not heard the news. First post I see today. RIP. "}, {"comment_id": "dvok0gz", "post_id": "84cd5k", "comment": "Haha this is great"}, {"comment_id": "dvon4ep", "post_id": "84cd5k", "comment": "im surprised there arent many posts either. saw in a tweet screengrab.\n\nreally sad stuff. someone so brilliant that can still write books that even i can sort of comprehend. \n\nreddit loves the fake scientists like bill and neil. no respect for the best i guess."}, {"comment_id": "dvofkdn", "post_id": "84cd5k", "comment": "Fly high Hawking...fly high"}, {"comment_id": "dvojb71", "post_id": "84cd5k", "comment": "Gonna cry"}, {"comment_id": "dvoj306", "post_id": "84cd5k", "comment": "Fly high like a Superman !!"}, {"comment_id": "dvoon5i", "post_id": "84cd5k", "comment": "CLIFFRACER FLY SOOOO HIGHHHH"}, {"comment_id": "dvoh4se", "post_id": "84cd5k", "comment": "That's really beautiful, i love how this man has captured the hearts of so many people, you just have to look at /r/all/ today"}, {"comment_id": "dvokcs3", "post_id": "84cd5k", "comment": "The Japanese say there are 3 kinds of death.\n1. When your body dies.\n2. When your body is cremated. \n3. When your name is taken for the last time by anyone.\n\nI think Stephen Hawking will not truly face the 3rd death for a long, long time to come. "}, {"comment_id": "dvogyqi", "post_id": "84cd5k", "comment": "This is really, really lovely."}, {"comment_id": "dvokp2k", "post_id": "84cd5k", "comment": "I think you're really, really lovely ;)"}, {"comment_id": "dvokxz2", "post_id": "84cd5k", "comment": "It's kinda tacky..."}, {"comment_id": "dvolvjd", "post_id": "84cd5k", "comment": "One with the universe."}, {"comment_id": "dvojge7", "post_id": "84cd5k", "comment": "There’s a Starman waiting the sky."}, {"comment_id": "dvokeqh", "post_id": "84cd5k", "comment": "[deleted]"}, {"comment_id": "dvor89w", "post_id": "84cd5k", "comment": "He died sometimes before the SpaceX launch, and they put his body inside the Starman space suit."}, {"comment_id": "dvplawh", "post_id": "84cd5k", "comment": "oh god dont remind me about bowie"}, {"comment_id": "dvojjuh", "post_id": "84cd5k", "comment": "Godspeed Mr. Hawking. The Earth is a better place for you having been here and this picture encapsulates the feelings of a whole world that hopes you have gone on to a better place."}, {"comment_id": "dvos6i7", "post_id": "84cd5k", "comment": "Unfortunately he didn't believe in any kind of afterlife. He thinks you just cease to exist. I hope he's wrong."}, {"comment_id": "dvokox8", "post_id": "84cd5k", "comment": "These kind of comments are shitting all over this man's legacy. The reason he is so important to me is because he was the one who finally freed me from the chains of religion and gave me REAL answers. He opened my mind completely and ignited my passion for learning through \"Stephen Hawking's Grand Design - Did God Create the Universe?\" It totally changed me as a person and I've grown and learned so much more in the 6 years since than I did in the entire 18 before. Before that point I lived in constant fear of hell because I couldn't make myself believe in the indoctrination I was subjected to even from as young as 4. I was denied proper science education in school, and because of that I didn't have the answers I needed for everything to add up and to let delusion go.  He gave me those answers and set me free and he's done the same for so many others and I think that is his greatest gift to the world. "}, {"comment_id": "dvojfgg", "post_id": "84cd5k", "comment": "You have no idea how high I can fly.  "}, {"comment_id": "dvolkt5", "post_id": "84cd5k", "comment": "Man, I love a good quitting story."}, {"comment_id": "dvoi5a6", "post_id": "84cd5k", "comment": "Stephen Hawking was my 9 year old nephews hero. Seriously. This kid idolized him and spoke nothing but him everyday at school to his teachers and friends. Anyways, my sister texted me me a bit ago after she broke the news to him and she said it went like this: \n“I went and told Chandler. He sat there and had a soft smile. Some tears came out and and he gave me a big hug. He said, he doesn't need the wheelchair anymore. And wiped his tears .”\n\nThis image is perfect for my nephew and will be sending it to him when he wakes up."}, {"comment_id": "dvoj72b", "post_id": "84cd5k", "comment": "I'm not crying...just so many damn onions being chopped in here...that's all. *sniff*"}, {"comment_id": "dvok5mi", "post_id": "84cd5k", "comment": "and then Albert Einstein knocked on the door and gave him 100 dollars."}, {"comment_id": "dvokgqg", "post_id": "84cd5k", "comment": "r/wokekids"}, {"comment_id": "dvokr4r", "post_id": "84cd5k", "comment": "Hello Dear, I'm Rama the Illustrator of this and it would be an honor if this helped him <3 sending you guys lots of love "}, {"comment_id": "dvojywv", "post_id": "84cd5k", "comment": "Lmao yeah okay /r/thathappened "}, {"comment_id": "dvokdun", "post_id": "84cd5k", "comment": "[removed]"}, {"comment_id": "dvok0v4", "post_id": "84cd5k", "comment": "[removed]"}, {"comment_id": "dvokb6r", "post_id": "84cd5k", "comment": "[removed]"}, {"comment_id": "dvon5ap", "post_id": "84cd5k", "comment": "If you can get the artists permission, you could even make this into a poster for your nephew's bedroom. Im sure he'd love it"}, {"comment_id": "dvokzu4", "post_id": "84cd5k", "comment": "Why is this such a hard story to believe? There’s really no extraordinary claims, no Go Fund Me being set up, no gain what so ever. \n\nI didn’t cry but i smiled and had this thought quietly to myself. Is it so hard to believe that innocent stories just might be true? "}, {"comment_id": "dvow751", "post_id": "84cd5k", "comment": "Great. Now everyone in my works cafeteria thinks I'm crazy.. . Stupid onions..."}, {"comment_id": "dvopltc", "post_id": "84cd5k", "comment": "Could this BE any faker?"}, {"comment_id": "dvoljne", "post_id": "84cd5k", "comment": ":') "}, {"comment_id": "dvop3e1", "post_id": "84cd5k", "comment": "oh for fuck's sake"}, {"comment_id": "dvoltwn", "post_id": "84cd5k", "comment": "Anyone else wonder what his actual voice sounds like? Would be cool in the afterlife to hear him say something. "}, {"comment_id": "dvokraw", "post_id": "84cd5k", "comment": "Wow that's fucking beautiful. That kid's going places, make sure he doesn't forget. "}, {"comment_id": "dvoo6tr", "post_id": "84cd5k", "comment": "lol that's bullshit. Sounds like a scene from a corny movie"}, {"comment_id": "dvoqibt", "post_id": "84cd5k", "comment": "Lol shut the fuck up liar"}, {"comment_id": "dvoofd1", "post_id": "84cd5k", "comment": "that kid's name? Albert Einstein"}, {"comment_id": "dvos120", "post_id": "84cd5k", "comment": "r/thathappened"}, {"comment_id": "dvovkwc", "post_id": "84cd5k", "comment": "What is this facebook bs"}, {"comment_id": "dvpmbj3", "post_id": "84cd5k", "comment": "Well yeah. He's dead."}, {"comment_id": "dvom1fm", "post_id": "84cd5k", "comment": "Yup. Here come the tears"}, {"comment_id": "dvom5bk", "post_id": "84cd5k", "comment": "Then the kid went on and solved the equations that would unlock time travel, didn't he?"}, {"comment_id": "dvomvgt", "post_id": "84cd5k", "comment": "I got fucking chills"}, {"comment_id": "dvok94t", "post_id": "84cd5k", "comment": "[removed]"}, {"comment_id": "dvoko11", "post_id": "84cd5k", "comment": "thank you for your beautiful painting, and welcome to reddit! "}, {"comment_id": "dvol0fs", "post_id": "84cd5k", "comment": "Great painting! but I suggest adding any kind of proof you have with your comment so you could be given attention. Otherwise people will be skeptical. "}, {"comment_id": "dvokud8", "post_id": "84cd5k", "comment": "I doubt it. Verification?"}, {"comment_id": "dvorl7w", "post_id": "84cd5k", "comment": "Is this not seen as poor taste?..."}, {"comment_id": "dvolfma", "post_id": "84cd5k", "comment": "As an atheist, I’m a shamed to be associated with a lot of these commenters.  \n\nIf this is how the artist wishes to show their respect and appreciation of Mr. Hawking, then I have no problem with it.  \n\nStephen Hawking did not believe in a God, yes, but he certainly did not believe in being an asshole."}, {"comment_id": "dvoq89b", "post_id": "84cd5k", "comment": "Spot on.  Plus as another commenter said this could easily represent him rising above his physical state on earth to accomplish so much.  People need to chill on this one."}, {"comment_id": "dvpewzq", "post_id": "84cd5k", "comment": "I mainly wanted to say that he's going to space .. the place he loved the most but people got it wrong i guess. and thank you for being awesome! "}, {"comment_id": "dvpbcbw", "post_id": "84cd5k", "comment": "I recently saw a video of him answering a teenage girl's question about Zayn leaving One Direction. Any lesser man would've openly mocked the girl for asking a \"frivolous\" question or acted like she was dumb, but Hawking validated the question and provided a very rewarding answer (the question was related to science too)."}, {"comment_id": "dvphczc", "post_id": "84cd5k", "comment": "per Richard Dawkins (referring to Hitchins, but i think the sentiment fits here just as well): \n\n“This intrepid warrior for truth, this cultured, courteous citizen of the world, this devastating, coruscating enemy of lies and cant – well, maybe he has no immortal soul – none of us has. And in the only sense of the word that makes any sense, [his soul] is among the immortals.”"}, {"comment_id": "dvokctn", "post_id": "84cd5k", "comment": "Man I feel really sad without really knowing him but just reading about him."}, {"comment_id": "dvok3js", "post_id": "84cd5k", "comment": "Honestly not trying to troll...but I don't think Mr. Hawking believed in anything that would involve him ascending to anywhere. Still a nice picture and sentiment though. "}, {"comment_id": "dvoklgt", "post_id": "84cd5k", "comment": "i kinda saw it as a metaphorical visualization of Hawkings intellectual pursuits elevating him high above his limited physical body."}, {"comment_id": "dvopkt6", "post_id": "84cd5k", "comment": "Athiests return to being stardust. That's how I took this image at least.\n\nEdit: spelling"}, {"comment_id": "dvoksfe", "post_id": "84cd5k", "comment": "Yes, but funerals are for the living. So are tributes like this. "}, {"comment_id": "dvoojj0", "post_id": "84cd5k", "comment": ">\tAn expanding universe does not preclude a creator, but it does place limits on when he might have carried out his job.\n\n— Stephen Hawking, *A Brief History of Time*\n\nNot to say that he does or doesn’t believe, but I found it relevant and humbling how he avoids prejudice or absolutes. A true scientist."}, {"comment_id": "dvooadm", "post_id": "84cd5k", "comment": "Religious or not, we all have dabblings with existential questions and a poetic image like this sums this relationship up perfectly. That's what's great with art, music, architecture - they can be both religious and poetic and both religious people and secular can understand and appreciate something. A level where both can meet and share the same experience. "}, {"comment_id": "dvp6fu9", "post_id": "84cd5k", "comment": ">  I don't think Mr. Hawking believed in anything that would involve him ascending to anywhere  \n  \nScience can't prove if there's any form of afterlife or not, but if there is, I don't see whether or not you believe in one being a factor relevant to its existence.\n\n"}, {"comment_id": "dvoqbv8", "post_id": "84cd5k", "comment": "I'm as atheist as it comes, that doesn't mean I don't wish there was a heaven."}, {"comment_id": "dvovssl", "post_id": "84cd5k", "comment": "I'm an atheist myself and I think the paint goes way beyond a religious transcendental meaning, but rather a tribute to how a man trapped in a wheelchair with a horrifying disease, in his own way, reached the stars. Through his calculus, research and with his mind and feelings. "}, {"comment_id": "dvpezqv", "post_id": "84cd5k", "comment": "thank you .. It's just to say that he will always be among stars "}, {"comment_id": "dvom8ob", "post_id": "84cd5k", "comment": "I thought of this too, but if someone really believes they're not going to Disney World and someone still takes them, they still went. I do have to wonder if he'd be annoyed by people hoping his existence goes on but I'd like to think he'd at least enjoy the sentiment after being hounded by protestant evangelicals."}, {"comment_id": "dvojn5k", "post_id": "84cd5k", "comment": "That's gorgeous bro.  Brilliant color pallet :D"}, {"comment_id": "dvok0uz", "post_id": "84cd5k", "comment": "all this is , is a painting of a disabled person that was just recently renamed \"stephen Hawking\".. just look at the wheel chair"}, {"comment_id": "dvpf26t", "post_id": "84cd5k", "comment": "Thank you Dude"}, {"comment_id": "dvolrw2", "post_id": "84cd5k", "comment": "This isn't Stephen Hawking. Look at the wheelchair, the glasses, the hair, the body in general. Even though it's only a silhouette you can still tell it looks nothing like him. This pretty clearly just a painting of a disabled person escaping their wheelchair, which is fine but trying to play it off as Stephen hawking for karma right after he dies is pretty shitty"}, {"comment_id": "dvpu8j3", "post_id": "84cd5k", "comment": "THANK YOU. I thought I was the only one who noticed this, had to scroll way too far for this. Fuckin’ gross-ass karma-grabbin-death-profiting-off-of-fools"}, {"comment_id": "dvoo172", "post_id": "84cd5k", "comment": "I saw somebody on Twitter who got mad at a piece of art like this because they said that depicting the dead Hawking as able to walk was ableist."}, {"comment_id": "dvpjtg3", "post_id": "84cd5k", "comment": "I’m in a wheelchair and I do find this to be ableist. Sure, its a well done piece of art. However, I don’t need to be out of me wheelchair to be considered a person. Meh, maybe I’m reading to much in to it. Just my opinion."}, {"comment_id": "dvovace", "post_id": "84cd5k", "comment": "They are no alone. It is fucking ableist.\n\nIt's this notion that people are \"wheelchair bound\" which so many obits/articles are using. Instead of thinking about what his life would have been like /without/ his wheelchair. His wheelchair was what freed him, it wasn't what tied him down."}, {"comment_id": "dvomwou", "post_id": "84cd5k", "comment": "Ah yes, because Stephen Hawking was well known for his long flowing hair, thick-rimmed glasses, and manually powered wheelchair. "}, {"comment_id": "dvokqzk", "post_id": "84cd5k", "comment": "Thank you Stephen Hawking for not only teaching us about the universe but for being an inspiration to all of us."}, {"comment_id": "dvokdsw", "post_id": "84cd5k", "comment": "Meanwhile, /r/Art reaches new lows"}, {"comment_id": "dvon784", "post_id": "84cd5k", "comment": "OMG is that how he died? Someone pushed him into a tacky magenta lake that looks like a shitty watercolour where he eventually drowned in mediocrity? Who would do such a thing?"}, {"comment_id": "dvol23m", "post_id": "84cd5k", "comment": "Except he didn't use that kinda chair eh? A cynical mind might suggest that a semi relevant image has been used for some karma whoring?"}, {"comment_id": "dvouziu", "post_id": "84cd5k", "comment": "It's also a totally ableist notion about \"now he's free!\", even though his wheelchair was what freed him to live his life the way he did for so long."}, {"comment_id": "dvokvmk", "post_id": "84cd5k", "comment": "Thank you for this. It's beautiful in every way"}, {"comment_id": "dvorwyc", "post_id": "84cd5k", "comment": "I think this is disrespectful based on his beliefs."}, {"comment_id": "dwt9am6", "post_id": "84cd5k", "comment": "ugly *and* cliche, and the top all-time post in /r/art. Looks like it was painted in facebook's graffiti app."}, {"comment_id": "dvonk21", "post_id": "84cd5k", "comment": "That signature is placed grotesquely. "}, {"comment_id": "dvol4ck", "post_id": "84cd5k", "comment": "Honestly this seems kinda disrespectful to his views but he's dead so he can't really object to it anymore. "}, {"comment_id": "dvooywf", "post_id": "84cd5k", "comment": "it doesnt even have to be about his death, his life was about transcending his reality and illuminating ours, which the picture also conveys. do you even art?"}, {"comment_id": "dvol287", "post_id": "84cd5k", "comment": "Nice to see people aren't missing the opportunity to profit from this man's death..."}, {"comment_id": "dvoo2bl", "post_id": "84cd5k", "comment": "Gotta get that karma!"}, {"comment_id": "dvokxa1", "post_id": "84cd5k", "comment": "I find it ironic. To be consistent with his materialist beliefs you should have painted his dead carcass decaying into bacteria fodder. "}, {"comment_id": "dvos72t", "post_id": "84cd5k", "comment": "[deleted]"}, {"comment_id": "dvp5ehr", "post_id": "84cd5k", "comment": "OP isn't even the artist. "}, {"comment_id": "dvpeds5", "post_id": "84cd5k", "comment": "Yup... as someone who makes art for a living the fact that this is getting insane amounts of public recognition and is extremely amateur/sub-par skill wise....really gets to me. I know it shouldn't, but I'm human and it's unbelievably irritating that this joke of a piece gets this much recognition with thousands of INCREDIBLY more skilled artists getting next to nothing for countless hours of skill-grinding.\n\nThat mixed with the timing of it all and the obvious attempts at karma-whoring pouring out of plenty of artists...and the fact that this isn't even hawking and that it was made prior to his death (do you have a source on that? Reverse image search isn't turning up much for me).\n\nEvery bit of all this is sickening for someone like me."}, {"comment_id": "dvot67s", "post_id": "84cd5k", "comment": "Upvote for that my bro. "}, {"comment_id": "dvojxbw", "post_id": "84cd5k", "comment": "Not even well done but better cash in on that dead karma! "}, {"comment_id": "dvoq5v1", "post_id": "84cd5k", "comment": "Am I the only one who doesn't like this "}, {"comment_id": "dvono1x", "post_id": "84cd5k", "comment": "Trying to get free internet points over someone's death... good job OP"}, {"comment_id": "dvol4sh", "post_id": "84cd5k", "comment": "I really hope he wanted his ashes sent into space like Sagan. "}, {"comment_id": "dvokzpl", "post_id": "84cd5k", "comment": "He appears to have been an atheist. I doubt he would approve of the implication that his death freed him. He fought very hard to stay alive and keep contributing at a very high level.\n\nI'll eat the downvotes on this. I think it's in poor taste and I don't like it."}, {"comment_id": "dvoslmq", "post_id": "84cd5k", "comment": "He was definitely an athiest.\n\n\"I regard the brain as a computer which will stop working when its components fail. There is no heaven or afterlife for broken down computers; that is a fairy story for people afraid of the dark.\" \n\n\"I believe the simplest explanation is, there is no God. [...] We have this one life to appreciate the grand design of the universe and for that, I am extremely grateful.\"\n\nStephen Hawking"}, {"comment_id": "dvomcw7", "post_id": "84cd5k", "comment": "I agree, I'm seeing so much of this kind of stuff it seems baffling to me"}, {"comment_id": "dvok9xb", "post_id": "84cd5k", "comment": "[deleted]"}, {"comment_id": "dvokmsj", "post_id": "84cd5k", "comment": "Pretty much the only thing you can do on the internet to avoid getting your art stolen. I really don't see what the big deal is."}, {"comment_id": "dvooid2", "post_id": "84cd5k", "comment": "Feel like it's kinda taking advantage of Hawkings passing if you ask me, easy way to get karma"}, {"comment_id": "dvokise", "post_id": "84cd5k", "comment": "I thought he was a profound atheist though?"}, {"comment_id": "dvomiwx", "post_id": "84cd5k", "comment": "Yea, that's what I was thinking. It would be more of an appropriate picture, having worms eating his dead flesh. "}, {"comment_id": "dvokmxz", "post_id": "84cd5k", "comment": "Good thing there wasn’t a stairway to heaven"}, {"comment_id": "dvomnsk", "post_id": "84cd5k", "comment": "Can't help but think this evokes \"The Great Gig in the Sky\" by Pink Floyd"}, {"comment_id": "dvon6u2", "post_id": "84cd5k", "comment": "Such a coincidence that it's also PI day."}, {"comment_id": "dvoqg8d", "post_id": "84cd5k", "comment": "I thought he was a profound atheist though?\n\n"}, {"comment_id": "dvphxml", "post_id": "84cd5k", "comment": "\"I regard the brain as a computer which will stop working when its components fail. There is no heaven or afterlife for broken down computers; that is a fairy story for people afraid of the dark.\" -Steven Hawking"}, {"comment_id": "dvq77w3", "post_id": "84cd5k", "comment": "Doesn't feel like Hawking to me. For one, as someone who didn't believe in an afterlife it's kind of out of place, and for another he didn't have a normal wheelchair. The wheelchair is important because he grew very connected to it. By now we've had much more sophisticated speech synthesis, for instance, but the heavily electronic speech had become his voice and he wasn't willing to part with it. That brings me to my final observation which is that his chair wasn't a burden tying him down- it was an extension of his self which allowed him to express his mind and explore the world. What you've painted makes it seem like the chair was his burden. If there's one message that he'd want to share with other disabled people I'd imagine that it would be that the chair is not a burden at all."}, {"comment_id": "dvojtqr", "post_id": "84cd5k", "comment": "leave it to humanity Stephen, to do shity art for publicity hours after your death, rip.\n"}, {"comment_id": "dvoqnm5", "post_id": "84cd5k", "comment": "How else is OP going to rack in that sweet delicious karma?"}, {"comment_id": "dvpc5pe", "post_id": "84cd5k", "comment": "> to do shity art for publicity hours after your death\n\nRight? We get legendary work posted here that *sometimes* gets proper recognition. 9 hours in and an extremely amateur painting is at 80k with 3 gold. It has nothing to do with the art... ironic given the sub we're in."}, {"comment_id": "dvomlgz", "post_id": "84cd5k", "comment": "He was an atheist, not believing in anything beyond dead\n\nStill very nice"}, {"comment_id": "dvoi4i2", "post_id": "84cd5k", "comment": "[removed]"}, {"comment_id": "dvomfq8", "post_id": "84cd5k", "comment": "I've seen this image before.  I don't believe it was created after Hawking's death, or even in 2018.  "}, {"comment_id": "dvoiblo", "post_id": "84cd5k", "comment": "you're going to be very mad looking at reddit then, most people are interested in attention. "}, {"comment_id": "dvoiocm", "post_id": "84cd5k", "comment": "Maybe the OP was deeply affected by his passing and painted this as a response?  Maybe they're creating something beautiful out of a sad event as opposed to adding nothing of any value to the world with a post like yours?"}, {"comment_id": "dvoj3lk", "post_id": "84cd5k", "comment": "[deleted]"}, {"comment_id": "dvokfj6", "post_id": "84cd5k", "comment": "That’s absolutely beautiful."}, {"comment_id": "ew57huw", "post_id": "cmw9ek", "comment": "I love that the Roman numerals on the clock don't make sense because you're at that point where time all starts to blur into one big exhausting blob"}, {"comment_id": "ew5c65o", "post_id": "cmw9ek", "comment": "*looks at clock*  \nYep, that's time."}, {"comment_id": "ew5do4i", "post_id": "cmw9ek", "comment": "I love that you pointed this out. Reminds me of one of my favorite songs of recent.\n\n[MY MOTHER WORKED 15 HOURS 5 DAYS A WEEK](https://youtu.be/BuQG6_evFc8?t=41)\n\n[MY MOTHER WORKED 16 HOURS 6 DAYS A WEEK](https://youtu.be/BuQG6_evFc8?t=41)\n\n[MY MOTHER WORKED 17 HOURS 7 DAYS A WEEK](https://youtu.be/BuQG6_evFc8?t=41)\n\n[Live performance of the song at Glastonbury](https://youtu.be/ZzwXZD1ejGw?t=880) that gives you a feel for what this band stands for."}, {"comment_id": "ew5mquv", "post_id": "cmw9ek", "comment": "Nice, I didn't even notice that"}, {"comment_id": "ew5akoc", "post_id": "cmw9ek", "comment": "Makes me wonder if it's meant to be a dream as they say writing and symbols that are usually recognized and expected are never so in dreams. Can validate, actually dreamed about polishing my resume the other day after I worked on it for an afternoon and evening, the resume mentioned things I haven't the ability to do, at least this was my interpretation of what I was reading in the dream, and then once I realized no ones physical been to mars and back, especially doing farming on mars- that something was wrong and a moment later my eyes and brain were wide awake."}, {"comment_id": "ew5plmp", "post_id": "cmw9ek", "comment": "And..  we know what daydrinking looks like"}, {"comment_id": "ew53f1w", "post_id": "cmw9ek", "comment": "Great technique of blending the breezy and slick 1950's advertising feel with a purely modern and up to date theme. Well done!"}, {"comment_id": "ew53nc9", "post_id": "cmw9ek", "comment": "Thanks a lot! That's exactly the feel I was going for, almost a parody"}, {"comment_id": "ew5jqmt", "post_id": "cmw9ek", "comment": "I love the To-Do list with only one thing crossed off"}, {"comment_id": "ew5maq1", "post_id": "cmw9ek", "comment": "Would love to see you use this style as a commentary on other modern things...people on cell phones, Amazon deliveries, etc."}, {"comment_id": "ew5af0c", "post_id": "cmw9ek", "comment": "The only thing missing is a little phone within arms reach"}, {"comment_id": "ew5eg68", "post_id": "cmw9ek", "comment": "I think a lot of new parents are going to love this. Please keep up your great work and share it with us."}, {"comment_id": "ew6lv6z", "post_id": "cmw9ek", "comment": "Baby want more Chardonnay!"}, {"comment_id": "ew5t8ts", "post_id": "cmw9ek", "comment": "How is mothers being overworked a purely modern theme?"}, {"comment_id": "ew5swgk", "post_id": "cmw9ek", "comment": "Awesome picture but since when is drinking when breast feeding modern?"}, {"comment_id": "ew5thm0", "post_id": "cmw9ek", "comment": "Nothing is done. 🤦🏻‍♂️"}, {"comment_id": "ew6wnq7", "post_id": "cmw9ek", "comment": "This is originally timeless creation of art"}, {"comment_id": "ew5rk7i", "post_id": "cmw9ek", "comment": "Yes. The way she's freeing the nipple but still stuck in the kitchen is a testament to the small victories women must be satisfied with in 2019. Her idealized body is a reminder that women must still adhere to a certain look in order to be acceptable to the people who yearn for the 1950s all over again."}, {"comment_id": "ew5j7nm", "post_id": "cmw9ek", "comment": "Except most modern moms don’t get to stay at home."}, {"comment_id": "ew62jhv", "post_id": "cmw9ek", "comment": "What makes it modern?"}, {"comment_id": "ew5hbnz", "post_id": "cmw9ek", "comment": "How is it modern? What am I missing? Maybe the leggings and the blonde highlights? It looks like the house is 1950s."}, {"comment_id": "ew5gfb6", "post_id": "cmw9ek", "comment": "Agreed! So creative and well thought out."}, {"comment_id": "ew5qjld", "post_id": "cmw9ek", "comment": ">with a purely modern and up to date theme\n\nwhat is the up to date theme?"}, {"comment_id": "ew5hskw", "post_id": "cmw9ek", "comment": "How is this a “purely modern” theme?"}, {"comment_id": "ew5hvdm", "post_id": "cmw9ek", "comment": "What's modern? The yoga pants?"}, {"comment_id": "ew54rru", "post_id": "cmw9ek", "comment": "Beer before liquor never been sicker.\nLiquor before beer you’re in the clear.\nWine before noon use a cup"}, {"comment_id": "ew5c43q", "post_id": "cmw9ek", "comment": "[deleted]"}, {"comment_id": "ew5aqqf", "post_id": "cmw9ek", "comment": "Just mix it in with the coffee."}, {"comment_id": "ew5i80b", "post_id": "cmw9ek", "comment": "Liquor before beer, never fear. Don't do heroin."}, {"comment_id": "ew59r2y", "post_id": "cmw9ek", "comment": "And a spoon."}, {"comment_id": "ew5vqdy", "post_id": "cmw9ek", "comment": "A 750ml cup to be exact.."}, {"comment_id": "ew5q3mg", "post_id": "cmw9ek", "comment": "[This is how I learned of that saying. Thanks, Coach McGuirk!](https://youtu.be/NNaSTiFj1Rg)"}, {"comment_id": "ew6424l", "post_id": "cmw9ek", "comment": "Dude, none of the cups are clean.  You know that."}, {"comment_id": "ew56js4", "post_id": "cmw9ek", "comment": "The yoga pants with a couple of holes are a nice touch. 🙂 Very cool.  I like it!"}, {"comment_id": "ew5f5tq", "post_id": "cmw9ek", "comment": "Crap what was removed down there? \n\nI think those are paint marks, like when you brush up against it."}, {"comment_id": "ew5qeas", "post_id": "cmw9ek", "comment": "Something fishy going on with this comment... I've seen it before...."}, {"comment_id": "ew57su8", "post_id": "cmw9ek", "comment": "This 100% looks like the Mom from GLOW."}, {"comment_id": "ew5a6d8", "post_id": "cmw9ek", "comment": "Hah! My gf said the exact some thing when she saw it!"}, {"comment_id": "ew5k0wh", "post_id": "cmw9ek", "comment": "yessss came here for this comment. love this art style though OP really nailed it!!"}, {"comment_id": "ew5l9az", "post_id": "cmw9ek", "comment": "Came here for this. Looks exactly like Betty Gilpin."}, {"comment_id": "ew53jve", "post_id": "cmw9ek", "comment": "I really like your art style"}, {"comment_id": "ew5gvum", "post_id": "cmw9ek", "comment": "I really like *your* style."}, {"comment_id": "ew5b0u1", "post_id": "cmw9ek", "comment": "A buzzy bee! Now we know you’re likely from New Zealand. Lovely illustration."}, {"comment_id": "ew5gfwj", "post_id": "cmw9ek", "comment": "Ha beat me to it... Means she is a mum not a mom ;)"}, {"comment_id": "ew66via", "post_id": "cmw9ek", "comment": "One of us! One of us!"}, {"comment_id": "ew5brpl", "post_id": "cmw9ek", "comment": "Was going to say this!"}, {"comment_id": "ew5orte", "post_id": "cmw9ek", "comment": "Eastbourne in the Hutt?"}, {"comment_id": "ew72h1p", "post_id": "cmw9ek", "comment": "So what’s a buzzy bee?"}, {"comment_id": "ew5afmj", "post_id": "cmw9ek", "comment": "My god, what window of my house are you looking through?! This is my life."}, {"comment_id": "ew5hj40", "post_id": "cmw9ek", "comment": "Damn you’re a total babe"}, {"comment_id": "ew5iwls", "post_id": "cmw9ek", "comment": "Seriously - picking up green beans off the floor in yoga pants as my kids get that right before bedtime third/fourth/fifth wind of the day and I have never related to an image more than this one."}, {"comment_id": "ew5i9f2", "post_id": "cmw9ek", "comment": "I just sent this to my wife (who is upstairs nursing one of my four children). I have a good feeling this will be on her Facebook tomorrow."}, {"comment_id": "ew5tfvv", "post_id": "cmw9ek", "comment": "You have a lot of dishes. Hundreds even. And they all match."}, {"comment_id": "ew5h8ol", "post_id": "cmw9ek", "comment": "That’s not realistic, she has something crossed off her todo list."}, {"comment_id": "ew5zeg4", "post_id": "cmw9ek", "comment": "I always put \"write to do list\" at the top of mine so I can always check something off!"}, {"comment_id": "ew5z6p6", "post_id": "cmw9ek", "comment": "\"Pose for the painting\", that's what is crossed off."}, {"comment_id": "ew6e28c", "post_id": "cmw9ek", "comment": "It said \"wine\"."}, {"comment_id": "ew5av0t", "post_id": "cmw9ek", "comment": "nothing says keeping it together like drinking wine while breastfeeding"}, {"comment_id": "ew5d3ed", "post_id": "cmw9ek", "comment": "“Excess levels may lead to drowsiness, deep sleep, weakness, and decreased linear growth in the infant. Maternal blood alcohol levels must attain 300 mg/dl before significant side effects are reported in the infant. Reduction of letdown is apparently dose-dependent and requires alcohol consumption of 1.5 to 1.9 gm/kg body weight (1). Other studies have suggested psychomotor delay in infants of moderate drinkers (2+ drinks daily). **Avoid breastfeeding during and for 2 – 3 hours after drinking alcohol.** Heavy drinkers should wait longer.\"\n\n-Thomas W. Hale, R.Ph. Ph.D, *Medications and Mothers’ Milk (17th ed.)*"}, {"comment_id": "ew5dkyk", "post_id": "cmw9ek", "comment": "It's actually the ideal time to breastfeed as your blood alcohol won't increase until after baby is done nursing and cleared by the time it's time to breastfeed again. The more ya know!"}, {"comment_id": "ew5cco4", "post_id": "cmw9ek", "comment": "This was the first thing I thought..."}, {"comment_id": "ew5g27v", "post_id": "cmw9ek", "comment": "Gotta keep up the mommy drinking culture so someone keeps buying those cringey \"quirky\" fake vintage signs that say shit like \"I love cooking with wine, sOmEtImEs I eVeN cOoK wItH iT\""}, {"comment_id": "ew5h9w8", "post_id": "cmw9ek", "comment": "Good thing it’s art not a pic of a real person or else a bunch of people would start freaking out...and here they are anyway."}, {"comment_id": "ew5gmbf", "post_id": "cmw9ek", "comment": "Breastfeeding mom here (currently nursing second kid who is 18 months old and still going, first was breastfed until 26 months). It's perfectly safe to drink wine while breastfeeding. The idea that you can't have any alcohol at all is outdated information. Very little alcohol actually makes it into breast milk; it's practically insignificant. Even then, it's more of a concern of whether you can properly care for your child as opposed to cause injury by alcohol.\nThe general rule among knowledgeable and responsible breastfeeding moms is that if you are sober enough to drive, you are sober enough to care for your child. Obviously no one should be caring for a child if they are completely sloshed or buzzed."}, {"comment_id": "ew5g2ui", "post_id": "cmw9ek", "comment": "Sober enough to drive sober enough to nurse, that’s the truth."}, {"comment_id": "ew5cmb1", "post_id": "cmw9ek", "comment": "If suckin' titty got you fucked up, I'd be slightly dizzy every few months 😎"}, {"comment_id": "ew68c1x", "post_id": "cmw9ek", "comment": "If you managed to achieve something like a .4% BAC, a breastfeeding infant would get the equivalent of 2 teaspoons of Bud Light. A glass of wine might get a lightweight to .08%. Many cultures recommend 1-2 glasses a day throughout pregnancy and they haven’t collapsed yet.\n\nAll that said: no concerns from me if I see a mother breastfeeding at a brewery whilst pounding a beer. My grandma swore a good stout dramatically increased milk production!"}, {"comment_id": "ew5eg3e", "post_id": "cmw9ek", "comment": "Brilliant! Can you do a stay-at-home dad version?"}, {"comment_id": "ezn29it", "post_id": "cmw9ek", "comment": "[He did it! ](https://www.reddit.com/r/Art/comments/d1homo/father_max_thompsonme_digital_2019/?utm_source=share&utm_medium=ios_app)"}, {"comment_id": "ew5o9u6", "post_id": "cmw9ek", "comment": "I hope he/she does. That would be great"}, {"comment_id": "ew54vs1", "post_id": "cmw9ek", "comment": "Ah yes, the point where you decide to start wearing slippers around the house to avoid having to sweep/vacuum/mop was a depressing one."}, {"comment_id": "ew5iytt", "post_id": "cmw9ek", "comment": "Do socks count?"}, {"comment_id": "ew5fag8", "post_id": "cmw9ek", "comment": "Is there any other time to wear slippers?"}, {"comment_id": "ew5yrfm", "post_id": "cmw9ek", "comment": "I used to hate wearing shoes in the house and now I can’t stand walking around without slippers. The only time I take them off is after a cleaning and that only lasts for an afternoon. And then I’m questioning myself like why the fuck did I even bother."}, {"comment_id": "ew611h5", "post_id": "cmw9ek", "comment": "Seriously, I started putting a shower curtain under the table and shake it out once a day. Looks awful but I only sweep once every few days now...I'm tired"}, {"comment_id": "ew5b2ae", "post_id": "cmw9ek", "comment": "This looks like it could be art in Fallout"}, {"comment_id": "ew5ft4o", "post_id": "cmw9ek", "comment": "(that's because Fallout is based on the 50's advertising aesthetic)"}, {"comment_id": "ew68i6w", "post_id": "cmw9ek", "comment": "Except in fallout it'd have been made in all oppressive seriousness without a hint of humor/commentary to it."}, {"comment_id": "ew5hvuo", "post_id": "cmw9ek", "comment": "You should make this into a fridge magnet and make BANK off of the 30+ y/o women that would go absolutely ham for this content"}, {"comment_id": "ew5vcml", "post_id": "cmw9ek", "comment": "Every young mom thinks they look like this painting lol."}, {"comment_id": "ew54p5g", "post_id": "cmw9ek", "comment": "You should absolutely post this to /r/beyondthebump"}, {"comment_id": "ew5gn1r", "post_id": "cmw9ek", "comment": "as well as r/breastfeeding\n\nedited to remove a direct link to a subreddit as requested by the moderators."}, {"comment_id": "ew5h9bl", "post_id": "cmw9ek", "comment": "That’s where I thought I was originally!"}, {"comment_id": "ew5phuc", "post_id": "cmw9ek", "comment": "14 months postpartum with 2 under two, this is like a modern day Rosie the Riveter for stay at home moms. We can do it!, barely and rather sloppy, but we can!"}, {"comment_id": "ew5e8p0", "post_id": "cmw9ek", "comment": "For a lady who recently had a baby, she is in excellent shape"}, {"comment_id": "ew5ffwg", "post_id": "cmw9ek", "comment": "Yeah, I've seen some ladies that have bodies that snap back like that but they were the moms working out all the time when preg-o-nate.  Many other certainly don't."}, {"comment_id": "ew5apqy", "post_id": "cmw9ek", "comment": "Damn, i love this. It's always cool with details come in the longer you look at a piece. Excellent work!"}, {"comment_id": "ew5rncz", "post_id": "cmw9ek", "comment": "Very reminiscent of (don’t take this wrong - probably even derivative) of Norman Rockwell’s Saturday Evening Post magazine covers including the updating of the subject with the same sense of gentle humor."}, {"comment_id": "ew5bak6", "post_id": "cmw9ek", "comment": "Buzzy Bee and lambskin slippers - I spot a Kiwi influence here!"}, {"comment_id": "ew5ch23", "post_id": "cmw9ek", "comment": "I had to scroll way too far down for this comment!"}, {"comment_id": "ew5hkzo", "post_id": "cmw9ek", "comment": "I know someone going through this kinda thing. Should I show her this? Lol"}, {"comment_id": "ew5ihgn", "post_id": "cmw9ek", "comment": "Do you have an insta or something that I can link if this gets swiped for Facebook tonight?"}, {"comment_id": "ew5iurr", "post_id": "cmw9ek", "comment": "I can't 'self promote' on /art  ....but you could start with my username"}, {"comment_id": "ew59tz8", "post_id": "cmw9ek", "comment": "I am genuinely surprised that nobody has been ruining this thread crying about the fact that there is a breastfeeding mom drinking alcohol.\n\nAlso, very well done and love the style."}, {"comment_id": "ew5ckvk", "post_id": "cmw9ek", "comment": "Does alcohol affect breast milk? I didn’t know the answer so for those that also didn’t know. Here is the result. \n\n> [Can alcohol be found in breast milk?](https://www.cdc.gov/breastfeeding/breastfeeding-special-circumstances/vaccinations-medications-drugs/alcohol.html))\nYes. Alcohol levels are usually highest in breast milk 30-60 minutes after an alcoholic beverage is consumed, and can be generally detected in breast milk for about 2-3 hours per drink after it is consumed. However, the length of time alcohol can be detected in breast milk will increase the more alcohol a mother consumes. For example, alcohol from 1 drink can be detected in breast milk for about 2-3 hours, alcohol from 2 drinks can be detected for about 4-5 hours, and alcohol from 3 drinks can be detected for about 6-8 hours, and so on."}, {"comment_id": "ew5g2g7", "post_id": "cmw9ek", "comment": "Oh they have."}, {"comment_id": "ew5a9l0", "post_id": "cmw9ek", "comment": "That's what caught my eye and I wanted to see if anyone else mentioned it."}, {"comment_id": "ew5blg3", "post_id": "cmw9ek", "comment": "If anything I figured it would be the unrealistic body standards for a breastfeeding mother to look that good. I think its fine because of the clear pinup/ 50s reference."}, {"comment_id": "ew5bfpi", "post_id": "cmw9ek", "comment": "The wine hasn't had time to get into the breast milk, so having a glass of wine while breastfeeding is fine. Later on, it would be pump and dump to avoid the alcohol in the breast milk."}, {"comment_id": "ew5g7s0", "post_id": "cmw9ek", "comment": "I was too distracted thinking she looks way too fit to have given birth recently."}, {"comment_id": "ew5izeh", "post_id": "cmw9ek", "comment": "Must be why the baby’s head is so small."}, {"comment_id": "ew5c464", "post_id": "cmw9ek", "comment": "If it's actually unhealthy then there's nothing wrong with pointing it out. You're the one ruining this thread."}, {"comment_id": "ew5a6pp", "post_id": "cmw9ek", "comment": "I'm gonna be the one creepy comment that admits I find this kinda hot."}, {"comment_id": "ew5h2w1", "post_id": "cmw9ek", "comment": "I work night shifts and sleep all day..\n\nMy wife has to be supermom all day with our 7 month old and 8 year old.\n\nI feel like this is what she looks like while I'm sleeping and I find it very attractive. She busts her fucking ass and I couldn't even begin to understand it."}, {"comment_id": "ew5uo3l", "post_id": "cmw9ek", "comment": "Yeah this is super hot"}, {"comment_id": "ew5tqk1", "post_id": "cmw9ek", "comment": "Welcome to r/art. Aka r/softcoreporn Everyone only upvotes hot stuff here so you're fine."}, {"comment_id": "ew5ipq5", "post_id": "cmw9ek", "comment": "Here’s your one creepy upvote"}, {"comment_id": "ew5cd5i", "post_id": "cmw9ek", "comment": "We are in this togheter"}, {"comment_id": "ew5982m", "post_id": "cmw9ek", "comment": "[removed]"}, {"comment_id": "ew5ad9y", "post_id": "cmw9ek", "comment": "We were all thinking it, you just went and said it.\n\nKudos."}, {"comment_id": "ew5gxei", "post_id": "cmw9ek", "comment": "[removed]"}, {"comment_id": "ew5chr5", "post_id": "cmw9ek", "comment": "Can't tell if this is modern or old and i love it! great work."}, {"comment_id": "ew5knpe", "post_id": "cmw9ek", "comment": "Her heel being turned so much bothers me"}, {"comment_id": "ew5bc5v", "post_id": "cmw9ek", "comment": "Fallout world would be proud. This is some good 1950s style."}, {"comment_id": "ew5cryx", "post_id": "cmw9ek", "comment": "And the slogan really reflects the state of the franchise now too!"}, {"comment_id": "ew5ktss", "post_id": "cmw9ek", "comment": "Today, as a stay at home mom to a 9 month old and a 3 year old, this is speaking to my soul."}, {"comment_id": "ew5jnxu", "post_id": "cmw9ek", "comment": "Is it just me or is she dummy thicc"}, {"comment_id": "ew72xi9", "post_id": "cmw9ek", "comment": "hrrgnh honey im trying to clean the room but im dummy thicc and the clap from my ass cheeks keeps knocking the broom over"}, {"comment_id": "ew5acpn", "post_id": "cmw9ek", "comment": "This is great!\n\nThough she doesn't look nearly haggard enough!"}, {"comment_id": "ew5j2wj", "post_id": "cmw9ek", "comment": "Biased husband speaking ...\n\nShe looks like a pinup because that’s how moms should feel. “As a mom ...” is something that reddit loves to hate on, but the moms I know are superheroes."}, {"comment_id": "ew5ap6o", "post_id": "cmw9ek", "comment": "Parents of middle income America: You'd be surprised how affordable having someone come clean once or twice a month is, leaving the heavy cleaning like bathrooms and stuff for them. It's a pretty big burden off your shoulders and the cost is worth what you gain in peace of mind."}, {"comment_id": "ew5wo3g", "post_id": "cmw9ek", "comment": "This 100%. I have someone come twice a month for a couple hours apiece. I always thought I cleaned OK but our cleaner does it 4x more efficiently, and then she still makes very good money per hour. So. Fucking. Worth. It."}, {"comment_id": "f1prz8d", "post_id": "cmw9ek", "comment": "I read an article on NPR saying that money spent on cleaning people has the greatest dollar per dollar effect on your happiness."}, {"comment_id": "ew5ll6s", "post_id": "cmw9ek", "comment": "[deleted]"}, {"comment_id": "ew740o7", "post_id": "cmw9ek", "comment": "I'm a stay at home dad. I feel this picture."}, {"comment_id": "ew5b9di", "post_id": "cmw9ek", "comment": "Amazing! Could you do us full time dads a Father one?"}, {"comment_id": "ew5bsrt", "post_id": "cmw9ek", "comment": "Wtf why is she drinking wine and breast feeding"}, {"comment_id": "ew5femr", "post_id": "cmw9ek", "comment": "To be fair, she’s spilling it, not drinking it."}, {"comment_id": "ew5jk0k", "post_id": "cmw9ek", "comment": "Cos it's got a 50's vibe to it."}, {"comment_id": "ew5xvgr", "post_id": "cmw9ek", "comment": "Yeah, bad fictional illustrated mom.  \n\n\n\nThe fuck is with all these people commenting like this is a photograph of a real person?"}, {"comment_id": "ew5c3dd", "post_id": "cmw9ek", "comment": "It’s art, see the concept instead of taking it literal."}, {"comment_id": "ew5a26d", "post_id": "cmw9ek", "comment": "Who leaves their pile of laundry in a kitchen backed up with dishes?"}, {"comment_id": "ew5ev0k", "post_id": "cmw9ek", "comment": "I've seen a few houses with the laundry right in the kitchen hidden behind some cabinets or curtain. I don't care for the layout."}, {"comment_id": "ew65qee", "post_id": "cmw9ek", "comment": "New mums."}, {"comment_id": "ew53xzr", "post_id": "cmw9ek", "comment": "Ho wow!! Beautiful! I see myself in your painting!!(and my house too)"}, {"comment_id": "ew59zuh", "post_id": "cmw9ek", "comment": "Ritalin for the Energy.\n\nZoloft for that smile on her face.\n\nAnd Xanax and red wine to relax after a hard day.\n\nWhat can go wrong? Happy mother, happy family!"}, {"comment_id": "ew5kmax", "post_id": "cmw9ek", "comment": "The baby"}, {"comment_id": "ew5bg1z", "post_id": "cmw9ek", "comment": "Zoloft doesn't work like that."}, {"comment_id": "ew592kt", "post_id": "cmw9ek", "comment": "She had time to put earrings and makeup on"}, {"comment_id": "ew5eqvm", "post_id": "cmw9ek", "comment": "Hence the dishes and laundry not done. We can see where her priorities are."}, {"comment_id": "ew5auex", "post_id": "cmw9ek", "comment": "She never took em off when she went to bed."}, {"comment_id": "ew5oat5", "post_id": "cmw9ek", "comment": "Meh... I’d take a healthy good looking (mentally and physically) wife over a good looking kitchen EVERYDAY. \n\nWho wants to stay home in the house anyways? Take the kids to the park to run out of fuel and fall in deep sleep for nice alone time with the better half."}, {"comment_id": "ew5btcg", "post_id": "cmw9ek", "comment": "Oh god she’s going to step on that toy and slip and bust her head oh lord, and the baby is gonna fly out the window oh Fuck!"}, {"comment_id": "ew58gwa", "post_id": "cmw9ek", "comment": "I love how the numbers on the clock are irrelevant but clearly lets the viewer know it has 5 o'clock somewhere for quite some time"}, {"comment_id": "ew5csi8", "post_id": "cmw9ek", "comment": "I love the art!  It invokes Norman Rockwell, WW2 era pin-ups, and modern feminist humour.  Brilliant."}, {"comment_id": "ew5dspo", "post_id": "cmw9ek", "comment": "Looks so cool and Fallout-y! You captured the 50s artstyle amazingly well!"}, {"comment_id": "ew5fort", "post_id": "cmw9ek", "comment": "I got super excited when I spotted the buzzy bee!! The quintessential toy for kiwi babies🐝"}, {"comment_id": "ew5i8ir", "post_id": "cmw9ek", "comment": "This is amazing! Great work!"}, {"comment_id": "ew5imck", "post_id": "cmw9ek", "comment": "My favourite part of this, and there are many great parts, is the glass of wine while breastfeeding a baby."}, {"comment_id": "ew5is1w", "post_id": "cmw9ek", "comment": "Dude. This is amazing. I feel this. Add a briefcase in there to add in societies expectation for us to work full time during all of this too. Ha."}, {"comment_id": "ew5isu7", "post_id": "cmw9ek", "comment": "Arw, and a little Buzzy Bee ready to trip over. \n\nLove it!!"}, {"comment_id": "ew5j30p", "post_id": "cmw9ek", "comment": "3 months post partum with my 3rd, our house is 90 degrees (hot for here) and I am sick. So this was beyond relatable. Love it!"}, {"comment_id": "ew5jdxm", "post_id": "cmw9ek", "comment": "It's crazy to think we used to be able to do anything we wanted.. all day!"}, {"comment_id": "dmcwejg", "post_id": "6x24ln", "comment": "Wow, this is awesome! Thanks OP!\n\nI'm blown away, your work is a marvelous use of the tool! We appreciate you sharing it with us. This post is skyrocketing so I just want to remind people to review our sidebar, and to be sure to follow our rules for commenting, they can be found here:\n\n>http://www.reddit.com/r/art/about/sidebar\n\nWe're looking forward to your next submissions <3"}, {"comment_id": "dmch9gw", "post_id": "6x24ln", "comment": "This is my very first post on this subreddit. Usually, I do not post in such subreddits, but since this artwork took me so long (almost two weeks), it would have been a shame not trying to share it to a greater audience. Hoping this would raise some kind of interest, I know that MsPaint isn't a medium that is looked up for its potential in the making of detailed artworks. [Reference image](https://i.redd.it/f6i1d7rj2f7z.jpg).\n\nEdit: thank you for the gold!"}, {"comment_id": "dmck318", "post_id": "6x24ln", "comment": "I vastly prefer your interpretation to the original image and you've also given me new respect for MS Paint as a viable medium. "}, {"comment_id": "dmcvxsr", "post_id": "6x24ln", "comment": "Beautiful! I used to spend ridiculous amounts of time drawing on MsPaint too....something therapeutic about going pixel by pixel.... Here's [some old Greek dude](http://z8.invisionfree.com/Bronze_Age_Center/index.php?act=Attach&type=post&id=4576753)"}, {"comment_id": "dmct8w7", "post_id": "6x24ln", "comment": "First thought: There's no way this is MS Paint\n\nAfter zooming in: Holy fuck that's MS Paint\n\nGreat work dude"}, {"comment_id": "dmcifia", "post_id": "6x24ln", "comment": "FANTASTIC!!  I really like this.  Thank you for posting.  Great job. \n\n"}, {"comment_id": "dmcv44t", "post_id": "6x24ln", "comment": "Wow. You made this in MS Paint.. you are truly an artist! Not to mention a masochist :) But kudos to you.\n\nPs is that Amsterdam? In the 70s?"}, {"comment_id": "dmd0lpc", "post_id": "6x24ln", "comment": "It only took two weeks??????????????"}, {"comment_id": "dmcumdg", "post_id": "6x24ln", "comment": "Amsterdam in the 70's?"}, {"comment_id": "dmctegs", "post_id": "6x24ln", "comment": "Hahahaha I love how you changed the blue neons to \"Thunderdome\"."}, {"comment_id": "dmcynxv", "post_id": "6x24ln", "comment": "This took you two weeks, and it's better than anything I can do in 2 decades. \n\nIn all seriousness, well done. This is absolutely incredible, and you should be extremely proud of it. Great work, hope to see more in the future! "}, {"comment_id": "dmd0ee8", "post_id": "6x24ln", "comment": "Soooo, how was the pact with the devil"}, {"comment_id": "dmcpp2b", "post_id": "6x24ln", "comment": "Man! Great piece! \n"}, {"comment_id": "dmcuaa0", "post_id": "6x24ln", "comment": "did you just draw over the picture in ms paint? I used to do that all the time and the results were always exactly like yours turned out"}, {"comment_id": "dmcrbee", "post_id": "6x24ln", "comment": "How long did this take you?"}, {"comment_id": "dmczz3l", "post_id": "6x24ln", "comment": "Were you the guy on vox?"}, {"comment_id": "dmd07se", "post_id": "6x24ln", "comment": "I know everyone in this thread is saying the same, but you are super talented. Just 2 weeks for this? It's amazing."}, {"comment_id": "dmd1lx8", "post_id": "6x24ln", "comment": "How many hours per day it took you?"}, {"comment_id": "dmd1q9e", "post_id": "6x24ln", "comment": "Sweet Jesus, just the idea of trying to create straight lines on MS paint is agonizing, let alone a full painting. I can only try to picture how many undos were used throughout the duration of this, and how much patience it took This is a fantastic piece! I especially love the water with the light reflecting off of it."}, {"comment_id": "dmcs5go", "post_id": "6x24ln", "comment": "So you achieved more in two weeks than I have my whole life. \n\nWell it's not the first time, but I'm atleast not mad about this one."}, {"comment_id": "dmcrfe2", "post_id": "6x24ln", "comment": "This is amazing! Thank you for sharing it!"}, {"comment_id": "dmctimr", "post_id": "6x24ln", "comment": "Dude...it's fucking awesome!!!"}, {"comment_id": "dmctnox", "post_id": "6x24ln", "comment": "Your work is excellent! Great job!"}, {"comment_id": "dmcx5vr", "post_id": "6x24ln", "comment": "I doubt you'll see this, I'm sure you've disabled replies. But why is it titled Endgame? I'm quite curious."}, {"comment_id": "dmcy2ka", "post_id": "6x24ln", "comment": "did you use a pen tablet while drawing this?"}, {"comment_id": "dmcy5e7", "post_id": "6x24ln", "comment": "You, sir, made something *better* than the original - in ms paint nonetheless - I love it, and you should too :)"}, {"comment_id": "dmcyo3b", "post_id": "6x24ln", "comment": "Absolutely amazing work OP. As a kid I used to spend hours drawing in MS Paint. I wish I could have seen your work then for inspiration as it actually doesn't seem possible. Well done and keep creating and sharing! "}, {"comment_id": "dmcz8ra", "post_id": "6x24ln", "comment": "Seeing your artwork I thought it had an Amsterdam vibe. Heh, I used to work just across the street. Great work!"}, {"comment_id": "dmczke5", "post_id": "6x24ln", "comment": "For a second I couldn't tell them apart..."}, {"comment_id": "dmd0msz", "post_id": "6x24ln", "comment": "Saved for desktop background. Nice work buddy"}, {"comment_id": "dmd12vf", "post_id": "6x24ln", "comment": "This is incredible! I can't believe you did this in MS Paint! Your diligence with this piece paid off! Absolutely marvelous! "}, {"comment_id": "dmd1bfe", "post_id": "6x24ln", "comment": "You're great and you should feel great."}, {"comment_id": "dmd1mch", "post_id": "6x24ln", "comment": "Looks like a Morris Nomad parked in front - my first car"}, {"comment_id": "dmd1t2u", "post_id": "6x24ln", "comment": "Holy sh*t.  I am in awe...\n\n*MS Paint*?  Wow."}, {"comment_id": "dmd20si", "post_id": "6x24ln", "comment": "I thought the cars were flooded and endgame was referring to climate change.  Either way the art is unbelievable. "}, {"comment_id": "dmd27nr", "post_id": "6x24ln", "comment": "And why is it called endgame? And did you take the picture yourself that you used for reference?"}, {"comment_id": "dmd4scv", "post_id": "6x24ln", "comment": "Did you literally use a computer mouse to do this?"}, {"comment_id": "dmd5at4", "post_id": "6x24ln", "comment": "I mean did you use a mouse?"}, {"comment_id": "dmd64wp", "post_id": "6x24ln", "comment": "Please do this more.\n\nJust. Holy shit. "}, {"comment_id": "dmd67lu", "post_id": "6x24ln", "comment": "This is amazing OP.. What was the hardest part of the drawing? I can't even draw a car lol"}, {"comment_id": "dmd6h2a", "post_id": "6x24ln", "comment": "I really thought this was not done in mspaint then I zoomed in and could see the \"square\" lines. Truly amazing work."}, {"comment_id": "dmd6jkr", "post_id": "6x24ln", "comment": "Is that a very old oicture of central amsterdam. Damrak to Damsquare i gues 80's?"}, {"comment_id": "dmd6r8j", "post_id": "6x24ln", "comment": "The picture is in Germany, really pretty.\n\nI used to draw pixel pictures for a game called runescape. The big guys could make anything between 20-50$ per picture.\n\nThis is amazing. So much love for detail"}, {"comment_id": "dmd77eb", "post_id": "6x24ln", "comment": "Is this you? https://youtu.be/3eKBiEeag1A"}, {"comment_id": "dmd79ui", "post_id": "6x24ln", "comment": "What version of MS Paint you on? I mean, i heard the next version of Paint from Microsoft is like photoshop on steroid because it can edit image but also 3d"}, {"comment_id": "dmd7g74", "post_id": "6x24ln", "comment": "This is amazing! It instantly reminded me of the Damrak/Damsquare even though you changed some of the storefronts :)"}, {"comment_id": "dmd8ne9", "post_id": "6x24ln", "comment": ">so long\n>almost 2 weeks\n\nIt would've taken me 2 years."}, {"comment_id": "dmd8vit", "post_id": "6x24ln", "comment": "What the fuck!!! What the fuck!!! sorry, i have no other words to say upon seeing your art. Just… what the fuuuuck"}, {"comment_id": "dmd90y6", "post_id": "6x24ln", "comment": "Thank you for sharing."}, {"comment_id": "dmd97lz", "post_id": "6x24ln", "comment": "Where is this picture taken? Looks like Amsterdam, but I can't pinpoint it exactly..."}, {"comment_id": "dmd9pn8", "post_id": "6x24ln", "comment": "Only two weeks?? That's amazing"}, {"comment_id": "dmddn9t", "post_id": "6x24ln", "comment": "That's some pretty damn fantastic work OP. "}, {"comment_id": "dmddviy", "post_id": "6x24ln", "comment": "Just from an eye that uses photoshop and illustrator daily, it shows the telltale signs of bumping up the threshold and posterise. Did you process the reference image in photoshop and then use that to redraw it in MSpaint? "}, {"comment_id": "dmdiblc", "post_id": "6x24ln", "comment": "Not only that, it's also become the 3rd top post in 16 hours"}, {"comment_id": "dmdkac5", "post_id": "6x24ln", "comment": "RIP MS PAINT"}, {"comment_id": "dmdozzi", "post_id": "6x24ln", "comment": "Hey OP, I love this! Do you use a mouse or do you have a tablet? I've done a couple of portraits on MS Paint while bored at work and I really like how they came out, but it was pretty challenging with a mouse lol. "}, {"comment_id": "dmdqxa5", "post_id": "6x24ln", "comment": "My god man, what a skill!! Hats off to you sir."}, {"comment_id": "dof91i4", "post_id": "6x24ln", "comment": "\"168<x≤ 336 in MS Paint\" then?"}, {"comment_id": "dot41yv", "post_id": "6x24ln", "comment": "You deserve more than gold, friend."}, {"comment_id": "dmcp1rq", "post_id": "6x24ln", "comment": "Fuuuuuuuck. This is like playing darksouls with a guitar hero controller. "}, {"comment_id": "dmcpv1w", "post_id": "6x24ln", "comment": "It's like a blind person trying to use Braille printed on paper."}, {"comment_id": "dmcrz2v", "post_id": "6x24ln", "comment": "Or Soul Calibur with the Sega Fishing Rod Controller."}, {"comment_id": "dmcvylk", "post_id": "6x24ln", "comment": "It's like using Microsoft paint to make some really awesome artwork."}, {"comment_id": "dmcv5j0", "post_id": "6x24ln", "comment": "I'm legit unsure if you don't know about the people who play best dark souls with a DJ hero controller, those donkey Kong bongo drums, or a potato with sensory inputs."}, {"comment_id": "dmcvo0b", "post_id": "6x24ln", "comment": "Its like flying the space shuttle with a Nintendo controller."}, {"comment_id": "dmd43xk", "post_id": "6x24ln", "comment": "It's like flying to the moon with a hot air balloon and scuba tanks "}, {"comment_id": "dmcxps0", "post_id": "6x24ln", "comment": "Or building the pyramids with bronze age tools"}, {"comment_id": "dmcvgbh", "post_id": "6x24ln", "comment": "More like playing dark souls with a drum set"}, {"comment_id": "dmcvp2l", "post_id": "6x24ln", "comment": "If I recall correctly, there's a video of a guy out there playing darksouls with the drums from Rockband"}, {"comment_id": "dmcvpjh", "post_id": "6x24ln", "comment": "Or some bananas."}, {"comment_id": "dmcw0ww", "post_id": "6x24ln", "comment": "Like winning solo PUBG with just a frying pan."}, {"comment_id": "dmcy2r8", "post_id": "6x24ln", "comment": "I fully second this observation "}, {"comment_id": "dmczg4b", "post_id": "6x24ln", "comment": "I sneak and give you my money,friend. Do you see the winds?"}, {"comment_id": "dmczmvw", "post_id": "6x24ln", "comment": "No kidding! I spent a fair amount of time trying to figure out what message the artist might be trying to convey, but I wound up concluding that he/she really likes Mad Max and just wanted to show off their Paint skills"}, {"comment_id": "dmczoun", "post_id": "6x24ln", "comment": "And then winning the game. "}, {"comment_id": "dmd00ua", "post_id": "6x24ln", "comment": "No, it's like playing fifa with a steering wheel... "}, {"comment_id": "dmd03hz", "post_id": "6x24ln", "comment": "/r/nocontext"}, {"comment_id": "dmd0ssk", "post_id": "6x24ln", "comment": "Yeah, I know a thing or two about graphic design, and at first I thought \"that's not Paint!\"  Zooming in, the techniques start to make sense (and the jagged bits become easy to see,) but I really didn't think this end result would be possible without an assortment of tools Paint does not feature."}, {"comment_id": "dmd0st6", "post_id": "6x24ln", "comment": "It's just like Dark Souls!"}, {"comment_id": "dmd0xk7", "post_id": "6x24ln", "comment": "Ms Paint is the Dark Souls of graphics editors"}, {"comment_id": "dmd1gj0", "post_id": "6x24ln", "comment": "More like with doritos"}, {"comment_id": "dmd1ur3", "post_id": "6x24ln", "comment": "Or that dude who beat Dark Souls 3 with like, 9 bananas. "}, {"comment_id": "dmd321v", "post_id": "6x24ln", "comment": "Still better than a DDR dance pad."}, {"comment_id": "dmd5dvb", "post_id": "6x24ln", "comment": "It's like trying to play piano with a chair. "}, {"comment_id": "dmdl61g", "post_id": "6x24ln", "comment": "That's probably easier, you just have to learn the patterns. This, in paint? Goddamn!"}, {"comment_id": "dmdpqt1", "post_id": "6x24ln", "comment": "That's been done.\n\nhttps://www.youtube.com/watch?v=Gr61Zt4jBZo"}, {"comment_id": "dmdq3uq", "post_id": "6x24ln", "comment": "That was exactly my first thought. Came to see what people in the ol art community thought about his kinda thing. "}, {"comment_id": "dmduh8c", "post_id": "6x24ln", "comment": "Its like being gay in russia."}, {"comment_id": "dmcprk8", "post_id": "6x24ln", "comment": "Potatoe"}, {"comment_id": "dmciop5", "post_id": "6x24ln", "comment": "This is incredible, I love the idea of taking a simple software and using its potential to the maximum."}, {"comment_id": "dmcpqc3", "post_id": "6x24ln", "comment": "Then you should look up excel art. [This](http://www.spoon-tamago.com/wp-content/uploads/2013/05/tatsuo-horiuchi-1.jpg) is one of my fav"}, {"comment_id": "dmcsr32", "post_id": "6x24ln", "comment": "It's like the guy who made the original RollerCoaster Tycoon. He programmed basically the whole game in x86 assembler/machine code. "}, {"comment_id": "dmcjivx", "post_id": "6x24ln", "comment": "are you a undercover marketing genus for ms paint or something "}, {"comment_id": "dmck66y", "post_id": "6x24ln", "comment": "Just someone who has a lot of free time and dedication. Nothing more, really."}, {"comment_id": "dmcp1i8", "post_id": "6x24ln", "comment": "Doubt they would do that when they announced they are stopping paint."}, {"comment_id": "dmcu4my", "post_id": "6x24ln", "comment": "His species is dedicated to undercover marketing."}, {"comment_id": "dmctldm", "post_id": "6x24ln", "comment": "Video game companies if you're reading this hire this guy. This is the type of creativity we need in video games "}, {"comment_id": "dmct5y7", "post_id": "6x24ln", "comment": ">someone does something cool with a tool they didn't create  \n  \n>a user immediately claims /r/hailcorporate   "}, {"comment_id": "dmctz0w", "post_id": "6x24ln", "comment": "Well he's probably out of work now "}, {"comment_id": "dmcu7fb", "post_id": "6x24ln", "comment": "Isnt paint free tho"}, {"comment_id": "dmcua7g", "post_id": "6x24ln", "comment": "I call Shenanigans "}, {"comment_id": "dmcuhol", "post_id": "6x24ln", "comment": "It's Mr. Paint to you "}, {"comment_id": "dmcunht", "post_id": "6x24ln", "comment": "The joke used to be that ms paint looks better than world of warcraft but now it in fact looks better than world of warcraft. "}, {"comment_id": "dmcuw45", "post_id": "6x24ln", "comment": "What family does that fall under? "}, {"comment_id": "dmcvhho", "post_id": "6x24ln", "comment": "No, but he is part of our underground movement to save MS Paint... We will be heard. We will continue to paint. "}, {"comment_id": "dmcz89n", "post_id": "6x24ln", "comment": "Shit he must be because I just bought 7 copies of ms paint."}, {"comment_id": "dmcmgtf", "post_id": "6x24ln", "comment": "[deleted]"}, {"comment_id": "dmcmkm1", "post_id": "6x24ln", "comment": "Yeah! Someone got it!"}, {"comment_id": "dmcwoe2", "post_id": "6x24ln", "comment": "Can't we get Beyond Thunderdome?"}, {"comment_id": "dmcwhv9", "post_id": "6x24ln", "comment": "You mean the *Blood dome*?"}, {"comment_id": "dmcvalk", "post_id": "6x24ln", "comment": "It's Barter Town, mother fucker! "}, {"comment_id": "dmcyb29", "post_id": "6x24ln", "comment": "Save it for the semantics dome, E. B. White."}, {"comment_id": "dmcto0t", "post_id": "6x24ln", "comment": "YUUSSSS"}, {"comment_id": "dmck8sw", "post_id": "6x24ln", "comment": "This is unbelievably great. How long did it take you?\n\n[All I could ever do was this...] (http://pad3.whstatic.com/images/thumb/c/cd/Create-Your-Own-Desktop-Backgrounds-with-Microsoft-Paint-Step-4.jpg/aid650882-v4-728px-Create-Your-Own-Desktop-Backgrounds-with-Microsoft-Paint-Step-4.jpg)"}, {"comment_id": "dmclutk", "post_id": "6x24ln", "comment": "That could sell for millions in the right market. \n\nEdit: sell not sleep. \n\n"}, {"comment_id": "dmcv6yh", "post_id": "6x24ln", "comment": "Yes!!! When we first got a computer, that's like all there was to do! Just fill in the circles and squares lol."}, {"comment_id": "dmcuol1", "post_id": "6x24ln", "comment": "Key secret is opening **TWO** copies of MS Paint and using one as a scratchpad.\n\nAlso if you right click with eraser it only erases your secondary color."}, {"comment_id": "dmctrm2", "post_id": "6x24ln", "comment": "Yeah, but your work on those tiny fonts is outstanding. Nearly perfect. "}, {"comment_id": "dmct7r5", "post_id": "6x24ln", "comment": "I THOUGHT THIS WAS A PHOTOGRAPH. WHAT IS HAPPENING. "}, {"comment_id": "dmctnsb", "post_id": "6x24ln", "comment": "SAME LOL I WAS LIKE \"this is an insane camera\""}, {"comment_id": "dmcjmtk", "post_id": "6x24ln", "comment": "This will be the cover for Microsoft paint 2020"}, {"comment_id": "dmcpqku", "post_id": "6x24ln", "comment": "Nope. Ms paint is done after w10"}, {"comment_id": "dmct5jv", "post_id": "6x24ln", "comment": "In MS paint I can draw a very convincing worm..."}, {"comment_id": "dmcwh8i", "post_id": "6x24ln", "comment": "Nah man, you've got nothing on my drawing of a snake"}, {"comment_id": "dmcjrks", "post_id": "6x24ln", "comment": "I would have hired you at Sega in the 90s and people would be making YouTube videos about your legicy. You were born at the wrong time man."}, {"comment_id": "dmck21w", "post_id": "6x24ln", "comment": "I'm honestly not that sure... recently, we have seen the resurgence of this \"naive\" style of drawing. Because of the fact that there are so few creators of such artworks, it is still somewhat considered as something \"exceptional\". And with the fall of the pixel-based video games, it has acquired a new dimension, away from the simple functional use. So, maybe that the second age of the pixel is coming, who knows?"}, {"comment_id": "dmcrpuj", "post_id": "6x24ln", "comment": "You work for Sega?"}, {"comment_id": "dmcsma1", "post_id": "6x24ln", "comment": "So was sega ;P\n\nSonic will make a comeback...one day....one day...\n\ndid you single handedly ruin sega?"}, {"comment_id": "dmcxlko", "post_id": "6x24ln", "comment": "Legicy is for the best. Legacy is for everyone else."}, {"comment_id": "dmclxwd", "post_id": "6x24ln", "comment": "Holy Shit that was on MS Paint??? Nice job, love the reflections on the street"}, {"comment_id": "dmciny1", "post_id": "6x24ln", "comment": "What do you mean Microsoft Paint? I refuse to believe."}, {"comment_id": "dmcivlr", "post_id": "6x24ln", "comment": "Just zoom in really close! You will realize that the level of detail isn't the same everywhere and that some reflects aren't logical. Or just look at the little easter eggs I have hidden in the names of some buildings!"}, {"comment_id": "dmcjqju", "post_id": "6x24ln", "comment": "You should share this with r/PixelArt."}, {"comment_id": "dmcud06", "post_id": "6x24ln", "comment": "Be prepared for the pedantics who will say/argue it's not pixel art (after some thought myself, I don't think it is either).\n\nIt is definitely made of pixels, and large-scale backgrounds are definitely considered pixel art when done correctly*.\n\nTo be a bit trife, I'd compare this to a palette-knifed acrylic piece of traditional art. Where the attention was in the shapes and \"conveying\" objects and the scene with slabs of color, without sketching up real-life-like lines and shades.\n\n\"Pixel art\" as most agree, is when each individual pixel is placed with intention, even in larger pieces.\n\nI apologize for this reply which you didn't solicit. This art is nonetheless spectacular and whatever you'd call it, I'd love to get a print if had the money."}, {"comment_id": "dmclkny", "post_id": "6x24ln", "comment": "/r/mspaint\nSadly it's a relatively tiny subreddit, but I'm sure it would be greatly appreciated there."}, {"comment_id": "dmcrige", "post_id": "6x24ln", "comment": "You should record your screen the next art on paint and do a time-lapse of it"}, {"comment_id": "dmcp3cb", "post_id": "6x24ln", "comment": "Well this is the best thing I've seen all week by far. Good job op! "}, {"comment_id": "dmck9k6", "post_id": "6x24ln", "comment": "If you zoom in you can see each of the little pixels. This is incredible work and getting the reflection on the wet street to look right is stunning."}, {"comment_id": "dmcsehk", "post_id": "6x24ln", "comment": "Yeah I would pay for this print"}, {"comment_id": "dmcubb0", "post_id": "6x24ln", "comment": "Ms paint.\nMs.\nFucking.\nPaint.\nI'm in fucking awe."}, {"comment_id": "dmcx4hj", "post_id": "6x24ln", "comment": "I've been just staring at this pic for more than 2 mins now. I just wanna say thank you OP. \n\nYour painting brought me back to almost a year ago when I was at New York, it was getting dark and it started raining, the street and the light looks just like this. The air is so refreshing and I was having a great time. Everything made me feel happy. Now I'm sitting at my apartment in California, facing the hottest week, my long time girlfriend just left me 3 months ago. I've been having a hard time ever since. \n\nThis pic all of sudden brought me back to that evening in New York, everything seems so beautiful and peaceful. What a great work!\n"}, {"comment_id": "dmd205x", "post_id": "6x24ln", "comment": "Made an account just to like this comment. Was it worth it? Yup"}, {"comment_id": "dmcsxdu", "post_id": "6x24ln", "comment": "Incredible job! Please post more, and if/when you are equipped to do so, you should do a timelapse video showing your talented process. Would be an instant hit for sure!"}, {"comment_id": "dmcxkpo", "post_id": "6x24ln", "comment": "This guy has some Paint Skillz! Thanks for the share."}, {"comment_id": "dmcxxud", "post_id": "6x24ln", "comment": "The best I've ever seen. So fitting, amazing work!"}, {"comment_id": "dmd0zu1", "post_id": "6x24ln", "comment": "Am I reading this right? Microsoft Paint? Best I ever did in Paint is some squiggly lines and occasionally a car. Much better at Photoshop, lol.\n\nThis is incredible OP. How long have you been using MS Paint and how long did this take you? I imagine it gets a little quicker (more efficient, rather) once you get used to it all.\n\nAgain, amazing work. Floored me."}, {"comment_id": "dmd153n", "post_id": "6x24ln", "comment": "So pissed they're dropping this. Such a quick tool. \n\nMy line of work is similar to law enforcement- I use many of the same tools and applications. Part of my job is to observe a decision making unit (DMU) without making any contact, or letting them know I am there. \n\nI use paint exclusively to quickly build visual profiles, combining screenshots of data to photos and other forms of medium, regarding my observations.\n\nI wonder if MS even considers the vast range of legal uses that MS Paint is used in. If or when Paint vanishes, I'm not sure what my department will do. This is crazy. "}, {"comment_id": "dpq9nfk", "post_id": "6x24ln", "comment": "\"There's no fucking way...\"\n\n*zooms in*\n\n\"Jesus christ\""}, {"comment_id": "dmcmv4m", "post_id": "6x24ln", "comment": "Holy fucking shit\n\nAmazing "}, {"comment_id": "dmcs7m7", "post_id": "6x24ln", "comment": "Beautiful. Reminds me of an elftor strip in which a character dares to mock MS Paint and then gets killed by an ultra detailed MS Painted Gandalf.\n\nhttp://www.elftor.com/images/elftor/strips/112/elftor112-3.gif"}, {"comment_id": "dmcrr7z", "post_id": "6x24ln", "comment": "can you paint this on minecraft should be the real question"}, {"comment_id": "dmcjnf0", "post_id": "6x24ln", "comment": "I still think you are a fiber."}, {"comment_id": "dmcz8x8", "post_id": "6x24ln", "comment": "Single or multi mode?"}, {"comment_id": "dmcsp2r", "post_id": "6x24ln", "comment": "No fucking way this is MS paint. "}, {"comment_id": "dmcsp4v", "post_id": "6x24ln", "comment": "You Hal Lasko's granddaughter from the future or somethin?"}, {"comment_id": "dmcssb6", "post_id": "6x24ln", "comment": "[removed]"}, {"comment_id": "dmcsuv6", "post_id": "6x24ln", "comment": "I'm not quite old enough to remember the time period referenced in the image but something about this picture triggers a very pleasant nostalgia in me.\n\nI can't be sure but I think it's the neon reflections on the rain slicked street."}, {"comment_id": "dmct8m1", "post_id": "6x24ln", "comment": "Holy hell! You deserve an award!!"}, {"comment_id": "dmctse5", "post_id": "6x24ln", "comment": "I can't decide which one I like more, this or the Polandball one. This is incredible!"}, {"comment_id": "dmctxd4", "post_id": "6x24ln", "comment": "i like the mercedes logo. didnt expect to see any detail on the grill"}, {"comment_id": "dmcu7ia", "post_id": "6x24ln", "comment": "One word.    \n\n\nI don't believe you "}, {"comment_id": "dmcuh3l", "post_id": "6x24ln", "comment": "how did you make that in paint? "}, {"comment_id": "dmcvppk", "post_id": "6x24ln", "comment": "Fuck off this was not done in paint there's no way look how good it looks holy shit"}, {"comment_id": "dmcw7xx", "post_id": "6x24ln", "comment": "My goodness, is that really MS Paint?.\n\nWow, congratulations! It looks fantastic."}, {"comment_id": "dmcw8yn", "post_id": "6x24ln", "comment": "It's like batman in Gotham "}, {"comment_id": "dmcwhr1", "post_id": "6x24ln", "comment": "Wow, was this really done using Microsoft Paint? This is incredible, keep up the good work! I'd love to see more of your work OP. "}, {"comment_id": "dmcwj0b", "post_id": "6x24ln", "comment": "When you zoom in it reminds me of the dot guy with the park. "}, {"comment_id": "dmcwoj2", "post_id": "6x24ln", "comment": "The internet finds new ways every day to show me how much talent I lack.\n\nThis is incredible."}, {"comment_id": "dmcx6ho", "post_id": "6x24ln", "comment": "There's so much stuff I love about this. I love wet cities at late nights while illuminated by lights. Bravo!"}, {"comment_id": "dmcxben", "post_id": "6x24ln", "comment": "Wow, how did you do this??\n\nThe best I could get on MS Paint was a badly drawn dog that looked like a potato with legs!"}, {"comment_id": "dmd23ki", "post_id": "6x24ln", "comment": "Best I could get was the Pixar logo and the aperture science logo. With a drawing tablet."}, {"comment_id": "dmcxksi", "post_id": "6x24ln", "comment": "This is crazy! I want to follow you, do you have an insta account? "}, {"comment_id": "dmcxpdx", "post_id": "6x24ln", "comment": "It's amazing what people can do with microsoft paint, wish I had skills like that :)"}, {"comment_id": "di0x2hy", "post_id": "6d9qy4", "comment": "[removed]"}, {"comment_id": "di0y33q", "post_id": "6d9qy4", "comment": "Very creative I really like it,\n keep up the great work !"}, {"comment_id": "di12w7h", "post_id": "6d9qy4", "comment": "This is fantastic. I'm quite taken with this piece.\nWould it be possible to purchase this as a print, possibly on canvas? I would love to hang this in my daughters room. "}, {"comment_id": "di11ptz", "post_id": "6d9qy4", "comment": "My God, this is beautiful!"}, {"comment_id": "di12xyt", "post_id": "6d9qy4", "comment": "This is eye wateringly beautiful. Please never stop creating art."}, {"comment_id": "di12k9n", "post_id": "6d9qy4", "comment": "Brilliant! This is how much I love it!\n\nhttps://drive.google.com/open?id=0BxkcUlxyOAU-cDQ5enJZOGFQYXM"}, {"comment_id": "di13mac", "post_id": "6d9qy4", "comment": "You should post more on Reddit! I went and looked at some of your previous post and I like them all. You have some real talent "}, {"comment_id": "di14nmn", "post_id": "6d9qy4", "comment": "Need canvas, take my money. "}, {"comment_id": "di1lzik", "post_id": "6d9qy4", "comment": "I dislike photography and when I get asked what I would consider a good photographer it's someone like you, who designs a shot and puts in work to flesh out the image, not someone who takes a flat shot of a pond on a misty day. You made a beautiful image as opposed to being the guy who just found a beautiful image. The fact you have a creation video shows that. I realize my opinion on it is unpopular and I don't respect most photography but thought I'd throw it out there that this is to me what photography should be. "}, {"comment_id": "di14fuo", "post_id": "6d9qy4", "comment": "Ah I love the final image but the BTS process makes this so interesting\nto me. Interesting planning and attention to detail like in the van posters which I didn't note until watching the video.... if the photo was in a museum having a screen looping the bts video would have people talking about the image a whole lot more."}, {"comment_id": "di1337t", "post_id": "6d9qy4", "comment": "is there a link to where you could buy one of the moon hats?? theyre v cute "}, {"comment_id": "di13vq0", "post_id": "6d9qy4", "comment": "That awesome, I love the small details on the picture. "}, {"comment_id": "di14hw6", "post_id": "6d9qy4", "comment": "Brilliant concept and execution (especially the half-black lamp), and your video editing is insane!"}, {"comment_id": "di13a9j", "post_id": "6d9qy4", "comment": "Kudos for going to all that effort. Using practical effects really paid off. "}, {"comment_id": "di15nog", "post_id": "6d9qy4", "comment": "Amazing work!\n\nSjukt kreativt."}, {"comment_id": "di17pk7", "post_id": "6d9qy4", "comment": "I saw this and immediately felt enraged that your name wasn't in the title and I thought 'who would steal my favorite photographers work?!' And then read this comment. Huge fan of your work. You inspired me in college to pursue photoshop in my fine art portraiture. Love your bts videos too!!"}, {"comment_id": "di1mgvt", "post_id": "6d9qy4", "comment": "Holy Moons. I never comment on these art posts because I've never been raptured by a piece like I have with this. \nThere's something about- I'm not very articulate but damn this is out of this world. I love it!"}, {"comment_id": "dku59od", "post_id": "6d9qy4", "comment": "lovely stuff\n"}, {"comment_id": "di12pka", "post_id": "6d9qy4", "comment": "Can you please upload the picture elsewhere in full quality? Reddit has made it 1500x1115 or so. \n\nEdit: Flickr, Drive, Dropbox"}, {"comment_id": "di146xm", "post_id": "6d9qy4", "comment": "The red lighting from the moon in the middle looks wrong, especially on the grass.  Was the rice lamp/bulb for that one red?  "}, {"comment_id": "di12tck", "post_id": "6d9qy4", "comment": "Very cool!"}, {"comment_id": "di12xy9", "post_id": "6d9qy4", "comment": "Excellent work and I love the video!!"}, {"comment_id": "di132bm", "post_id": "6d9qy4", "comment": "Very beautiful "}, {"comment_id": "di13x3z", "post_id": "6d9qy4", "comment": "I've never seen any of your work before today but man, what a treat. So much work and detail into a picture. I may 3D Print this in a Lithophane, if so I'll try to get you a picture of how it comes out. "}, {"comment_id": "di14fle", "post_id": "6d9qy4", "comment": "Love the picture, well done!!"}, {"comment_id": "di14vdx", "post_id": "6d9qy4", "comment": "It makes me think of Jeff Wall's work. I bet it would be stunning printed on (Plexi?)glass and backlit."}, {"comment_id": "di15a4o", "post_id": "6d9qy4", "comment": "Astonishingly beautiful , I am in love with the picture , hats off"}, {"comment_id": "di15hs6", "post_id": "6d9qy4", "comment": "1 thing is company logo, why not make it a full moon"}, {"comment_id": "di15lb8", "post_id": "6d9qy4", "comment": "I love it. Thanks for sharing."}, {"comment_id": "di15nwy", "post_id": "6d9qy4", "comment": "It's awesome! There are so many good photos/composites and everything I just love seeing imaginative things! Love it "}, {"comment_id": "di15rb3", "post_id": "6d9qy4", "comment": "Amazing! Loved the video!"}, {"comment_id": "di15x08", "post_id": "6d9qy4", "comment": "So beautiful!"}, {"comment_id": "di15ygc", "post_id": "6d9qy4", "comment": "Gorgeous."}, {"comment_id": "di1693e", "post_id": "6d9qy4", "comment": "Great work man. "}, {"comment_id": "di16m2x", "post_id": "6d9qy4", "comment": "I used to think I was good at photoshop..."}, {"comment_id": "di16u9g", "post_id": "6d9qy4", "comment": "I love this piece! It's not just creative, but really well done. The moons are clear and vivid, and you really got the ambient glow of them right. Very cool idea, a great intersection of photography and photoshop"}, {"comment_id": "di16ync", "post_id": "6d9qy4", "comment": "You are AMAZING. Please keep up what you're doing. "}, {"comment_id": "di172p6", "post_id": "6d9qy4", "comment": "Thank you for the behind the scenes video! The video confirms what I thought about the video at first glance: original, smart, and it tells a story.  Wonderful composition :)"}, {"comment_id": "di17ca7", "post_id": "6d9qy4", "comment": "Just one teeny tiny question: why is the company called Full Moon but the logo is a waxing crescent?"}, {"comment_id": "di17e32", "post_id": "6d9qy4", "comment": "This is just gorgeous! Would you sell it as a print?"}, {"comment_id": "di17g4m", "post_id": "6d9qy4", "comment": "An excellent idea. \nCreativity and technique are unbelievable.\n I really like it."}, {"comment_id": "di17gt2", "post_id": "6d9qy4", "comment": "Wow. Amazingly interesting composition "}, {"comment_id": "di17l77", "post_id": "6d9qy4", "comment": "Beautiful, but I can't get over the fact that the moon reflects light, doesn't glow on it's own. No more magic for me I guess."}, {"comment_id": "di17q83", "post_id": "6d9qy4", "comment": "Beautiful!\n\nThanks for sharing your process with us."}, {"comment_id": "di180k9", "post_id": "6d9qy4", "comment": "Do you know something sir?  You is one very creative dude.\n\nYou could probably get a job on Magrathea"}, {"comment_id": "di182ux", "post_id": "6d9qy4", "comment": "Woah! I thought when I first saw this it was a painting. Everything looked like a perfect moment caught in an artists eye. If this was sold as a portrait I would definitely buy it."}, {"comment_id": "di182vd", "post_id": "6d9qy4", "comment": "Very cool. Reminds me of the Pixar short. "}, {"comment_id": "di18ac1", "post_id": "6d9qy4", "comment": "Brings new meaning to the phrase I'd hang the moon for you."}, {"comment_id": "di18fu7", "post_id": "6d9qy4", "comment": "Sick work, the parallels are very unique and thought provoking."}, {"comment_id": "di18hwc", "post_id": "6d9qy4", "comment": "Your work is beautiful, and I'm a bit obsessed with the Moon, so you definitely have a new customer in me. Thanks for posting!"}, {"comment_id": "di18nid", "post_id": "6d9qy4", "comment": "Great stuff! Hope it makes you some good money with all that effort done for it!"}, {"comment_id": "di18qhb", "post_id": "6d9qy4", "comment": "Wow, even the BTS video is incredibly artistic. The attention to detail is astounding. Take my upvotes sir. "}, {"comment_id": "di18vu3", "post_id": "6d9qy4", "comment": "Erik finally I get to see you on reddit. Your work gets posted here a lot I try to link your site when I see it. \n\nJust wanna thank you your work is amazing and its inspired me to stick with photography full time. \n\nThanks so much for providing amazing work."}, {"comment_id": "di19094", "post_id": "6d9qy4", "comment": "Very whimsical. I love it. Great job!"}, {"comment_id": "di19392", "post_id": "6d9qy4", "comment": "very cool. added to my wallpaper collection. keep the creative photos coming please."}, {"comment_id": "di19562", "post_id": "6d9qy4", "comment": "This is so creative!"}, {"comment_id": "di198z3", "post_id": "6d9qy4", "comment": "Holy shit! This is amazing, absolutely love it. My wife and I both have our degrees in photography, and wow. I love it. "}, {"comment_id": "di19a0m", "post_id": "6d9qy4", "comment": "It's out of this world. Are your work purely photo composite based, or are there some matte painting involve? Like the castle in the sky photo, it so surreal it's painting like.\n\nIf r/lightening isn't so dead, it would've been a good home for this. Thanks for sharing. "}, {"comment_id": "di19ahj", "post_id": "6d9qy4", "comment": "Where's the moon in \"eclipse\" mode?!! Ah it's the red one! Well done!!!"}, {"comment_id": "di19d4z", "post_id": "6d9qy4", "comment": "This reminds me of the Pixar short about the family that cleans up the moon and stars. Very beautiful!"}, {"comment_id": "di19emt", "post_id": "6d9qy4", "comment": "I’ve been following your work for a year now, love what you do!"}, {"comment_id": "di19m90", "post_id": "6d9qy4", "comment": "Saw your stuff at Fotografiska a while back. Awesome stuff."}, {"comment_id": "di19opi", "post_id": "6d9qy4", "comment": "It looked like the talent was there and not layered in from a different shoot or entirely different image, that had to be difficult, congratulations on the finished piece.  Where is it headed now? I wonder."}, {"comment_id": "di19zko", "post_id": "6d9qy4", "comment": "Amazing and beautiful work! Love the behind the scenes video too! "}, {"comment_id": "di1a9le", "post_id": "6d9qy4", "comment": "Did you fall out of the truck bed? And this is amazing!!! Can't wait to see your next work!"}, {"comment_id": "di1adhg", "post_id": "6d9qy4", "comment": "Dude you became famous. "}, {"comment_id": "di1aekw", "post_id": "6d9qy4", "comment": "Searched for you on instagram and found out that the \"landfall\" gif is yours, love your work"}, {"comment_id": "di1ajfo", "post_id": "6d9qy4", "comment": "I like it a lot, but for some reason the lighting from the red moon looks a little bit off, or at least slightly inconsistent in how it lights up its surroundings. Like with the grass in front of it, in my mind it seems like it wouldn't color it red as evenly as it is in the photo. Then again I'm no colored light expert so who knows maybe it's just me\n\nOh and in regard to what I said about inconsistency, it seems like the bottom left moon is being lit up red slightly and is pretty far away from the red boye, but other than that and the leg of the person to the right the red seems to be very concentrated in a small area around the moon"}, {"comment_id": "di1amep", "post_id": "6d9qy4", "comment": "Erik just wanted to say what a huge fan of your work I am and how at peace your art makes me feel. Always excited to see new things from you."}, {"comment_id": "di1au6t", "post_id": "6d9qy4", "comment": "This is a great photo man"}, {"comment_id": "di1azlf", "post_id": "6d9qy4", "comment": "I've loved all of your pieces and this is a great new addition! Keep up the fantastic work!"}, {"comment_id": "di1b0pa", "post_id": "6d9qy4", "comment": "[My phone looks much better. thanks to you](https://m.imgur.com/gallery/xjyxW) "}, {"comment_id": "di1biot", "post_id": "6d9qy4", "comment": "Unfortunately, the logo for Full Moon Service is a crescent (non-full) moon...7/10 stars. \n\n\n9/10 with rice lamps"}, {"comment_id": "di1bl2v", "post_id": "6d9qy4", "comment": "Awesome, but I think youre gonna need a bigger van, mate."}, {"comment_id": "di1br7d", "post_id": "6d9qy4", "comment": "Have loved your stuff for a long time.  I've had your picture of the kid pouring out the boat into the water picture as my desktop for years.  Keep it up!"}, {"comment_id": "di1c0vd", "post_id": "6d9qy4", "comment": "This is one of the best paintings I've seen. I've been reading Italo Calvino and this really could be one of his stories. Great work. "}, {"comment_id": "di1c3yp", "post_id": "6d9qy4", "comment": "This is absolutely beautiful "}, {"comment_id": "di1cswv", "post_id": "6d9qy4", "comment": "Very cool"}, {"comment_id": "di1czkq", "post_id": "6d9qy4", "comment": "wow i'm in awe of your work! you should do an AMA!! "}, {"comment_id": "di1d2ml", "post_id": "6d9qy4", "comment": "Recognized the style immediately, checked the comments and sure enough it's good old Erik Johansson. You make some freakin awesome stuff,'keep it up!"}, {"comment_id": "di1dbhx", "post_id": "6d9qy4", "comment": "U dun gud"}, {"comment_id": "di1dco9", "post_id": "6d9qy4", "comment": "I think I follow you on instagram, because I just saw a post about this."}, {"comment_id": "di1ddop", "post_id": "6d9qy4", "comment": "Clever, and absolutely gorgeous."}, {"comment_id": "di1enqx", "post_id": "6d9qy4", "comment": "I can see pluto"}, {"comment_id": "di1ewpk", "post_id": "6d9qy4", "comment": "Wow! These are all very creative and beautiful"}, {"comment_id": "di1ezc4", "post_id": "6d9qy4", "comment": "Such a beautiful picture. Perfectly lovely. "}, {"comment_id": "di1f8em", "post_id": "6d9qy4", "comment": "I'm in love!"}, {"comment_id": "di1fet0", "post_id": "6d9qy4", "comment": "Why is the video in black and white?"}, {"comment_id": "di1fpca", "post_id": "6d9qy4", "comment": "I have seen your work before and I have to say I am always stunned by your art. I am especially inlove with the sky on the clothesline and the boat stranded past broken mirror. \n\nThe surrealist quality of your work gets me every single time!\n\nThank you for sharing your dreamscape!"}, {"comment_id": "di1fxm7", "post_id": "6d9qy4", "comment": "Just checked your website. Absolutely stunning artwork. Really nice."}, {"comment_id": "di1g5wh", "post_id": "6d9qy4", "comment": "Awesome work.!"}, {"comment_id": "di1g5wv", "post_id": "6d9qy4", "comment": "I love it, thank you for making my new laptop wallpaper!"}, {"comment_id": "di1g6zp", "post_id": "6d9qy4", "comment": "What's the point of using paying attractive models if their faces are barley shown?"}, {"comment_id": "di1g988", "post_id": "6d9qy4", "comment": "There's actually a full moon tonight"}, {"comment_id": "di1gjln", "post_id": "6d9qy4", "comment": "Wow, such a well-thought process for this photo. Really nice. Post saved."}, {"comment_id": "di1glhy", "post_id": "6d9qy4", "comment": "LOVE your work! It's so magical and impossible yet so beautiful and enchanting. You really have a gift. I hope you're famous one day! "}, {"comment_id": "di1gw3r", "post_id": "6d9qy4", "comment": "Awesome work!"}, {"comment_id": "di1haqh", "post_id": "6d9qy4", "comment": "I'd just like to point out that the way that woman is climbing that ladder gives me a lot of discomfort. Either way, still an amazing piece, do you ship these internationally?"}, {"comment_id": "di1htk1", "post_id": "6d9qy4", "comment": "Awesome portfolio! "}, {"comment_id": "di1iciu", "post_id": "6d9qy4", "comment": "Of course it escalated! I thought you were famous I've been following your work for years now! Great work! "}, {"comment_id": "di1ijuw", "post_id": "6d9qy4", "comment": "As someone who loves the night, the moon, and nature, this is one of my favourite photos ever."}, {"comment_id": "di1ir1h", "post_id": "6d9qy4", "comment": "Hey, what kind of computer power do you have to have in order to edit a 8272x6200 px image with multiple layers in Photoshop? I ask because I am interested in doing digital manipulation to turn into canvas art and my fairly decent computer basically just freezes up and the filesize gets to be over 2GB."}, {"comment_id": "di1jx2f", "post_id": "6d9qy4", "comment": "I've just started studying up more on photography lighting. You totally nailed it in this photo. The ring of light on the ground around the model on the ladder, the glow in the sky. The way the intensity of the light on the other model just slightly blows out some of the detail while keeping the color. Having just enough detail in the shadows to see the grass and the texture without losing the focal points. Just...hats off to you."}, {"comment_id": "di1jxmm", "post_id": "6d9qy4", "comment": "Why does the Full Moon Service have a partial moon logo? r/mildlyinfuriating "}, {"comment_id": "di1k3zf", "post_id": "6d9qy4", "comment": "Really great work. Love this piece. "}, {"comment_id": "di1k6hk", "post_id": "6d9qy4", "comment": "Hey! Last summer my mom came to visit me in Stockholm, and I wanted to show her something she never would've thought existed, let alone seek out herself. So I took her to your exhibition at Fotografiska and we really bonded over our shared appreciation of your work. Tack, älskar din konst!"}, {"comment_id": "di1kg9n", "post_id": "6d9qy4", "comment": "Sorry, decided to not watch the video so I can keep pretending that you really do have all those real mini moons on the ground. \n\nAmazing picture!"}, {"comment_id": "di1lw0c", "post_id": "6d9qy4", "comment": "Omg you where what made me aspire to learn photoshop and kickstarted my design career. I loved seeing your work and how creative it was. I haven't seen anything regarding you in such a long time!"}, {"comment_id": "di1ly2n", "post_id": "6d9qy4", "comment": "I love your work!! "}, {"comment_id": "di1mubb", "post_id": "6d9qy4", "comment": "Wow, this is really brilliant work. Kudos!"}, {"comment_id": "di1mz7p", "post_id": "6d9qy4", "comment": "Cumulus and thunder is great!"}, {"comment_id": "di1nw5p", "post_id": "6d9qy4", "comment": "Really great photos on your website. What is this style of art called? I like peices like this and rob gonsalves"}, {"comment_id": "di1oe2t", "post_id": "6d9qy4", "comment": "This is amazing! I love all the details that went into. I didn't even notice the \"Phases of the Moon\" poster in the van till I watched the video. Very clever."}, {"comment_id": "di1qwuh", "post_id": "6d9qy4", "comment": "Inspiring work!  How did you make the image seem 3D at the end of your BTS video?"}, {"comment_id": "di1sqkl", "post_id": "6d9qy4", "comment": "I love your work. Your imagination coming alive in your work is pure talent. That can't possibly be taught. I bookmarked your website to be able to return when I need a smile. Thanks for sharing ❤️"}, {"comment_id": "di1t8vi", "post_id": "6d9qy4", "comment": "Oh wow! I know your work! I remember the fish island image and also the grow your own road image. Your work is freaking amazing.. Many people have impressive photoshop skills, but your creative ideas really set you apart from the pack! Would love to know how you come up with your amazing ideas... Actually just watched one of your behind the scenes videos, and your photoshop skills are next level."}, {"comment_id": "di1tqg3", "post_id": "6d9qy4", "comment": "Incredible work, great job!"}, {"comment_id": "di1tuyt", "post_id": "6d9qy4", "comment": "I love your work. It's always so creative, you have a nice way of looking at the world. How long does it take you from idea to finish product? "}, {"comment_id": "di1twno", "post_id": "6d9qy4", "comment": "Excellent photo. Superb really. "}, {"comment_id": "di1uu01", "post_id": "6d9qy4", "comment": "Honestly one of the most creative displays of art ive seen in a while. Really good job. Even the behind the scenes is masterful. "}, {"comment_id": "di1vck9", "post_id": "6d9qy4", "comment": "Where'd you take the photo"}, {"comment_id": "di1w62s", "post_id": "6d9qy4", "comment": "These are amazing!! I noticed you do art exhibitions; do you, by any chance, have plans to come to the US for any? I am by no means an art expert, but I do love to appreciate any that appeals to me and would love to see these prints in person!"}, {"comment_id": "di22uno", "post_id": "6d9qy4", "comment": "Brilliant."}, {"comment_id": "di24lqy", "post_id": "6d9qy4", "comment": "I love your work. Very surreal/calming imagery. :)"}, {"comment_id": "di25otp", "post_id": "6d9qy4", "comment": "Do you have an instagram?"}, {"comment_id": "di26kop", "post_id": "6d9qy4", "comment": "Probably sound very ignorant but are you related to Johann Johannsson?"}, {"comment_id": "di26mho", "post_id": "6d9qy4", "comment": "I came to the comments ready to call out whoever because this was clearly Erik Johansson's work. Then I realised it was you haha love your work, you're an inspiration "}, {"comment_id": "di28bj4", "post_id": "6d9qy4", "comment": "I like it - how about adding some dark sides of the moon"}, {"comment_id": "di28en7", "post_id": "6d9qy4", "comment": "Nice."}, {"comment_id": "di292vg", "post_id": "6d9qy4", "comment": "Your work is incredible! "}, {"comment_id": "di29dc7", "post_id": "6d9qy4", "comment": "This is the most beautiful art I've ever seen, hooooly boy"}, {"comment_id": "di2bczj", "post_id": "6d9qy4", "comment": "Omg, you are THE Erik Johansson!"}, {"comment_id": "di2bhd2", "post_id": "6d9qy4", "comment": "Your behind the scenes videos are a work of art too. Love all the vertigo effects you keep on adding. "}, {"comment_id": "di2bxdz", "post_id": "6d9qy4", "comment": "> I brought out 7 rice lamps, 7 light bulbs, an electric generator, a car and two models out in a field.\n\nI love the result to bits, but can't help but be disappointed this setup didn't result in an intriguingly bizarre adult movie."}, {"comment_id": "di2enwq", "post_id": "6d9qy4", "comment": "Checked your website, beautiful artwork."}, {"comment_id": "di3m7d9", "post_id": "6d9qy4", "comment": "Your work is spectacular and your videos are fantastic. Mad respect."}, {"comment_id": "di5pkl7", "post_id": "6d9qy4", "comment": "Your work is absolutely beautiful, I love it. It reminds me a little of Robert Gonsalves. Imagine a night is my favourite collection of his works. "}, {"comment_id": "dmjl9lb", "post_id": "6d9qy4", "comment": "God damn man your work is super inspiring. Love it so rad! \n\n"}, {"comment_id": "di14ask", "post_id": "6d9qy4", "comment": "Why are all the moons on the ground?  As in, why did they take them all out of the van?  Did they fall out when they pulled out the one that they're hanging?  Or do they plan on hanging all those moons elsewhere above the field?  "}, {"comment_id": "di162ga", "post_id": "6d9qy4", "comment": "The red one really throws it all off. The glow seems too vibrant for the phase. "}, {"comment_id": "di18wze", "post_id": "6d9qy4", "comment": "This photo is what Flat Earthers actually believe."}, {"comment_id": "di19yxo", "post_id": "6d9qy4", "comment": "Why did I get a push notification "}, {"comment_id": "di1ab0i", "post_id": "6d9qy4", "comment": "How the fuck does this take 8 months? "}, {"comment_id": "di1cmoe", "post_id": "6d9qy4", "comment": "That is really awesome.  I like your imagination.  \n\nIt is the problem with Europe, though.  You people drive those tiny vans.  You cannot fit all of those moons into it.  \n\nIt is why we Americans drive such large vehicles.  "}, {"comment_id": "di11adv", "post_id": "6d9qy4", "comment": "Erik Johansson!\n\nI KNEW this was your work as soon as I saw it. Fantastic piece as always. \n\nI enjoy your process from building the scenes to spending hours perfecting the digital manipulation. Your attention to detail is astounding, and I love the surreal and fantastical scenes. I actually cited your work as inspiration when I entered my school's Photo/Media dept. last year.\n\nPlease don't stop making art ! :) \n\n"}, {"comment_id": "di12d3p", "post_id": "6d9qy4", "comment": "Thank you! I'll never stop, already working on the.m next one :)"}, {"comment_id": "di0zr65", "post_id": "6d9qy4", "comment": "This is so cute. It reminds me of the book I Spy A Book of Picture Riddles!"}, {"comment_id": "di142jc", "post_id": "6d9qy4", "comment": "It kinda reminds me of the sky in the real world "}, {"comment_id": "di123e8", "post_id": "6d9qy4", "comment": "totally unrealistic.\n\nall of those moons could never fit in that van. :)"}, {"comment_id": "di12ok6", "post_id": "6d9qy4", "comment": "Moons are made of soft cheese thus making them squishy, which is why they're able to fit in the van.\n\n/r/ExplainLikeImFive can possibly shed some moonlight on this."}, {"comment_id": "di14cga", "post_id": "6d9qy4", "comment": "But why were they all on the ground to begin with?  Did they roll out when the door was opened?  Is that a pick-up or drop-off point?  "}, {"comment_id": "di14tik", "post_id": "6d9qy4", "comment": "That's no moon.."}, {"comment_id": "di12crq", "post_id": "6d9qy4", "comment": "I think those moons are not as solid as you imagine, that explains how they fit inside.Right ? 🤔"}, {"comment_id": "di13qlw", "post_id": "6d9qy4", "comment": "Wrong!!! The Moon is flat. "}, {"comment_id": "di1754i", "post_id": "6d9qy4", "comment": "Not with that attitude!"}, {"comment_id": "di17jo5", "post_id": "6d9qy4", "comment": "The two moon technicians are not wearing helmets, gloves, goggles, etc ... total lack of PPE. The one monkeying around beside the van needs to be holding the ladder. You never let a new moon touch dirt let alone SIT IN A FIELD! The picture is fine but OSHA is about to pull Full Moon Service's license to operate until this whole mess is cleaned up."}, {"comment_id": "di1cm11", "post_id": "6d9qy4", "comment": "Came to say this! Brilliant work otherwise!"}, {"comment_id": "di17gt8", "post_id": "6d9qy4", "comment": "Flat Earthers will post this on Twitter in 3...2..."}, {"comment_id": "di1hrxu", "post_id": "6d9qy4", "comment": "You dropped this 1"}, {"comment_id": "di12li4", "post_id": "6d9qy4", "comment": "I really love the inclusion of lunar phases."}, {"comment_id": "di15ikk", "post_id": "6d9qy4", "comment": "Even got a lunar eclipse moon in there"}, {"comment_id": "di13pmr", "post_id": "6d9qy4", "comment": "title says 8272x6200 but reddit says 1500x1125?\n\nAny where I can get this at higher res that 1500x1125, preferably 2560x1440?\n\nAmazing picture and I would like it as my desktop"}, {"comment_id": "di1d2ox", "post_id": "6d9qy4", "comment": "Sorry I'm not so good at Reddit... its original dimensions are 8272x6200 but this is only 1500x yes. The higher res versions are only going for print"}, {"comment_id": "di16nqu", "post_id": "6d9qy4", "comment": "This could help: http://www.erikjohanssonphoto.com/full-moon-service/"}, {"comment_id": "di16hjx", "post_id": "6d9qy4", "comment": "yeah, i was expecting super high quality when I opened it."}, {"comment_id": "di16evj", "post_id": "6d9qy4", "comment": "yes please help us photo editing genius'!!!"}, {"comment_id": "di1bb71", "post_id": "6d9qy4", "comment": "He might have used the Reddit App, shit downscales everything. "}, {"comment_id": "di1d0i2", "post_id": "6d9qy4", "comment": "Used it as my phone wallpaper and twas like....OMG!!"}, {"comment_id": "di175ui", "post_id": "6d9qy4", "comment": "This looks like it should be a Pink Floyd album cover."}, {"comment_id": "di1cl6i", "post_id": "6d9qy4", "comment": "r/fakealbumcovers "}, {"comment_id": "di1dysh", "post_id": "6d9qy4", "comment": "More like the cover to Roger Daltrey *Under a Raging Moon*."}, {"comment_id": "di186it", "post_id": "6d9qy4", "comment": "https://youtu.be/7jMlFXouPk8?t=317"}, {"comment_id": "di1ahyv", "post_id": "6d9qy4", "comment": "That or Dream Theater"}, {"comment_id": "di16yvr", "post_id": "6d9qy4", "comment": "This is art. This is what I'm talkin about. I'd give you way more fake internet points if I could! Well executed, original idea!"}, {"comment_id": "di14ql7", "post_id": "6d9qy4", "comment": "Reminds me of the pixar short \"La Luna\", wonderful piece OP! Keep up the great work!"}, {"comment_id": "di18dcp", "post_id": "6d9qy4", "comment": "Was gonna say!"}, {"comment_id": "di175am", "post_id": "6d9qy4", "comment": "Anyone try calling that number on the truck yet?"}, {"comment_id": "di161n1", "post_id": "6d9qy4", "comment": "This is incredible. Normally I don't like edited things, but this is truly beautiful. I like the vibe it gives. Great work and patience!"}, {"comment_id": "di11bub", "post_id": "6d9qy4", "comment": "This is amazing work. I love the originality."}, {"comment_id": "di145le", "post_id": "6d9qy4", "comment": "I'm gonna be that guy and point out that the company is called 'full moon service' and the logo is a crescent moon.  Just sayin.  Fucking amazing photo though."}, {"comment_id": "di158mg", "post_id": "6d9qy4", "comment": "Because it's a \"full\" moon-service, not a full-moon service"}, {"comment_id": "di12jg1", "post_id": "6d9qy4", "comment": "I can't explain why this gives me such a relaxed feeling"}, {"comment_id": "di15cl9", "post_id": "6d9qy4", "comment": "Tel +420... nice one, OP. \nAlso great picture Overall 😊"}, {"comment_id": "di155bb", "post_id": "6d9qy4", "comment": "You can buy his prints here:\nhttp://www.erikjohanssonphoto.com/\n\nSupport the artist!"}, {"comment_id": "di11vna", "post_id": "6d9qy4", "comment": "Is there anyone who can scale this for mobile? I'd love to use this as my phone wallpaper, if op is okay with it :)"}, {"comment_id": "di13dfs", "post_id": "6d9qy4", "comment": "This is amateur. You need to lift with your knees! Those moons are heavy."}, {"comment_id": "di140ne", "post_id": "6d9qy4", "comment": "[Reminds me of this](https://www.youtube.com/watch?v=1jDsBQytINU)"}, {"comment_id": "di1bmy7", "post_id": "6d9qy4", "comment": "Exactly my first thought!\n"}, {"comment_id": "di143m6", "post_id": "6d9qy4", "comment": "It bothers me that all of those balls absolutely do not fit in that van.\n\nYes, in a photo about the moon being installed by a man on a ladder."}, {"comment_id": "di14e1x", "post_id": "6d9qy4", "comment": "Maybe the dim ones are being exchanged for the bright ones. It's possible that not all of the moons need to fit in the van at once."}, {"comment_id": "di15nky", "post_id": "6d9qy4", "comment": "Title says 8272 x 6200, but I only see 1500 x 1125. Am I doing something wrong?"}, {"comment_id": "di1d71t", "post_id": "6d9qy4", "comment": "Yes I got it wrong in the way that I though you should post the original dimensions, like you would do if you post a photo of a artwork you painted on a 10x10\" canvas but in this case the original is 8272px but the one I uploaded is 1500px"}, {"comment_id": "di1a86d", "post_id": "6d9qy4", "comment": "That's most likely the version he has for sale on his site. This is his job, so it would be extremely counterproductive to release 8 months of work for free."}, {"comment_id": "di17cys", "post_id": "6d9qy4", "comment": "NASA according to flat earthers"}, {"comment_id": "di17g65", "post_id": "6d9qy4", "comment": "Wow. Not seen anything like this before. Thank you for taking the time to make it. You nailed it. Thank you for sharing. "}, {"comment_id": "di17kvo", "post_id": "6d9qy4", "comment": "I'm blown away.  This is incredible.  Very creative, and well done.  Pro af."}, {"comment_id": "di17ld9", "post_id": "6d9qy4", "comment": "This is beautiful. Very calming."}, {"comment_id": "di1a0vt", "post_id": "6d9qy4", "comment": "Somewhere, there is a flat earther who saw this and thought it was proof that they were right."}, {"comment_id": "di1c1wm", "post_id": "6d9qy4", "comment": "From one photographer to another, I'd just like to say I can appreciate the tremendous amount of time and energy you must have put in to making this picture a reality. It's awesome."}, {"comment_id": "di1ciki", "post_id": "6d9qy4", "comment": "The idea behind this is really great. Impressive execution. Love this piece. "}, {"comment_id": "di1cjfe", "post_id": "6d9qy4", "comment": "I don't know why but this reminds me of that scene in Bruce Almighty where God (Morgan Freeman) replaces the lightbulb. This is beautiful work tho!!!"}, {"comment_id": "di1ffb6", "post_id": "6d9qy4", "comment": "Do you mean Photo \"Moon\"ipulation ? "}, {"comment_id": "di1t76i", "post_id": "6d9qy4", "comment": "I would have liked if the vehicle was lager to fit the various moons. All the moons will not fit in the van. Maybe a moving truck would work better. But, the picture is great outside of that.\n"}, {"comment_id": "di127kx", "post_id": "6d9qy4", "comment": "This is stupid. You can't get whole moons in a van!"}, {"comment_id": "di13yvd", "post_id": "6d9qy4", "comment": "That's no Moon!\n"}, {"comment_id": "di191r6", "post_id": "6d9qy4", "comment": "What is this? A moon for ants?"}, {"comment_id": "di11l4j", "post_id": "6d9qy4", "comment": "This is incredible work! Thank you for sharing. "}, {"comment_id": "di11u3j", "post_id": "6d9qy4", "comment": "I wish I could buy a moon like that"}, {"comment_id": "di12sss", "post_id": "6d9qy4", "comment": "+1 for the details on the side of the truck."}, {"comment_id": "di13eyt", "post_id": "6d9qy4", "comment": "Nicely done! But I bet they called and said they'd be out to install your  moons between 10-4 but didn't show up until around 7:30."}, {"comment_id": "di14dn5", "post_id": "6d9qy4", "comment": "Fake. The moons aren't flat."}, {"comment_id": "di15lp6", "post_id": "6d9qy4", "comment": "Half expected them to not be wearing pants, to get the full moon effect."}, {"comment_id": "di178z2", "post_id": "6d9qy4", "comment": "if i had a house and money would buy this to hang on my wall."}, {"comment_id": "di17anx", "post_id": "6d9qy4", "comment": "Is the backgroind an actual location? What a perfect night to do this and the lighting is top notch. Also, the grass adds a very nice touch. Well done "}, {"comment_id": "di1a910", "post_id": "6d9qy4", "comment": "These are the types of pictures that can flourish children's imaginations."}, {"comment_id": "di1bzue", "post_id": "6d9qy4", "comment": "Wow, a lot of work and little details are put into this. Incredible job!! "}, {"comment_id": "di1c61g", "post_id": "6d9qy4", "comment": "I've been following your work for years, this one's beautiful!!!!"}, {"comment_id": "di1cn8o", "post_id": "6d9qy4", "comment": "Art is the only good thing about humanity. "}, {"comment_id": "di11qxt", "post_id": "6d9qy4", "comment": "Can I save this as my wallpaper?"}, {"comment_id": "di11tcu", "post_id": "6d9qy4", "comment": "No"}, {"comment_id": "di12bic", "post_id": "6d9qy4", "comment": "Looks like you've gathered the dragonballs. "}, {"comment_id": "di12fhy", "post_id": "6d9qy4", "comment": "I want to buy it and frame it. Will it be possible?"}, {"comment_id": "di141d1", "post_id": "6d9qy4", "comment": "[deleted]"}, {"comment_id": "di12pfn", "post_id": "6d9qy4", "comment": "Wow I love this. Just made it my desktop pic at work. You're awesome."}, {"comment_id": "di1381s", "post_id": "6d9qy4", "comment": "This would be an excellent Image Prompt over at r/writingprompts!"}, {"comment_id": "ei7rlnt", "post_id": "azgs1n", "comment": "...took me awhile to see the piano"}, {"comment_id": "ei83lng", "post_id": "azgs1n", "comment": "I didn't see it until a read the comments. Blew my mind, especially since I had already watched the gif like 80 times."}, {"comment_id": "ei7o67k", "post_id": "azgs1n", "comment": "took me a while to notice the guy with his giant piano on the train. also stones throw rep!"}, {"comment_id": "ei7q3j4", "post_id": "azgs1n", "comment": "I think this has something to do with “kiefer” he is a hip hop producer under the label stonsthrow. Anyway , his music is very chill. Dilla vibes "}, {"comment_id": "ei80yjq", "post_id": "azgs1n", "comment": "Dude same, there’s so much going on in each loop to look at. "}, {"comment_id": "ei81imp", "post_id": "azgs1n", "comment": "Oh shit I thought it was a guy sleeping"}, {"comment_id": "ei869pw", "post_id": "azgs1n", "comment": "I initially thought he was nodding off and fell asleep."}, {"comment_id": "ei88jkc", "post_id": "azgs1n", "comment": "He’s wearing a lakers jersey! This is fucking incredible!"}, {"comment_id": "ei8xtg9", "post_id": "azgs1n", "comment": "Wow! Me2"}, {"comment_id": "ei7mb0r", "post_id": "azgs1n", "comment": "Something is very peaceful about this, maybe it’s the gentle swaying. \n\nBeautiful. "}, {"comment_id": "ei7ts24", "post_id": "azgs1n", "comment": "Thanks!"}, {"comment_id": "ei7wzdc", "post_id": "azgs1n", "comment": "Its the piano"}, {"comment_id": "ei7zgrv", "post_id": "azgs1n", "comment": "Normally I would agree, but I am so hungover right now that it is making me nauseous... Lol "}, {"comment_id": "ei80el7", "post_id": "azgs1n", "comment": "It’s the Hip-hop lofi study relaxing music live stream you’re hearing"}, {"comment_id": "ei82jom", "post_id": "azgs1n", "comment": "Such a comfy post, beautiful! "}, {"comment_id": "ei890os", "post_id": "azgs1n", "comment": "It feels very /r/SlowTV"}, {"comment_id": "ei8qfrs", "post_id": "azgs1n", "comment": "Pretty cool, OP"}, {"comment_id": "ei8v3qd", "post_id": "azgs1n", "comment": "I was thinking that, too. I could watch this for a long time, it's satisfying and peaceful. 🙂"}, {"comment_id": "ei94j02", "post_id": "azgs1n", "comment": "There is a lit cigarette on board the train "}, {"comment_id": "ei8atui", "post_id": "azgs1n", "comment": "and the /r/raining "}, {"comment_id": "ei8aw2y", "post_id": "azgs1n", "comment": "This is my exact sentiment. It’s super relaxing, so much to look at, and makes you start to wonder who all of these people are and what are their stories.\n\nI actually think this scene could inspire a tv series or movie. There is just so much going on, and while completely ordinary, also very unique."}, {"comment_id": "ei8dmub", "post_id": "azgs1n", "comment": "Came here to say exactly this !!"}, {"comment_id": "ei8f5mf", "post_id": "azgs1n", "comment": "I need a sub for these short loop gif arts. Ive seen a ton before in an pixel art style"}, {"comment_id": "ei8uw7b", "post_id": "azgs1n", "comment": "You must have never ridden a city bus in North america before."}, {"comment_id": "ei9gsyt", "post_id": "azgs1n", "comment": "Makes want to listen to some lofi!"}, {"comment_id": "ei9u168", "post_id": "azgs1n", "comment": "Jesus haploid Christ I didn’t even notice at first, I was just like, why is that one dude nodding on the subway..."}, {"comment_id": "ei7qal3", "post_id": "azgs1n", "comment": "[deleted]"}, {"comment_id": "ei888ab", "post_id": "azgs1n", "comment": "[removed]"}, {"comment_id": "ei7tp8g", "post_id": "azgs1n", "comment": "Originally created for the track “Cute” by Kiefer, released on Stones Throw Records"}, {"comment_id": "ei8fuoo", "post_id": "azgs1n", "comment": "This is so cool, beautiful style man 👊🏼👊🏼👊🏼"}, {"comment_id": "ei93xx0", "post_id": "azgs1n", "comment": "My friend I am obsessing over this... It's peaceful, it is really good representation of the physics of being on a train...and somehow the fact I stared at it for a minute before realizing there was a piano made it that much cooler.\n\nIt's like the pianist is just as preoccupied as the rest of the riders, but is a little more pensive. It gives the feeling that the riders are just cool with him doing his thing on the piano. It's a casual scene with an oddity that interacts so well that it doesn't effect the peaceful feeling of the rest of the scene if it was missing. In doing so, you've made something typically abstract/strange feel normal. \n\nYou did a great job capturing how the pianist was feeling out his music... I don't need to hear music to know he is feeling out a heartfelt song. I've seen that type of head nodding before to know it as a kind, deep passion for what is being expressed through what is played. "}, {"comment_id": "ei8nmjg", "post_id": "azgs1n", "comment": "I saw this on insta via Juxtapose! I reposted with credit immediately. This is absolutely beautiful."}, {"comment_id": "ei7p7vx", "post_id": "azgs1n", "comment": "This is so cool and original. "}, {"comment_id": "ei7zosc", "post_id": "azgs1n", "comment": "I would love a game in this style!"}, {"comment_id": "ei83r3i", "post_id": "azgs1n", "comment": "This style is really getting perfected in recent times. I don’t know when it came about but i’ve been seeing amateur versions of this type of stuff for a while. This one shows all that hard work that the community has done culminating into something beautiful. "}, {"comment_id": "ei8j1pc", "post_id": "azgs1n", "comment": "The 2010’s in one gif"}, {"comment_id": "ei7pjx8", "post_id": "azgs1n", "comment": "*\"The next stop is Christopher Street.* **STAND CLEAR OF THE CLOSING DOORS PLEASE!**\""}, {"comment_id": "ei86pl1", "post_id": "azgs1n", "comment": "John Mulaney?"}, {"comment_id": "ei86da3", "post_id": "azgs1n", "comment": "ALL PASSENGERS MUST HAVE VALID TICKET PASS OR TRANSFER BEFORE BOARDING. **THANK YOU FOR RIDING METROLINK. CENTRAL WEST END STATION NEXT STOP.**"}, {"comment_id": "ei8ao55", "post_id": "azgs1n", "comment": "Is the dvc in your name referring to diablo valley college?"}, {"comment_id": "ei8o57h", "post_id": "azgs1n", "comment": "With those seats this feels like the LA subway."}, {"comment_id": "ei9yvcr", "post_id": "azgs1n", "comment": "DO NOT CHARGE THE DOORS"}, {"comment_id": "ei7qnpc", "post_id": "azgs1n", "comment": "Source - masonlondon on socials. Also a longer version with music on there 👍."}, {"comment_id": "ei7ulpl", "post_id": "azgs1n", "comment": "This is great. I kept thinking “wish I could hear what he’s playing.” Nice work. "}, {"comment_id": "ei7trds", "post_id": "azgs1n", "comment": "What's socials? Can't find it :/"}, {"comment_id": "ei7xrvc", "post_id": "azgs1n", "comment": "Kiefer! Loved this art work almost as much as the song. 🙂"}, {"comment_id": "ei84wlq", "post_id": "azgs1n", "comment": "This is amazing! What software did you use to make it?"}, {"comment_id": "ei7o8bp", "post_id": "azgs1n", "comment": "Are subway cars with pianos in them a thing?\n\nNot criticizing, just curious - A micropark near where I work has a publicly accessible piano in it as some sort of \"music for the masses\" installation.  Figured maybe this is an actual trend I'm not aware of."}, {"comment_id": "ei7p6uy", "post_id": "azgs1n", "comment": "They are not a thing. Also smoking is usually forbidden."}, {"comment_id": "ei8a3sz", "post_id": "azgs1n", "comment": "Not pianos. But they do have public saxophones on the trains in NYC. You can pick them up, put your mouth on them and play to your heart’s content. They’re a very big hit.\n\nI almost threw up while typing that."}, {"comment_id": "ei8n80w", "post_id": "azgs1n", "comment": "In the Netherlands, large train stations have a piano you can play on during delays. Oh and we have homeless people playing the guitar"}, {"comment_id": "ei7r78x", "post_id": "azgs1n", "comment": "“Are subway cars with pianos in them a thing?”\n\nHahahahaha. I guess you’ve never ridden a NYC subway."}, {"comment_id": "ei7plt8", "post_id": "azgs1n", "comment": "Holy namebrands, everyone in this car is rich!"}, {"comment_id": "ei88u4u", "post_id": "azgs1n", "comment": "I thought I was on /r/streetwear or someshit."}, {"comment_id": "ei86ch4", "post_id": "azgs1n", "comment": "Seriously. CDG X Supreme hoodie, Gucci, and a piano as an accessory. Big money for sure. "}, {"comment_id": "ei8cixv", "post_id": "azgs1n", "comment": "On first glance, I thought this was about how these commuters are spending big on clothing, yet are not able to afford alternate forms of transportation. Love the art!"}, {"comment_id": "ei7rlp2", "post_id": "azgs1n", "comment": "It took me longer than it should have to notice he was playing a piano."}, {"comment_id": "ei7qcrn", "post_id": "azgs1n", "comment": "I LOVE that ONLY made it into this. You def form NYC  huh? "}, {"comment_id": "ei86frn", "post_id": "azgs1n", "comment": "Surprised me too. That’s OG streetwear stuff"}, {"comment_id": "ei7tl88", "post_id": "azgs1n", "comment": "Is there a subreddit just for gifs like this?"}, {"comment_id": "ei8czv3", "post_id": "azgs1n", "comment": "I would like to know this as well. I would also like to know what this style of gif is called. "}, {"comment_id": "ei7rrg4", "post_id": "azgs1n", "comment": "Ooo new keifer music ?!  I’m on it ,good looking lol"}, {"comment_id": "ei7vibb", "post_id": "azgs1n", "comment": "Esi Edugyan Washington Black\n\nthat's the title of the book."}, {"comment_id": "ei7w69o", "post_id": "azgs1n", "comment": "Giller Prize winner :) go Canada!"}, {"comment_id": "eib4tir", "post_id": "azgs1n", "comment": "Thank you!!!"}, {"comment_id": "ei7z2py", "post_id": "azgs1n", "comment": "Took me forever to realize that the sleeping guy in the brown coat is wearing a hat and not, in fact, just a really really black-toned man only smiling in the shadows of his hood with his two front teeth."}, {"comment_id": "ei7vnt6", "post_id": "azgs1n", "comment": "Im curious what programs were used to make this"}, {"comment_id": "ei8by2p", "post_id": "azgs1n", "comment": "Hey, I used illustrator for the drawings and to draw frames of key frame animation, adobe animate to compile and export key frame animations and after effects to put it all together and add texture and effects."}, {"comment_id": "ei86ok3", "post_id": "azgs1n", "comment": "Commented so I can find out too"}, {"comment_id": "ei7x93j", "post_id": "azgs1n", "comment": "Awesome! Honest question: aren’t subways underground? How can it be raining in the subway? I’ve never been on one..."}, {"comment_id": "ei80gw4", "post_id": "azgs1n", "comment": "most of the lines are underground, but in Brooklyn and Queens there's a few that are raised over the streets or cross over a bridge "}, {"comment_id": "ei80fef", "post_id": "azgs1n", "comment": "This looks like it is modeled after LA metro. Sections outside of the city and entering into the city are above ground."}, {"comment_id": "ei88gjj", "post_id": "azgs1n", "comment": "55% of the London Underground is above ground."}, {"comment_id": "ei8qxmp", "post_id": "azgs1n", "comment": "Vancouver’s transit system, the Skytrain, is 95% above ground. \n\nI think most subway systems have a large above ground system. "}, {"comment_id": "ei7t4m6", "post_id": "azgs1n", "comment": "Do For Love by 2pac immediately started playing in my head"}, {"comment_id": "ei7yo0o", "post_id": "azgs1n", "comment": "[I love Kiefer](https://youtu.be/PejSowt84n8)"}, {"comment_id": "ei7xj4u", "post_id": "azgs1n", "comment": "This needs some lo fi chill hop"}, {"comment_id": "ei7x6ca", "post_id": "azgs1n", "comment": "R/streetwear might like this"}, {"comment_id": "ei86por", "post_id": "azgs1n", "comment": "nah way too much color and taste, replace everything with bland earthtoned oversized clothing and you're good"}, {"comment_id": "ei7zokb", "post_id": "azgs1n", "comment": "So much Designer especially for a bus trip lol. Great post tho! I love it. \n\n\nEdit: holy cow I just noticed the piano!"}, {"comment_id": "ei7mzxk", "post_id": "azgs1n", "comment": "Where are the pan handling crackheads and performers screaming at you? And where is that one guy who is trying to fight some one specific person for no reason? Also no piss covered hobo sleeping... beautifully done but very unrealistic."}, {"comment_id": "ei7o9e1", "post_id": "azgs1n", "comment": "Yup and no woman yelling on speaker phone or middle schoolers screaming."}, {"comment_id": "ei8fimf", "post_id": "azgs1n", "comment": "I was expecting all comments to be like this."}, {"comment_id": "ei7q8w3", "post_id": "azgs1n", "comment": "Gucci but no money for uber..."}, {"comment_id": "ei8k7se", "post_id": "azgs1n", "comment": "Just because he’s on public transportation doesn’t mean he can’t afford an Uber. One of the ladies is wearing an expensive hoodie as well"}, {"comment_id": "ei85jkr", "post_id": "azgs1n", "comment": "That is pretty much how the ghetto operates "}, {"comment_id": "ei82twy", "post_id": "azgs1n", "comment": "He’s flexing."}, {"comment_id": "ei7rdfo", "post_id": "azgs1n", "comment": "What did Harden get? Looks like takeout\n"}, {"comment_id": "ei7x7ag", "post_id": "azgs1n", "comment": "Damn, it's raining underground again. Hey conductor, watch out for stalagmites."}, {"comment_id": "ei80a8r", "post_id": "azgs1n", "comment": "You can almost hear Lo-Fi beats playing."}, {"comment_id": "ei8a6ts", "post_id": "azgs1n", "comment": "Anime hip hop 24/7 study beats to be exact"}, {"comment_id": "ei83vuj", "post_id": "azgs1n", "comment": "I could see this gif looping on one of those lofi beats to relax/study to youtube streams and i love it."}, {"comment_id": "ei8a8q6", "post_id": "azgs1n", "comment": "Why is everyone a hypebeast"}, {"comment_id": "ei8emw8", "post_id": "azgs1n", "comment": "Great book guy standing is reading. Washington Black Esi Edugyan"}, {"comment_id": "ei7m9ls", "post_id": "azgs1n", "comment": "I will say it... PLEASE MAKE THIS A GAME"}, {"comment_id": "ei7pqdk", "post_id": "azgs1n", "comment": "It’s called “Outside.” The subway level is pay-to-play though"}, {"comment_id": "ei8fh9g", "post_id": "azgs1n", "comment": "What? Make this picture into a game? Do you mean someone should make a game with this art style?"}, {"comment_id": "ei82nf9", "post_id": "azgs1n", "comment": "But what would you do in the game?"}, {"comment_id": "ei7rn3t", "post_id": "azgs1n", "comment": "Love the casio VL-tone ad in the left corner"}, {"comment_id": "ei7wsw8", "post_id": "azgs1n", "comment": "What did you use to make this? "}, {"comment_id": "ei7x653", "post_id": "azgs1n", "comment": "Wow! How long did it take for you?"}, {"comment_id": "ei7yzfw", "post_id": "azgs1n", "comment": "I love this profoundly! So beautiful. How was it made?"}, {"comment_id": "ei82r55", "post_id": "azgs1n", "comment": "Drawstrings on the cdg hoodie should be grey not white :)"}, {"comment_id": "ei82tzz", "post_id": "azgs1n", "comment": "You should post this to /r/AestheticRain!"}, {"comment_id": "ei86a96", "post_id": "azgs1n", "comment": "If SEPTA had a piano car, I would ride every day. "}, {"comment_id": "ei8ta1p", "post_id": "azgs1n", "comment": "I can’t tell you how peaceful reading is on a long train ride, especially after smoking a little ganja before you hop on it"}, {"comment_id": "ei8vuim", "post_id": "azgs1n", "comment": "How the hell you get a piano on a train"}, {"comment_id": "ei8x6cs", "post_id": "azgs1n", "comment": "A public piano on a train?\n\nNice."}, {"comment_id": "ei9lfwb", "post_id": "azgs1n", "comment": "I feel like I need to walk around and speak to them all, get their backstories and see if they have any useful info for me."}, {"comment_id": "ei9lnup", "post_id": "azgs1n", "comment": "Why does the lady on the right keep staring at me?  What does she know!? "}, {"comment_id": "ei9umts", "post_id": "azgs1n", "comment": "This is like the background video you might see on those low-fi hip hop channels which stream live no youtube.  Such as ambition, chill-hop, etc."}, {"comment_id": "ei7wjbe", "post_id": "azgs1n", "comment": "[deleted]"}, {"comment_id": "ei825fc", "post_id": "azgs1n", "comment": "If you’re wearing Gucci you want to take the train to stunt on fools. "}, {"comment_id": "ei85mwh", "post_id": "azgs1n", "comment": "I mean in big cities it’s just the easiest way to get around. "}, {"comment_id": "ei831d1", "post_id": "azgs1n", "comment": "Gucci, Supreme, and Patagonia. Some expensive ass brands on that train."}, {"comment_id": "ei839j3", "post_id": "azgs1n", "comment": "The supreme x CDG one the girl is wearing is worth way more"}, {"comment_id": "ei82dch", "post_id": "azgs1n", "comment": "Why not?"}, {"comment_id": "ei85aie", "post_id": "azgs1n", "comment": "What about the Supreme X CDG Sweater the girl is wearing, I hope it's a fake I wouldn't trust wearing that on the subway"}, {"comment_id": "ei7r0wb", "post_id": "azgs1n", "comment": "I really like the style this was animated in. I would however not like to be in that train, it's a mess. "}, {"comment_id": "ei7srl6", "post_id": "azgs1n", "comment": "*Loves the artwork and notices a couple of people standing up* \"They're standing on a NY train without holding a pole? Ballsy.\""}, {"comment_id": "ei7rmsi", "post_id": "azgs1n", "comment": "Every old subway, bus, and bowling alley floor has that blue confetti fabric. It was necessary to operate a business in the 90's"}, {"comment_id": "ei8q8vh", "post_id": "azgs1n", "comment": "That’s the first thing I noticed as well - I’ve seen that fabric in multiple places."}, {"comment_id": "eibpfw0", "post_id": "azgs1n", "comment": "The LA Metro (which this GIF appears to be based on) used [those seats](https://i.imgur.com/gUi4hRU.jpg) until pretty recently."}, {"comment_id": "ei7sub5", "post_id": "azgs1n", "comment": "This is gorgeous! Nice work, OP."}, {"comment_id": "ei7u0nw", "post_id": "azgs1n", "comment": "This is beautiful, full of character! "}, {"comment_id": "dfsur2o", "post_id": "6393x4", "comment": "Hello! I hope everyone is well. This is just a reminder to be civil! Jesus folks. Parts of this thread have gone full dumpster fire.\n\n>######8. Be respectful and stay on topic\nBigotry, slapfights, and off topic comments will not be tolerated.\n\nViolating the rules will result in deportation!"}, {"comment_id": "dfsfbcf", "post_id": "6393x4", "comment": "Oh man, good job Runescape guys"}, {"comment_id": "dft7prb", "post_id": "6393x4", "comment": "We sit down doing the most repetitive, menial shit for hours on end every day, *and we find that fun.* \n\nMaintaining a little disconnected message in the corner was a walk in the park for us :P   "}, {"comment_id": "dfsnwtb", "post_id": "6393x4", "comment": "Gotta love the servers being hacked\n"}, {"comment_id": "dfsfug9", "post_id": "6393x4", "comment": "I like benders tranformation to all his forms \n\"bite my shiny metal ass\"\n\"bite my golden glorious ass\"\n\"bite my wooden splitery ass\" \nit's perfect."}, {"comment_id": "dfsmmcv", "post_id": "6393x4", "comment": "At one point it was \"bite my shit ass\"."}, {"comment_id": "dfsoi1h", "post_id": "6393x4", "comment": "That and Mario's transition to Luigi, wario, waluigi and then finally Mario "}, {"comment_id": "dfspfyg", "post_id": "6393x4", "comment": "Where is that?\n\nEdit: lol, I thought you meant John Bender from *The Breakfast Club*"}, {"comment_id": "dfsfiul", "post_id": "6393x4", "comment": "Shoutout Mona Lisa's middle finger "}, {"comment_id": "dfsn1vr", "post_id": "6393x4", "comment": "Mona Lisa the Terminator waving a middle finger at you. :)))"}, {"comment_id": "dfsb6bt", "post_id": "6393x4", "comment": "Hey, I made a few of those dots!"}, {"comment_id": "dfse1h5", "post_id": "6393x4", "comment": "I helped coordinate the beatles yellow submarine ^^\n"}, {"comment_id": "dfser8k", "post_id": "6393x4", "comment": "Most of mine were to help make Bender gray again. Bite my shiny metal ass!"}, {"comment_id": "dfsclri", "post_id": "6393x4", "comment": "Which ones exactly? proof or it didn't happen!"}, {"comment_id": "dfsee5t", "post_id": "6393x4", "comment": "The RuneScape disconnected message is perfect."}, {"comment_id": "dfsflct", "post_id": "6393x4", "comment": "That's where it's from! Looked so familiar but didn't know from where"}, {"comment_id": "dfsj39b", "post_id": "6393x4", "comment": "I really like the unregistered hypercam 2 in the right corner too."}, {"comment_id": "dfsfpj3", "post_id": "6393x4", "comment": "[deleted]"}, {"comment_id": "dfskp1r", "post_id": "6393x4", "comment": "Literally 1:1 scale with the ingame font too, really proud of the /r/runescape and /r/2007scape guys working together for this, that and anyone else who jumped in for nostalgia's sake... Thank you.  "}, {"comment_id": "dfsl02b", "post_id": "6393x4", "comment": "In the upper right area there is also an   'a pq w   Nice', a 108 dds spec, a max stack of cash and an ice barrage, lmao\n\n   "}, {"comment_id": "dfsgtlm", "post_id": "6393x4", "comment": "Is nobody pointing out the fact that the Mona Lisa is flipping the bird?"}, {"comment_id": "dfskpmu", "post_id": "6393x4", "comment": "don't forget the a q p W"}, {"comment_id": "dfsimlk", "post_id": "6393x4", "comment": "unregistered hypercam 2 on the top right too"}, {"comment_id": "dfshqm8", "post_id": "6393x4", "comment": "the runescape 73 is also perfect"}, {"comment_id": "dfss374", "post_id": "6393x4", "comment": "Fairly sure most RS has the most stuff on there, or at least the most pronounced."}, {"comment_id": "dfsdvcr", "post_id": "6393x4", "comment": "I don't know why, but this whole thing made me so happy for some reason.\n\nEdit: [YouTube timelapse](https://www.youtube.com/watch?v=XnRCZK3KjUY), [high-resolution picture of the final version](http://i.imgur.com/ajWiAYi.png), [another high-resolution version](https://i.redd.it/72vbx01kpdpy.png), [a third one without the cursor](https://i.redd.it/hkbdz9w5h7py.png) and /r/Suomi is indeed turning 100, come say hei."}, {"comment_id": "dfsevmb", "post_id": "6393x4", "comment": "It's just such a wholesome idea, everyone coming together to make a giant pixel mosaic, and it actually worked."}, {"comment_id": "dfsh1i1", "post_id": "6393x4", "comment": "It was beautiful. It was chaos at first, but between the subreddits and their associated Discord servers, a beautiful massive cooperation was born. Coolest social experiment I've ever seen, by far. "}, {"comment_id": "dfshpgw", "post_id": "6393x4", "comment": "It makes me happy because it says to me that most people are awesome and want to build cool things, and the ruiners and destroyers are in the minority.\n\nSo often on the internet, people who just want to mess stuff up have an outsize impact. One spammer or botter can ruin conversation in an entire community. They're persistent and their work - ruining - is easier than building. Like with last year's April Fools, Robin, how it only took 1 person spamming nonsense to seriously disrupt a chat of 16 or 32 people. So you get this idea that a good portion of people are terrible, because a good deal of what you see is terribleness. \n\nBut when you limit everyone to each having the same impact, so one ruiner can only post one pixel at a time - or two or three, if they have some alts - and each creator can place the same number of pixels, the sheer overwhelming number of good people becomes apparent. Someone puts down a pixel to mess something up, someone else puts down a pixel to fix it, and a second person puts down a pixel to build it further. Progress is made. The void was beaten back every time, and I'm sure it would have been again if the experiment had gone on a few hours longer. \n\nPeople had a huge canvas that they could do anything with, and they chose to fill it with really cool things and expressions of teamwork and love. And they successfully fought off the few who tried to ruin it. Because that's what humans do, when the impact of terrible people isn't disproportionately distorted by the nature of the internet."}, {"comment_id": "dfsfgwe", "post_id": "6393x4", "comment": "[Here is a 4K Time Lapse of the whole thing](http://spacescience.tech/place/)"}, {"comment_id": "dfsjito", "post_id": "6393x4", "comment": "It becomes pretty clear in the time lapse when certain groups started using bots to do the painting."}, {"comment_id": "dfsgpsp", "post_id": "6393x4", "comment": "I'm pleasantly surprised with how it turned out in the end. The first 12 hours seemed like it was just going to be a big goofy color war that would end in 90% blue pixels."}, {"comment_id": "dfsiy3f", "post_id": "6393x4", "comment": "My favorite was the German flag that took over France. Sure they moved it upwards, but we all know that was just a puppet government. "}, {"comment_id": "dfsj5cp", "post_id": "6393x4", "comment": "What I personally find the most interesting are the black \"corruption\" blots. They almost act like actual bacteria would before becoming a sort of prism emblem, while still continuing to spread."}, {"comment_id": "dfsjcvx", "post_id": "6393x4", "comment": "It brought Reddit together as a community. Not just as a group of people here for their own purposes, it brought the thousands of Subreddits on this website together in one place. Reddit truly is one big happy family."}, {"comment_id": "dfsg6rn", "post_id": "6393x4", "comment": "My SO was so happy about this as well. She borrowed my phone so she could add pixel, as a new account couldn't. \nShe liked that this piece of art is a huge piece of work done by this awesome community. \n\n\nIt could have easily been only covered in drawings of dicks and stuff like that if posted elsewhere. "}, {"comment_id": "dfsh8zr", "post_id": "6393x4", "comment": "You too, huh?  I just keep staring at it and grinning. I can't get enough. \n\nWhat blows me away is that the whole thing was over just three days!  When I learned about it, it was so far along, with factions and subreddits for the factions, that I figured it had been going on for at least a week. "}, {"comment_id": "dfshn0w", "post_id": "6393x4", "comment": "It was rewarding for me because I was able to choose where I contributed my pixel and my contribution was immediately realized. \n\nOn the flip side, I have very little idea where my tax money is going so I'm not fulfilled when I contribute to my government. If I could choose where it went and see it immediately help, I would be much more excited for tax season. "}, {"comment_id": "dfsffp5", "post_id": "6393x4", "comment": "It's the Swedish king at the upper right, he kind of has that power over people. "}, {"comment_id": "dfsh9r3", "post_id": "6393x4", "comment": "The 'Straya cunts part made me laugh. Then I saw Steve, and that made my day. "}, {"comment_id": "dfsl0kk", "post_id": "6393x4", "comment": "'straya was pretty cool though.  There was some initial friction when /r/parahumans got in the way of the kangaroo ears, but I think there was some collaboration and cooperation and it was positive in general."}, {"comment_id": "dfsgavl", "post_id": "6393x4", "comment": "This has to be the most concentrated dose of internet culture ever. Also it's really beautiful, as a concept and an art piece :)"}, {"comment_id": "dfsffml", "post_id": "6393x4", "comment": "This has to be one of the most interesting studies of human behavior I've been witness to. \n\nEDIT: To all the people commenting/complaining about it being taken over by bots - I still thinks its a very interesting study in human behaviour. Humans started it, humans created the bots and told them what to do. However this thing turned out, it was still something put together by people coming together - whether they manipulated it with bots they created or did it by hand on their own. Until we have true AI, I don't think we can argue that humans weren't involved with each other even if it was partially through bots interacting. "}, {"comment_id": "dfshwxn", "post_id": "6393x4", "comment": "And participate in. \nAnd fight in. \nGlory to the Etho logo at the top left and the Hearthstone logo and the Bender. Lol\n\nE: yo there's a Bill Cipher too!! Awesome"}, {"comment_id": "dfsjzvu", "post_id": "6393x4", "comment": "I was a native to the Midwest, Mona Lisa ranch-hand was my occupation until I turned 28.\n\nI had a great time participating. It's a really great concept. There's an unfortunate aspect that no one really accounts for - many groups used scripting bots to control their spaces and touch-up. \n\nGood job Reddit you cheated at art.\n\nHow the fuck do you cheat at art.\n\n"}, {"comment_id": "dfslqbs", "post_id": "6393x4", "comment": "Yeah, its especially fascinating when you consider all the social organization, political deal-making, and diplomacy that went on behind the scenes."}, {"comment_id": "dfskrll", "post_id": "6393x4", "comment": "I'm convinced Reddit is partnered with some psychology/sociology department somewhere and every April Fools Day, they just use their mass influence to conduct a different kind of sociological experiment."}, {"comment_id": "dfsntcq", "post_id": "6393x4", "comment": "Were you around for the button? That shit was cray"}, {"comment_id": "dfsfgic", "post_id": "6393x4", "comment": "I didn't realize that they managed to sneak in Waldo as well! That's so cool!"}, {"comment_id": "dfsh5j7", "post_id": "6393x4", "comment": "What's best is he's been there since a few hours in. Sure, it got shat on a couple times by the likes of the void (and is damaged in the final shot), but most people worked around it and let it up. The same goes with a surprising number of nice small art."}, {"comment_id": "dfsm3po", "post_id": "6393x4", "comment": "It got taken over by the void right at the end ):"}, {"comment_id": "dfsh00t", "post_id": "6393x4", "comment": "Yeah I was looking for it but found it only in this version. Fucking assholes (it's called Void I guess) ruined it at the end... "}, {"comment_id": "dfs9v82", "post_id": "6393x4", "comment": "[deleted]"}, {"comment_id": "dfse72w", "post_id": "6393x4", "comment": "[Here's the final version timelapse on YouTube](https://www.youtube.com/watch?v=XnRCZK3KjUY)\n\nEdit: [This heatmap thing looks cool too](http://i.imgur.com/a95XXDz.gifv)"}, {"comment_id": "dfsa0oj", "post_id": "6393x4", "comment": "It's not but I liked this version the best. [This](https://i.redd.it/72vbx01kpdpy.png) is the final for those who want it. "}, {"comment_id": "dfsdfsx", "post_id": "6393x4", "comment": "It's treason, then. "}, {"comment_id": "dfsfqtg", "post_id": "6393x4", "comment": "Fuck the final version! Someone erased my stuff in it. :("}, {"comment_id": "dfsfiqw", "post_id": "6393x4", "comment": "I like this version best because it's just before Israel ran over my U"}, {"comment_id": "dfsddxe", "post_id": "6393x4", "comment": "How many people in all worked on this?"}, {"comment_id": "dfsdx8j", "post_id": "6393x4", "comment": "Somewhere around 90 thousand if I remember correctly."}, {"comment_id": "dfse2fm", "post_id": "6393x4", "comment": "I did. "}, {"comment_id": "dfsbp8n", "post_id": "6393x4", "comment": "Ok so what the heck did I miss this weekend. Can someone explain for lowly ole me?"}, {"comment_id": "dfsbwex", "post_id": "6393x4", "comment": "A subreddit opened up called \"r/place\" for April fools. In this subreddit you were able to place one pixel and had to wait a minimum of five minutes in order to place another. Various communities were arranged in order to organize specific works. The sub recently closed after hitting the 72 hour mark. This is near the end of it. It's not the final because a group of greifers messed areas up and I preferred this look better."}, {"comment_id": "dfsc0ir", "post_id": "6393x4", "comment": "There was this subreddit where everyone could place a pixel every 5 minutes and this was made"}, {"comment_id": "dfseog1", "post_id": "6393x4", "comment": "i love how no matter who you are, you can find something in there that you're a fan of/recognize. excluding flags."}, {"comment_id": "dfsgkpo", "post_id": "6393x4", "comment": "Literally. I saw like four things from Stardew Valley and I didn't know so many people played that. \n\nEdit: TIL Stardew Valley is an immensely popular game!"}, {"comment_id": "dfsh4ow", "post_id": "6393x4", "comment": "ftl got a tiny but recognizable engi"}, {"comment_id": "dfsjoxp", "post_id": "6393x4", "comment": "This. It warmed my heart to see other small subreddits that I'm subscribed to set something up. I helped one subreddit out so I just focused on my area, but when I decided to look around it was like a nice nostalgia trip.\n\nFuck Blue Corner for going over the Samus sprite, though."}, {"comment_id": "dfsnqz5", "post_id": "6393x4", "comment": "The Temmie (from Undertale) in the Irish flag is still cracking me up. I neither know why it's there or why I find it so funny. "}, {"comment_id": "dfsdw8g", "post_id": "6393x4", "comment": "Lol at those RuneScape Memes"}, {"comment_id": "dfsebl4", "post_id": "6393x4", "comment": "\"Connection lost: Attempting to reestablish\" while in old wilderness and your heart is about to give out on you.\n\nA qp XD this is nostalgia if I ever felt some"}, {"comment_id": "dfsjoit", "post_id": "6393x4", "comment": "Emily faking cancer will now be a part of Reddit history"}, {"comment_id": "dfsezhs", "post_id": "6393x4", "comment": "This would make an epic sheet of blotter."}, {"comment_id": "dfsfczf", "post_id": "6393x4", "comment": "my thought exactly when I saw this "}, {"comment_id": "dfsuj19", "post_id": "6393x4", "comment": "The part that actually says LSD would have to be triple dosed."}, {"comment_id": "dfsexb4", "post_id": "6393x4", "comment": "My boy aku there on the left looking E X T R A  T H I C C as always"}, {"comment_id": "dfsqnv3", "post_id": "6393x4", "comment": "HAA HAA HAA\n\nFoolish samurai."}, {"comment_id": "dfsm1bq", "post_id": "6393x4", "comment": "Aku is a die hard Stalinist now. Lel"}, {"comment_id": "dfsiuuh", "post_id": "6393x4", "comment": "Shout out to r/Straya for their ripper effort on Sir Steve Irwin and our Nations contribution to world cuisine; the Bunnings snag."}, {"comment_id": "dfss68z", "post_id": "6393x4", "comment": "Shit yeah brah"}, {"comment_id": "dfsgjun", "post_id": "6393x4", "comment": "I just wanna say, I see my country's flag there (india) and our neighboring country is right next to it. (pakistan)\n\nRegardless of what bullshit politics get reported in the media, I love that our two flags are together in this. \n\nlove you guys :D"}, {"comment_id": "dfslp23", "post_id": "6393x4", "comment": "Sorry to say, but Pakistan's flag was actually destroyed later on."}, {"comment_id": "dfsfaag", "post_id": "6393x4", "comment": "There's so much detail to look at here, but I'm quite a fan of the /r/prequelmemes in the center. Seeing their takeover of /r/movies made my Saturday.\n\nEdit: I meant top center."}, {"comment_id": "dfsmgra", "post_id": "6393x4", "comment": "Well deserved takeover too, /r/movies has legitimately awful taste."}, {"comment_id": "dfsjn9t", "post_id": "6393x4", "comment": "Belgium did a pretty awesome job even without considering their population size. "}, {"comment_id": "dfsq55k", "post_id": "6393x4", "comment": "It's so dense, every pixel has so much going on"}, {"comment_id": "dfsfflb", "post_id": "6393x4", "comment": "I'm sorry,  but what are you talking about with /r/prequelmemes in the center?\n\nI see something similar, but it is /r/FrequelMemes"}, {"comment_id": "dfsj6i1", "post_id": "6393x4", "comment": "Place feels like a metaphor for human progress.  Alone you can't get much done, but great things happen when people mobilize. Projects seem mundane on a microscopic scale, but with a little bit of waiting, great things are made."}, {"comment_id": "dfsfgiw", "post_id": "6393x4", "comment": "Seeing little pixel arts that I drew out and then got support from other people to build makes me more proud than anything else I've ever done in my life."}, {"comment_id": "dfslf5a", "post_id": "6393x4", "comment": "I'm not artistic, so I went around and helped out on my favorite graphics. I'm happy to have cleaned and protected totodile in the final hours of the project!"}, {"comment_id": "dfshfzd", "post_id": "6393x4", "comment": "RIP Tom Searle got me in the heart "}, {"comment_id": "dft061k", "post_id": "6393x4", "comment": "You can thank /r/metalcore for that, they very early on created a memorial, \"Blegh! RIP Tom\". It was simple, but we knew we wanted to keep it when we (/r/placestart) built our taskbar because it was well maintained and simple. I am glad we did keep it, it seems to have been good for a lot of people."}, {"comment_id": "dfsds5f", "post_id": "6393x4", "comment": "im not an arty person but ive spent the last 20 minutes staring at this thing so it must be good, or at least interesting."}, {"comment_id": "dfsjkxc", "post_id": "6393x4", "comment": "I love this and consider it a genuine work of art. I think it would be an amazing museum exhibit."}, {"comment_id": "dfsj5ib", "post_id": "6393x4", "comment": "The unregistered hypercam 2 is perfect. "}, {"comment_id": "dfseo15", "post_id": "6393x4", "comment": "Did you ever hear the tragedy of Darth Plagueis the wise?"}, {"comment_id": "dfsg1f1", "post_id": "6393x4", "comment": "No."}, {"comment_id": "dfsh28f", "post_id": "6393x4", "comment": "I love that somewhere in there, someone changed \"dark\" to \"dank\""}, {"comment_id": "dfsbpec", "post_id": "6393x4", "comment": "Can we all agree the Dutch are a bunch of assholes? They took over the Puerto Rican, Dominican republic, and Colorado flags. AND the SkiFree Monster dispite already having a huge untouched flag and Coat of arms."}, {"comment_id": "dfsdbyz", "post_id": "6393x4", "comment": "Norway drew a Sami flag, and then mowed it over"}, {"comment_id": "dfseur2", "post_id": "6393x4", "comment": "There are two things in this world I can't stand.\n\n1. People who are intolerant of other people's cultures.\n2. The Dutch. "}, {"comment_id": "dfseuru", "post_id": "6393x4", "comment": "Tell me about it, r/Dominican and r/PuertoRico were so happy to have their flags on there."}, {"comment_id": "dfsgur7", "post_id": "6393x4", "comment": "It's just land reclamation, it's a part of their culture."}, {"comment_id": "dfsffi0", "post_id": "6393x4", "comment": "The dutch just lucked into a massive space created by the void. The void was a group of users who would just start placing black pixels in areas and wipe out what they could. If no one was there to resist them it would just destroy large sections of the image. The dutch swept through after the void destroyed the whole top left section."}, {"comment_id": "dfsfsy3", "post_id": "6393x4", "comment": "Don't forget nyan cat"}, {"comment_id": "dfsdwwe", "post_id": "6393x4", "comment": "A lot of us were in Discord, we all voted to keep the SkiFree monster and helped them to maintain it, but we couldn't fight the rogue and random ones."}, {"comment_id": "dfsii29", "post_id": "6393x4", "comment": "I mean, that's basically what the Dutch did all throughout history."}, {"comment_id": "dfsf234", "post_id": "6393x4", "comment": "VOC-mentality, we can't help it. "}, {"comment_id": "dfslzgd", "post_id": "6393x4", "comment": "And the Armenian flag (that's where they placed their coat of arms). There was actually a truce and they backstabbed big time. "}, {"comment_id": "dfsffks", "post_id": "6393x4", "comment": "The process is the real art here."}, {"comment_id": "dfskfte", "post_id": "6393x4", "comment": "I think it was partially ruined because of bots. Simple captcha once in 5-10 minutes would have solves it."}, {"comment_id": "dfsfym3", "post_id": "6393x4", "comment": "This would make a really fun jigsaw puzzle. "}, {"comment_id": "dfsscf1", "post_id": "6393x4", "comment": "Each piece a single colored square."}, {"comment_id": "dfsdavn", "post_id": "6393x4", "comment": "I was not expecting Soylent to be on there. "}, {"comment_id": "dfsgurq", "post_id": "6393x4", "comment": "Well, much of the time it was actually Goylent"}, {"comment_id": "dfso1hn", "post_id": "6393x4", "comment": "As someone who has been mostly lurking on /r/all for the past ~4 years, this is pretty much what reddit is in my head. It's so clearly captured on a canvas now. It expresses beyond what I could imagine, but makes so much sense. It's really cool."}, {"comment_id": "dfsdnzz", "post_id": "6393x4", "comment": "Nobody's mentioned your porn hub window yet."}, {"comment_id": "dfsdyi7", "post_id": "6393x4", "comment": "That's actually part of the artwork aha."}, {"comment_id": "dfse2oh", "post_id": "6393x4", "comment": "I can't tell whether you're joking or just don't understand what r/place is/was."}, {"comment_id": "dfsdm0v", "post_id": "6393x4", "comment": "I like how Canada is the only flag that's perfect. Nobody has shit with Canada lol"}, {"comment_id": "dfsfu8s", "post_id": "6393x4", "comment": "There are actually quite a few perfect flags there."}, {"comment_id": "dfsfadg", "post_id": "6393x4", "comment": "It was a constant battle but some beauties even surrounded our lovely flag with the provincial and territorial flags of our country. <3 sadly the final image lists our 160th anniversary while we are celebrating our 150th but it's still a great representation despite that. My favourite snap is this http://imgur.com/c7RDmEY"}, {"comment_id": "dfse6nc", "post_id": "6393x4", "comment": "Considering we had SO MUCH trouble getting the smaller version of our flag to look right, it's so gratifying that we were able to pull it together in the end. Maple leafs are HARD to draw! "}, {"comment_id": "dfsi49m", "post_id": "6393x4", "comment": "Maryland"}, {"comment_id": "dfsfgnu", "post_id": "6393x4", "comment": "And Argentina! Vamos Manaos"}, {"comment_id": "dfsh7iu", "post_id": "6393x4", "comment": "Don't forget Marylands! "}, {"comment_id": "dfsl8im", "post_id": "6393x4", "comment": "Fucking Mexico man, I thought it looked awesome, didnt take to much space, adopted yoshi, had a lot of creative images. It wasnt just a flag plastered on there. \n\n\nThen the people at the void had to come and fuck it up last minute. \n\nand dont get me started on those assholes across the pond....\n\n\nahh well it was all in good fun!\n\n"}, {"comment_id": "dfsfhyc", "post_id": "6393x4", "comment": "A surprise to be sure, but a welcome one"}, {"comment_id": "dfsfk2m", "post_id": "6393x4", "comment": "Nice to see the Viva Mexico Cabrones, the mexican flag and yoshi in their splender, rip and fuck the void."}, {"comment_id": "dfsgigk", "post_id": "6393x4", "comment": "I helped preserve the r/Wales flag! As I am Welsh it seemed the right thing to do :)"}, {"comment_id": "dfsized", "post_id": "6393x4", "comment": "This should be on display in the Smithsonian. "}, {"comment_id": "dfsatkc", "post_id": "6393x4", "comment": "There needs to be a creation timelapse of this. Is there one?"}, {"comment_id": "dfsb1ss", "post_id": "6393x4", "comment": "[I gotchu](https://www.youtube.com/watch?v=XnRCZK3KjUY)"}, {"comment_id": "dfsfub8", "post_id": "6393x4", "comment": "Everything looks so nice then you see Osu! torn apart"}, {"comment_id": "dfsjttt", "post_id": "6393x4", "comment": "Some say to this day they're still defending their logo\n\n\nhttps://en.wikipedia.org/wiki/The_Great_/r/osugame_Defense"}, {"comment_id": "dfsh82n", "post_id": "6393x4", "comment": "I'm so happy the Tom Searle tribute remained, it makes me so happy that everyone accepted the grieving of a fairly small community in r/metalcore"}, {"comment_id": "dfsfnlq", "post_id": "6393x4", "comment": "Glad it ended because I had to stay up all night working on it. What a cool experience though. It really brought people together. The pixel wars were intense though. These houston rockets fans kept trying to change our rip city Into nip tity."}, {"comment_id": "dfsdzsh", "post_id": "6393x4", "comment": "Hey, you got the version where /r/Metroid's Samus sprite is still intact!\n\nHonestly the better version even without Samus. Blue Corner had a perfect, respectable blue corner here. With their expansion at the end they not only ruined a lot of people's efforts, but made their own area look worse because there's just random extra blue and weird extra blue borders that go nowhere. "}, {"comment_id": "dfseiao", "post_id": "6393x4", "comment": "i like this version better than the last one, the black void really fucking sucks..."}, {"comment_id": "dfsjpo0", "post_id": "6393x4", "comment": "The black void and Denmark. I'm still salty that the Texas flag was erased just to make more room for their already obnoxiously giant flag.\n\nEdit: I just noticed upon further inspection that the Texas flag was moved and survived in a different spot. I am now satisfied. :)"}, {"comment_id": "dfsh13q", "post_id": "6393x4", "comment": "I take it your stuff is in the final void haha"}, {"comment_id": "dfsiuv0", "post_id": "6393x4", "comment": "There is still a lot of grief here. League of Legends is better in the final version, along with other word based logos"}, {"comment_id": "dfsmj2x", "post_id": "6393x4", "comment": "Just reminds me of the million dollar homepage "}, {"comment_id": "dfshjsa", "post_id": "6393x4", "comment": "Why was the OSU circle so defaced? I mean I would understand if Dota or LoL were screwed up because of the rivalry, but who hates OSU??"}, {"comment_id": "dfsjd7p", "post_id": "6393x4", "comment": "alot of people were upset with how much wasted space there was with all the pink that did not much more than take up a lot of space. The battle went back and forth with the logo popping up then being overrun then popping up again"}, {"comment_id": "dft0eic", "post_id": "6393x4", "comment": "It got raided by a popular streamer (loltyler1) which led to a vicious cycle of hate towards it and everything that was on it, such as the D.Va bunny."}, {"comment_id": "dfsioa5", "post_id": "6393x4", "comment": "I find it funny that we, as a website community, were given a blank canvas to do what we wished with it.  We ended up branding the crap out of it with company, game, and other logos. "}, {"comment_id": "dfstc2x", "post_id": "6393x4", "comment": "That's what Reddit is.  Maybe those logos are subreddits.  It would be hard to create something not having to do with everyone's similar interests.  Did you want flowers and animals? "}, {"comment_id": "dfsgsfv", "post_id": "6393x4", "comment": "This is actually surprisingly beautiful, well done everyone. My favorite part is the chrono trigger characters, the best game."}, {"comment_id": "dfshn8z", "post_id": "6393x4", "comment": "I fucking LOVE everything about this. I am blown away that this was drawn at a plixel/5 minutes/person. "}, {"comment_id": "dfsj5he", "post_id": "6393x4", "comment": "This isn't the final image.  It's from a few hours before.  Look at the decepticon emblem in the lower right corner, there's red pixel in one eye, and white near the top of it.   Now go to r/place and look at what it actually looks like."}, {"comment_id": "ebp8dx8", "post_id": "a5tqxx", "comment": "Next step is painting Shaq drinking oil with water colours"}, {"comment_id": "ebpbx8x", "post_id": "a5tqxx", "comment": "This guy arts"}, {"comment_id": "ebpc2c7", "post_id": "a5tqxx", "comment": "Baby oil or motor oil? Important distinction."}, {"comment_id": "ebpgm4x", "post_id": "a5tqxx", "comment": "Where is u/shitty_watercolour when you need him!"}, {"comment_id": "ebpj0aa", "post_id": "a5tqxx", "comment": "Shaq drinking canvas, oil on water"}, {"comment_id": "ebpheyd", "post_id": "a5tqxx", "comment": "That’s why his nickname is “the big diesel”"}, {"comment_id": "ebpcu7s", "post_id": "a5tqxx", "comment": "You made me laugh, that was good! "}, {"comment_id": "ebpkuzh", "post_id": "a5tqxx", "comment": "I would like to see that "}, {"comment_id": "ebpmyb4", "post_id": "a5tqxx", "comment": "MoMA wants to know your location"}, {"comment_id": "ebq8vro", "post_id": "a5tqxx", "comment": "I believe it would be canvas drinking oil, water on Shaq"}, {"comment_id": "ebqtxy7", "post_id": "a5tqxx", "comment": "Want a crite sprnanberry"}, {"comment_id": "ebqvugp", "post_id": "a5tqxx", "comment": "Holy shit."}, {"comment_id": "ecrx4qq", "post_id": "a5tqxx", "comment": "I'm on it"}, {"comment_id": "ebp884k", "post_id": "a5tqxx", "comment": "Drinking water appears to be a theme in your work!\n\nhttps://www.reddit.com/r/pics/comments/8kcenh/i_painted_trump_trying_to_drink_water/\n\nhttps://www.reddit.com/r/pics/comments/8hw5ro/i_painted_the_zucc/\n\nBig fan of your paintings."}, {"comment_id": "ebp96j8", "post_id": "a5tqxx", "comment": "What an odd niche."}, {"comment_id": "ebpap5o", "post_id": "a5tqxx", "comment": "Pretty sure this guy is a legend over on r/iasip for his always sunny portraits. "}, {"comment_id": "ebpbv52", "post_id": "a5tqxx", "comment": "kinda a humanizing touch to figures that are often portrayed as larger than life"}, {"comment_id": "ebp9nnw", "post_id": "a5tqxx", "comment": "That is pretty odd indeed. At least the paintings are actually amazing!"}, {"comment_id": "ebpfe99", "post_id": "a5tqxx", "comment": "/u/waterguy12 would like this"}, {"comment_id": "ebpfv7a", "post_id": "a5tqxx", "comment": "please draw u/Waterguy12"}, {"comment_id": "ebpbq7b", "post_id": "a5tqxx", "comment": "I’m waiting for the coffee table book.  Everyone is getting one for their birthday."}, {"comment_id": "ebpg6w6", "post_id": "a5tqxx", "comment": "Can we get a Marco Rubio Painting? \n\n"}, {"comment_id": "ebpbttd", "post_id": "a5tqxx", "comment": "Good find, never thought I'd enjoy this as much as I have"}, {"comment_id": "ebpoqyn", "post_id": "a5tqxx", "comment": "The father (trump), the son (zuccerburg), and the holy spirit (shaq) "}, {"comment_id": "ebpe3lf", "post_id": "a5tqxx", "comment": "I'm surprised there isn't one of Marco Rubio, the legendary water drinker"}, {"comment_id": "ebpchyo", "post_id": "a5tqxx", "comment": "This made my day "}, {"comment_id": "ebpfdmi", "post_id": "a5tqxx", "comment": "He should expand to [British politicians](https://imgur.com/gallery/Hn1of)."}, {"comment_id": "ebpfjq0", "post_id": "a5tqxx", "comment": "I love these paintings so much"}, {"comment_id": "ebpfqn2", "post_id": "a5tqxx", "comment": "Waiting for a Kavanaugh"}, {"comment_id": "ebphsfx", "post_id": "a5tqxx", "comment": "Damn, that Donald Trump one is well done"}, {"comment_id": "ebpifor", "post_id": "a5tqxx", "comment": "Likes to paint water with oil."}, {"comment_id": "ebpirws", "post_id": "a5tqxx", "comment": "wait, this is nitpicking. most of his work isn't like this."}, {"comment_id": "ebpj0q9", "post_id": "a5tqxx", "comment": "I'm not a fan of copying photographs tbh. \n\nIt's a bit transformative, and it's not badly done, but it's not very creative. It just isnt very meaningful to map out someone else's art and recreate it with paint. \n\nNot that this is being submitted for anything and art contests are slacking now anyway, but when I was in college if you copied a photograph you were almost considered plagiarizing someone else's art. \n\nPhotographs are for reference, not for copying imo"}, {"comment_id": "ebpk1pd", "post_id": "a5tqxx", "comment": "He needs to do one of Kavanaugh from his hearing. "}, {"comment_id": "ebpm4xq", "post_id": "a5tqxx", "comment": "The real water champ. "}, {"comment_id": "ebpmzf2", "post_id": "a5tqxx", "comment": "I love those. Drinking something always looks like such a vulnerable state to be in.  I love seeing that.  Also it can look goofy as fuck which makes me giggle."}, {"comment_id": "ebpnba7", "post_id": "a5tqxx", "comment": "The art of drinking water"}, {"comment_id": "ebpnduf", "post_id": "a5tqxx", "comment": "Wierd flex, but ok! "}, {"comment_id": "ebpoacn", "post_id": "a5tqxx", "comment": "I need all 3 of these"}, {"comment_id": "ebpq5yy", "post_id": "a5tqxx", "comment": "I came to ask him to do the trump one, thanks for posting. "}, {"comment_id": "ebpsncj", "post_id": "a5tqxx", "comment": "These spark joy in me."}, {"comment_id": "ebpsq2v", "post_id": "a5tqxx", "comment": "Is your username a joke on Jerome’s Dream?"}, {"comment_id": "ebpsqqz", "post_id": "a5tqxx", "comment": "Huuuuge fan of your paintings. "}, {"comment_id": "ebptwm3", "post_id": "a5tqxx", "comment": "It is a truly restorative act, and a universal one at that."}, {"comment_id": "ebpudh1", "post_id": "a5tqxx", "comment": "Oooh oooh, now do Marco Rubio "}, {"comment_id": "ebq6v70", "post_id": "a5tqxx", "comment": "All of these paintings are amazing."}, {"comment_id": "ebq95cd", "post_id": "a5tqxx", "comment": "The Zucc one is just hilarious. I know he already looks like an alien in human skin in reality but this painting is just perfect. I don't know if it's the colours or composition or whatever but it just makes it even better. Genius. "}, {"comment_id": "ebqabdg", "post_id": "a5tqxx", "comment": "The real water champ?"}, {"comment_id": "ebqas43", "post_id": "a5tqxx", "comment": "Would be a good exhibit."}, {"comment_id": "ebqgty1", "post_id": "a5tqxx", "comment": "I had not seen the zucc one until now"}, {"comment_id": "ebr23nz", "post_id": "a5tqxx", "comment": "I love it."}, {"comment_id": "ebpi4lq", "post_id": "a5tqxx", "comment": "Lol Trump's hands are so small he needs to hold the bottle with both of them hahahaha"}, {"comment_id": "ebpjmn2", "post_id": "a5tqxx", "comment": "I like how trump has tiny hands struggling to drink water while shaq is so big the water bottle looks small and he is struggling because he is so large and the bottle is tiny lol "}, {"comment_id": "ebp7jit", "post_id": "a5tqxx", "comment": "He looks like he just told a joke and is taking a swig of water while it hits you. "}, {"comment_id": "ebp8gk9", "post_id": "a5tqxx", "comment": "The clip it’s from is hilarious \nhttps://youtu.be/xRtBez3k3F8"}, {"comment_id": "ebpbrx5", "post_id": "a5tqxx", "comment": "The joke indicator. It's like that one stand up guy who smokes cigars and drinks whiskey on stage. You know when the joke is over and it's okay to laugh because he takes a sip of whiskey or takes a drag off his cigar."}, {"comment_id": "ebpoxmw", "post_id": "a5tqxx", "comment": "(8)"}, {"comment_id": "ebp8dog", "post_id": "a5tqxx", "comment": "Slightly unrelated but this reminded me of a time I did that. I was talking to one of my co-workers and made a sassy, kind of rude comment poking fun at someone else who worked there that I thought had already gone home. I made my joke and took a huge swig out of my water bottle for dramatic effect just as the person who I was making fun of stepped out from behind a stack of boxes. It was so god damn funny that I ended up just spitting out an entire mouthful of water onto the floor while both of my coworkers shook their heads at me. "}, {"comment_id": "ebpb0pi", "post_id": "a5tqxx", "comment": "ERNIE THAT'S NOT A FACE I'M JUST COUGHING!"}, {"comment_id": "ebpf7y1", "post_id": "a5tqxx", "comment": "ERNEH*"}, {"comment_id": "ebqzgds", "post_id": "a5tqxx", "comment": "“I’m not making a face.” *makes fake face* “This is me making a face.”"}, {"comment_id": "ebp6yz5", "post_id": "a5tqxx", "comment": "At first I thought the water bottle was a bit small in proportion. Then I remembered that Shaq is a very large man "}, {"comment_id": "ebp7fz7", "post_id": "a5tqxx", "comment": "It's actually a 2 liter."}, {"comment_id": "ebp9jfm", "post_id": "a5tqxx", "comment": "Like a picture of Andre the Giant with a full sized beer can.\n\nhttps://us-east-1.tchyn.io/snopes-production/uploads/2017/11/andre-the-giant.jpg"}, {"comment_id": "ebp8lqk", "post_id": "a5tqxx", "comment": "Its still too big. Look up an image of this. The artist made a good decision not keeping it accurate, people wouldn't beileve them."}, {"comment_id": "ebp9kqq", "post_id": "a5tqxx", "comment": "/r/shaqholdingthings"}, {"comment_id": "ebp9y56", "post_id": "a5tqxx", "comment": "Honestly in that video the bottle seems even smaller than it does in this painting."}, {"comment_id": "ebpasc9", "post_id": "a5tqxx", "comment": "Yeah watching him drink water during that episode where he eats the reaper chip, the water bottle looks almost comically small because of how massive his hands are."}, {"comment_id": "ebpcxzy", "post_id": "a5tqxx", "comment": "Can confirm. I saw him at my gym one day, I was astounded at how enormous his head is. He was playing ball with a bunch of young kids, really nice man."}, {"comment_id": "ebpbxf5", "post_id": "a5tqxx", "comment": ">\tvery large man \n\nFor you"}, {"comment_id": "ebpbyay", "post_id": "a5tqxx", "comment": "Hah! I was going the exact same thing! I even  paused a video several times to see the bottle haha!"}, {"comment_id": "ebpcga1", "post_id": "a5tqxx", "comment": "Boss baby for real."}, {"comment_id": "ebpdii6", "post_id": "a5tqxx", "comment": "Friend of mine were acquaintances with Shaq’s son and visited his home before. He told me about a big painting of Shaq driving a giant 18 wheeler posted on the wall in dining room. What a cool dude and probably an interesting painting to see."}, {"comment_id": "ebpduh8", "post_id": "a5tqxx", "comment": "How about a Trump drinking water painting next. Water bottle for scale on hand size."}, {"comment_id": "ebpeqi6", "post_id": "a5tqxx", "comment": "There's an original photo posted on here somewhere. "}, {"comment_id": "ebp9m4n", "post_id": "a5tqxx", "comment": "\"Omega Psi Phi. Til we die. This is nothing to me. AhhHhhh\" -Shaq"}, {"comment_id": "ebpez6g", "post_id": "a5tqxx", "comment": "“Oh it’s hot.” -Shaq"}, {"comment_id": "ebp983y", "post_id": "a5tqxx", "comment": "Was this when he ate that ghost pepper chip?"}, {"comment_id": "ebpd2m7", "post_id": "a5tqxx", "comment": "Yes."}, {"comment_id": "ebpmg4g", "post_id": "a5tqxx", "comment": "So funny. Poor Shaq.\n\n[https://www.youtube.com/watch?v=aYAgIv2Heyg](https://www.youtube.com/watch?v=aYAgIv2Heyg)"}, {"comment_id": "ebp8f1u", "post_id": "a5tqxx", "comment": "This artist's rendering of Kazaam, a 5,000 year-old genie who appears from a magic boombox, now depicted a hard working business man quenching his thirst with a 2 liter of water, is quite breathtaking. "}, {"comment_id": "ebpebts", "post_id": "a5tqxx", "comment": "Excellent analysis."}, {"comment_id": "ebp7b3b", "post_id": "a5tqxx", "comment": "The existence of this painting makes me happy:)"}, {"comment_id": "ebp7e7y", "post_id": "a5tqxx", "comment": "A physical manifestation of my soul"}, {"comment_id": "ebpc4ut", "post_id": "a5tqxx", "comment": "\nHey /u/seamuswray,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts."}, {"comment_id": "ebpcb0f", "post_id": "a5tqxx", "comment": "How much for the painting? "}, {"comment_id": "ebpb11u", "post_id": "a5tqxx", "comment": "Is this when he ate the spicy chip lmao"}, {"comment_id": "ebp7oye", "post_id": "a5tqxx", "comment": "If Shaq is the  [self-declared ](https://bleacherreport.com/articles/446845-shaquille-oneal-the-10-best-quotes-from-one-of-the-best-nba-ballers-ev#slide1) Big stock exchange, Big Aristotle, Big Shakespeare then you’re the Big DaVinci \n\n"}, {"comment_id": "ebpovgm", "post_id": "a5tqxx", "comment": "Oh man. I was at the Suns home game when Shaq made his debut. When he came out they played some \"Big Aristotle\" rap song and it was just such a ridiculous spectacle. Like why would he go with Aristotle? So weird. "}, {"comment_id": "ebpcmig", "post_id": "a5tqxx", "comment": "I remember this scene where he chokes on the water. He'll be on later tonight for anyone that doesn't watch \"inside the nba\" on TNT. Hilarious analysis on the nba."}, {"comment_id": "ebpcyvo", "post_id": "a5tqxx", "comment": "Lol the hot chip challenge "}, {"comment_id": "ebp80um", "post_id": "a5tqxx", "comment": "I'm delightfully confused. \n\n&#x200B;"}, {"comment_id": "ebpf8gx", "post_id": "a5tqxx", "comment": "[starts at the 1:00 mark](https://youtu.be/xRtBez3k3F8) "}, {"comment_id": "ebpe1wd", "post_id": "a5tqxx", "comment": "they painted Shaq drinking water, oil on canvas, 12 x 16\""}, {"comment_id": "ebpmzh2", "post_id": "a5tqxx", "comment": "/r/ShaqHoldingThings  \n  \nThis should explain everything."}, {"comment_id": "ebp6jxj", "post_id": "a5tqxx", "comment": "Wish i could upvote this twice"}, {"comment_id": "ebpetdg", "post_id": "a5tqxx", "comment": "You can. You just upvote it, then downvote it, then upvote it again. It only counts as one upvote, though. "}, {"comment_id": "ebprvqm", "post_id": "a5tqxx", "comment": "I want to be famous enough that someone will paint me drinking water."}, {"comment_id": "ebp78sz", "post_id": "a5tqxx", "comment": "I love this, its so perfectly goofy"}, {"comment_id": "ebpf7kb", "post_id": "a5tqxx", "comment": "And it has that BIG JUICY SHAQ MEAT"}, {"comment_id": "ebp8d9n", "post_id": "a5tqxx", "comment": "I love this picture and am so jealous of your talent. Beautiful use of color, realism. Just great.   \n\nI’m cracking up at the choice of subject. Why Shaq? Why this picture? "}, {"comment_id": "ebpg70x", "post_id": "a5tqxx", "comment": "Because why not? It's hilarious. :)"}, {"comment_id": "ebp8mne", "post_id": "a5tqxx", "comment": "He looks like he needs to nurture his skin."}, {"comment_id": "ebps01u", "post_id": "a5tqxx", "comment": "Shhh 🤫 no tellin"}, {"comment_id": "ebq4nbq", "post_id": "a5tqxx", "comment": "Hey guys r/shaqholdingthings"}, {"comment_id": "ebqkj80", "post_id": "a5tqxx", "comment": "Did you tweet it to him? Maybe they'll show it on TNT. "}, {"comment_id": "ebp87k6", "post_id": "a5tqxx", "comment": "Can we make this into meme"}, {"comment_id": "ebp8v68", "post_id": "a5tqxx", "comment": "Love the Inside the NBA painting! Next up has to be Sir Charles Barkley eating a Krispy Kreme doughnut! "}, {"comment_id": "ebp9cmw", "post_id": "a5tqxx", "comment": "new desktop wallpaper thx"}, {"comment_id": "ebpb2rz", "post_id": "a5tqxx", "comment": "10/10 would offer this as a Christmas present. "}, {"comment_id": "ebpccqx", "post_id": "a5tqxx", "comment": "Ok I love the original clip of this because first off Shaq can be real funny and just the image of this giant of a man with such a tiny looking water bottle is hilarious on its own. Second this is a damn good piece of art, great job on creating a realistic painting without going the super realistic route. "}, {"comment_id": "ebp70hk", "post_id": "a5tqxx", "comment": "OP it’s great! Also fun that he looks like Chewbacca "}, {"comment_id": "ebp8r9r", "post_id": "a5tqxx", "comment": "Hey, isn't that the actor from Blue Chips and Shazaam?"}, {"comment_id": "ebpaqjo", "post_id": "a5tqxx", "comment": "Roger"}, {"comment_id": "ebp8u76", "post_id": "a5tqxx", "comment": "if you just look at the half top it looks like a crying Jordan."}, {"comment_id": "ebpb9qx", "post_id": "a5tqxx", "comment": "Shaq looks like a made up character in a fantasy film, like the King's personal guard the heroes have to convince about the Necromancer threat."}, {"comment_id": "ebpbrkt", "post_id": "a5tqxx", "comment": "The combination of colors look very beautiful"}, {"comment_id": "ebpfe2q", "post_id": "a5tqxx", "comment": "water is fucking delicious"}, {"comment_id": "ebpgjup", "post_id": "a5tqxx", "comment": "Looks like he's being questioned by the Senate? "}, {"comment_id": "ebpj4hp", "post_id": "a5tqxx", "comment": "He got some guac on his chin?"}, {"comment_id": "ebq4gbp", "post_id": "a5tqxx", "comment": "For anyone who doesn’t know, he’s making that face in this because he had just taken the “one chip challenge”. Basically ate a super spicy Dorito type chip"}, {"comment_id": "ec30wsr", "post_id": "a5tqxx", "comment": "This is an absolutely incredible painting, but something is off with the fingers. I think it's because they're missing a joint! They have one joint in the middle of the fingers, but they're all missing the top joint, which looks off."}, {"comment_id": "ec3cymy", "post_id": "a5tqxx", "comment": "Where can I throw money at you."}, {"comment_id": "ec3xp15", "post_id": "a5tqxx", "comment": "I save every fucking painting you do.  The elon musk smoking is still dropped regularly in my group chats"}, {"comment_id": "ec5e8n0", "post_id": "a5tqxx", "comment": "First sip annihilate the bottle "}, {"comment_id": "ebp99fc", "post_id": "a5tqxx", "comment": "One of Shaq's many nicknames was The Big Cactus when he played for the Phoenix Suns and nothing stores water quite like a big cactus."}, {"comment_id": "ebpe6ul", "post_id": "a5tqxx", "comment": "You use your talent in the best way possible"}, {"comment_id": "ebp82sh", "post_id": "a5tqxx", "comment": "Shaq doesn't mess around with hydration. "}, {"comment_id": "ebp8klz", "post_id": "a5tqxx", "comment": "He's the runner-up to Water Champ, Tom Segura. "}, {"comment_id": "ebp7qvp", "post_id": "a5tqxx", "comment": "OH man oh man, I almost just spat out my morning coffee. Amazing! "}, {"comment_id": "ebp5aup", "post_id": "a5tqxx", "comment": "This is great. \nI think you need to figure out your backgrounds a little more though. Just making. Them more consistent in some way. You are also missing some opportunities to make the figure pop out a little more. That’s all. "}, {"comment_id": "ebp8wsc", "post_id": "a5tqxx", "comment": "What’s wrong with the background?"}, {"comment_id": "ebp7p98", "post_id": "a5tqxx", "comment": "Time to show this to all the basketball fans in my school"}, {"comment_id": "ebp8577", "post_id": "a5tqxx", "comment": "Damn is the tip of Shaq's ear really that pointy? I never noticed"}, {"comment_id": "ebp9gxf", "post_id": "a5tqxx", "comment": "That's the ear piece he's wearing for the show the original image is from.\n\nEdit to add [link to image.](https://i.redd.it/gr9b0nb2mrvz.jpg)"}, {"comment_id": "ebpaomh", "post_id": "a5tqxx", "comment": "The Big Elf"}, {"comment_id": "ebpfgc7", "post_id": "a5tqxx", "comment": "Part Vulcan."}, {"comment_id": "ebp8p3f", "post_id": "a5tqxx", "comment": "It's like a regular sized adult with a kool burst. "}, {"comment_id": "ebp9zov", "post_id": "a5tqxx", "comment": "This tickled a part of me I didn’t know existed. Thanks for posting!"}, {"comment_id": "due1rk4", "post_id": "7y6m7a", "comment": "Use the bones on an altar for that extra XP!"}, {"comment_id": "due227c", "post_id": "7y6m7a", "comment": "Or grind them at the ectophuntus."}, {"comment_id": "due2pl2", "post_id": "7y6m7a", "comment": "/r/unexpectedrunescape"}, {"comment_id": "due3kuj", "post_id": "7y6m7a", "comment": "Came here to say that, stayed here for the xp."}, {"comment_id": "due3c5i", "post_id": "7y6m7a", "comment": "Nice"}, {"comment_id": "due5479", "post_id": "7y6m7a", "comment": "Make sure it’s at a POH."}, {"comment_id": "due32rt", "post_id": "7y6m7a", "comment": "We're leaking again"}, {"comment_id": "due221o", "post_id": "7y6m7a", "comment": "I tried it but it didn't work on the latest patch."}, {"comment_id": "due3zyv", "post_id": "7y6m7a", "comment": "What do I do with the scales?"}, {"comment_id": "duecfdi", "post_id": "7y6m7a", "comment": "Already have 200m xp."}, {"comment_id": "dued367", "post_id": "7y6m7a", "comment": "Gilded altar** need that 200% bonus otherwise you’re just wasting your time "}, {"comment_id": "duegljk", "post_id": "7y6m7a", "comment": "I’m more of a rare candy kind of guy!"}, {"comment_id": "duey6n1", "post_id": "7y6m7a", "comment": "The Wilderness Chaos Temple in lv 14 wilderness is also a decent place to grind some prayer. You can withdraw bones at the nearby NPC Simon. It can be a little nerve wracking at times, especially if you see someone else there, but just go in wearing nothing, willing to risk an inventory of bones on death, and it's pretty good xp, without messing around with a gilded altar, lighting incense burners, longer runs to the bank, unnoting at butlers or all that jazz.\n\n\n"}, {"comment_id": "duf09s7", "post_id": "7y6m7a", "comment": "😂😂😂😂"}, {"comment_id": "due7ce1", "post_id": "7y6m7a", "comment": "Or smith em into badass armor"}, {"comment_id": "due0z9b", "post_id": "7y6m7a", "comment": "Its confirmed! Dragons can't swim"}, {"comment_id": "duefkgs", "post_id": "7y6m7a", "comment": "Pff, no flyers can swim "}, {"comment_id": "duegtd3", "post_id": "7y6m7a", "comment": "So that’s where they all went"}, {"comment_id": "duehk2v", "post_id": "7y6m7a", "comment": "Explains the first Spyro game"}, {"comment_id": "duehlwa", "post_id": "7y6m7a", "comment": "Also pretty sure that guy is facing the wrong way, you row with your back to the bow."}, {"comment_id": "dueimw7", "post_id": "7y6m7a", "comment": "Thats racist, I for one, am a water dragon and i can swim just fine.!"}, {"comment_id": "due3uv5", "post_id": "7y6m7a", "comment": "The loot probably consists of dragon bone, elvish arrows, and probably like 400 gold. "}, {"comment_id": "due4b73", "post_id": "7y6m7a", "comment": "Yeah but dem Dragon bones will weigh you down do its best to sell them to the next vendor"}, {"comment_id": "due29yw", "post_id": "7y6m7a", "comment": "Loot: Dragon Bone S, Dragone Bone S, aaannnnddd Dragone Bone S "}, {"comment_id": "due3806", "post_id": "7y6m7a", "comment": "Maybe my Palico got something coo— aaaand it’s a Dragon Bone S. "}, {"comment_id": "due354y", "post_id": "7y6m7a", "comment": "This is the comment i was last looking for. "}, {"comment_id": "due5w8s", "post_id": "7y6m7a", "comment": "Didnt play monster hunter since the PSP and still i instantly knew! I need monster hunter world on pc like right now! =/"}, {"comment_id": "due9ngp", "post_id": "7y6m7a", "comment": "Aaaah great to see the monhun community grow"}, {"comment_id": "dueb20o", "post_id": "7y6m7a", "comment": "Don’t forget large monster bone."}, {"comment_id": "due2b9q", "post_id": "7y6m7a", "comment": "Is very cool, but don't most row boats have the person rowing facing backwards? "}, {"comment_id": "due31pd", "post_id": "7y6m7a", "comment": "It’s faster, but you can definitely row facing forwards, especially if you’re wanting to see where you’re going.  "}, {"comment_id": "due2kup", "post_id": "7y6m7a", "comment": "dang.  I didn't notice and now it's kind of ruined for me.\n\nstill really cool though."}, {"comment_id": "due752m", "post_id": "7y6m7a", "comment": "[Here I fixed it for you <3](https://imgur.com/MnStSPD)"}, {"comment_id": "due2ph4", "post_id": "7y6m7a", "comment": "He could just be turning around to get a better look at the dragon."}, {"comment_id": "due4521", "post_id": "7y6m7a", "comment": "Good eye! "}, {"comment_id": "due2mo3", "post_id": "7y6m7a", "comment": "I was thinking the same. Why is this guy rowing the wrong way around?"}, {"comment_id": "due2x16", "post_id": "7y6m7a", "comment": "Wow wow wow... There is a DRAGON!\nWho cares what way he is rowing... A dragon! "}, {"comment_id": "due6akb", "post_id": "7y6m7a", "comment": "RUINED"}, {"comment_id": "due9ukq", "post_id": "7y6m7a", "comment": "Damn, it’s a fake. "}, {"comment_id": "dueb0cv", "post_id": "7y6m7a", "comment": "While that is usually true, it doesn't *have* to be true. A novice could very easily get it wrong. Rowing backwards is just easier because you're pulling instead of pushing, which means you can rock backwards to assist your muscles a bit. But a novice might think that pushing would be easier because you can lean into it."}, {"comment_id": "duecnvu", "post_id": "7y6m7a", "comment": "Maybe he's trying to work his triceps. Don't hate."}, {"comment_id": "due2njn", "post_id": "7y6m7a", "comment": "Additionally, the oars are flat in the water. From this perspective we shouldn't see the face of the oar if it's being used to row. Sick photo, petty critiques aside "}, {"comment_id": "due5iqi", "post_id": "7y6m7a", "comment": "He doesnt look like a professional sailer, but more of a casual adventurer with his backwards baseball hat, t shirt over long sleeve and jeans"}, {"comment_id": "due3ffv", "post_id": "7y6m7a", "comment": "Actually if he was rowing backwards towards the dragon that would increase suspense factor by 100000x. Still, love this so much - great work!"}, {"comment_id": "due8692", "post_id": "7y6m7a", "comment": "Maybe he’s rowing away from the bones?"}, {"comment_id": "duedt96", "post_id": "7y6m7a", "comment": "You can drift into an embankment in this direction with no real penalty while attaining the view. This is totally feasible "}, {"comment_id": "due6cbm", "post_id": "7y6m7a", "comment": "I was hoping I wasn't the only one that noticed that"}, {"comment_id": "due6yj7", "post_id": "7y6m7a", "comment": "Hey give him a break clearly this is a fantasy land, where you can row which ever way you please."}, {"comment_id": "duegfx3", "post_id": "7y6m7a", "comment": "Yeah... you haven't seen his abs, have you?"}, {"comment_id": "duek2al", "post_id": "7y6m7a", "comment": "Don’t look at the water reflections too much either"}, {"comment_id": "dujoa31", "post_id": "7y6m7a", "comment": "Maybe today's his chest day."}, {"comment_id": "due7gv0", "post_id": "7y6m7a", "comment": "My immersion is destroyed!  "}, {"comment_id": "due8f9e", "post_id": "7y6m7a", "comment": "Yeah. You’d think you’d do at least that much research before spending time on a painting "}, {"comment_id": "due2tno", "post_id": "7y6m7a", "comment": "Maybe he’s rowing away from the dragon"}, {"comment_id": "due5035", "post_id": "7y6m7a", "comment": "OH MY GOD IS IT REALLY THAT BIG OF A FUCKING DEAL? WHY CAN'T Y'ALL JUST SHUT THE FUCK UP AND ENJOY THINGS?"}, {"comment_id": "due0sal", "post_id": "7y6m7a", "comment": "Poor dragon 🐉 "}, {"comment_id": "due2e0y", "post_id": "7y6m7a", "comment": "/r/SympatheticMonsters "}, {"comment_id": "due4rif", "post_id": "7y6m7a", "comment": "This is good inspiration for a story about a dragon. Not sure if this would be the beginning or the end of the story, though."}, {"comment_id": "duealms", "post_id": "7y6m7a", "comment": "looks like it's a wyvern"}, {"comment_id": "dudz8tn", "post_id": "7y6m7a", "comment": "Xpost from /r/ImaginaryMindscapes and /r/ImaginaryDragons\n\n\nsource: https://www.artstation.com/stefankoidl"}, {"comment_id": "due2f7v", "post_id": "7y6m7a", "comment": "Amazing work"}, {"comment_id": "due3nip", "post_id": "7y6m7a", "comment": "Any way you can get a print of this? "}, {"comment_id": "dueaa82", "post_id": "7y6m7a", "comment": "Are there dragons?"}, {"comment_id": "due3okc", "post_id": "7y6m7a", "comment": "Is there any artist similar to this?"}, {"comment_id": "due37tc", "post_id": "7y6m7a", "comment": "Mermaid by Sergey Kolesov\n\nhttps://cdn.cgsociety.org/t/g60/193560/1171088_orig.jpg"}, {"comment_id": "due3to6", "post_id": "7y6m7a", "comment": "came here to say this. also hi Jordy"}, {"comment_id": "due6q2c", "post_id": "7y6m7a", "comment": "fishing by sandara. https://sandara.deviantart.com/art/fishing-285505519\n\nI feel like this is becoming a meme, i swear a year ago i saw someone else do a similar painting and people said ut looked just like sandaras. "}, {"comment_id": "dued832", "post_id": "7y6m7a", "comment": "Seen this before but just noticed there dragging her up and there’s blood in the water. Fuck you darphin and fuck you wharrle"}, {"comment_id": "due9y1j", "post_id": "7y6m7a", "comment": "The same painting came to my mind."}, {"comment_id": "due2xyg", "post_id": "7y6m7a", "comment": "Inb4 it gets reposted to /r/Submechanophobia , /r/Thalassophobia , and /r/TheDepthsBelow"}, {"comment_id": "due9s2s", "post_id": "7y6m7a", "comment": "Also /r/Subnautica."}, {"comment_id": "duejqh4", "post_id": "7y6m7a", "comment": "also /r/Defenders"}, {"comment_id": "due1evv", "post_id": "7y6m7a", "comment": "[deleted]"}, {"comment_id": "due3u5l", "post_id": "7y6m7a", "comment": "I didn't see the \"me\" at first and the thing felt like a screencap from a subbed legendary anime, now I'm it doesn't exist."}, {"comment_id": "due3id7", "post_id": "7y6m7a", "comment": "Thank you for this. I laughed."}, {"comment_id": "due2njc", "post_id": "7y6m7a", "comment": "ELI5 I know nothing about this type of art, and i see a ton of really great stuff on the artist page. Compared with other mediums, how difficult is this to make, what is the time commitment?"}, {"comment_id": "due3vjm", "post_id": "7y6m7a", "comment": "> Compared with other mediums, how difficult is this to make, what is the time commitment?\n\nDepends entirely on your skill level.\n\nThere are people who could effectively communicate something like this in about an hour or two. Others might take closer to 15-20. Time commitment to get to the level where you can actually make something like this is at least a couple thousand hours of practice.\n\nIn terms of how much easier or more difficult it is compared to other mediums also depends. You will be fastest with whatever medium you're most comfortable in and you find any medium that you're uncomfortable in to be difficult. Assuming an even playing field (i.e. you're equally comfortable in both digital and tradtional mediums like oils or acrylics). Digital will almost certainly be *faster*. Not because anything is necessarily being done *for* you. But things like color selection and mistake correction are made more efficient than in dealing with physical pigmented paints. Instead of mixing a color..you can simply pick it (the knowledge of which color to pick still has to be there...it's just that digital speeds up the process of *getting to* that color).\n\nTools required: A Wacom tablet or other pressure sensitive tablet (hooks up to PC via usb). A PC. A digital painting program (ranging from professional options like Photoshop or Corel Painter to free alternatives like Krita).\n\n"}, {"comment_id": "due6sj0", "post_id": "7y6m7a", "comment": "[This guy](https://www.youtube.com/watch?v=ykOK_obacVQ) (Warning: spook alert) does a very cool timelapse of one of his digital pieces. I'm not sure if that's the same kind of process used in this piece, but it gives you an idea of what it usually looks like."}, {"comment_id": "due680u", "post_id": "7y6m7a", "comment": "It's more difficult as you have to learn lots more different tricks to make your art look good and sharp. Physical mediums are hard to master but they are easier as you just need to remember what tools you used and how. Digital work needs settings, tools, and then whatever effects and layer styles and whatever else. And then when you are finished and decide to show it off people think that it is much easier to create because you used technology."}, {"comment_id": "due2a7t", "post_id": "7y6m7a", "comment": "r/thalassophobia and r/skyrim would like a word "}, {"comment_id": "due3yy5", "post_id": "7y6m7a", "comment": "Came here to say r/skyrim"}, {"comment_id": "due9rhr", "post_id": "7y6m7a", "comment": "Don’t forget the lovely game /r/Subnautica!"}, {"comment_id": "due68oj", "post_id": "7y6m7a", "comment": "More like r/elderscrollsonline considering the newest DLC is literally called \"Dragon Bones\"."}, {"comment_id": "due2eg4", "post_id": "7y6m7a", "comment": "Gorgeous.  Reminds me of Smaug's grave in the Long Lake."}, {"comment_id": "duebrct", "post_id": "7y6m7a", "comment": "Just finished rereading this. Seeing this was so cool. "}, {"comment_id": "due3hg9", "post_id": "7y6m7a", "comment": "That looks straight outta subnautica"}, {"comment_id": "due37f2", "post_id": "7y6m7a", "comment": "Reminds me of this [mtg card](https://www.cardkingdom.com/images/magic-the-gathering/chronicles/dandan-11950-medium.jpg)"}, {"comment_id": "due5a0l", "post_id": "7y6m7a", "comment": "Island home, what a shitty mechanic."}, {"comment_id": "duemtww", "post_id": "7y6m7a", "comment": "I was going to say that, but I couldn't remember the name of it. "}, {"comment_id": "due2j2i", "post_id": "7y6m7a", "comment": "The boat is going backwards.\n\nOtherwise, a beautiful visual."}, {"comment_id": "due6g67", "post_id": "7y6m7a", "comment": "Rower facing the wrong direction."}, {"comment_id": "due4jh1", "post_id": "7y6m7a", "comment": "that person is backwards in the rowboat"}, {"comment_id": "due27ig", "post_id": "7y6m7a", "comment": "This reminds me of when Jorah and Tyrion are traveling through the ruins of Old Valyria by boat and see Drogon overhead. Very cool"}, {"comment_id": "due3a0a", "post_id": "7y6m7a", "comment": "Viserion in the summer if the Night King didn't have those chains."}, {"comment_id": "duebuhu", "post_id": "7y6m7a", "comment": ":("}, {"comment_id": "due1xd9", "post_id": "7y6m7a", "comment": "This looks really cool. Lol at all the runescape comments "}, {"comment_id": "due3713", "post_id": "7y6m7a", "comment": "Why is the person sitting in the wrong direction?"}, {"comment_id": "due27b4", "post_id": "7y6m7a", "comment": "Looks like *somebody* is inspired by Sergey Kolesov!! :D"}, {"comment_id": "due4az6", "post_id": "7y6m7a", "comment": "Hahaha! I literally just said that to someone before I saw this. It seems someone does something like his painting every other year. I recall seeing someone doing a similar work of art a few years ago. "}, {"comment_id": "due2lpr", "post_id": "7y6m7a", "comment": "hahaha thought no one would mention"}, {"comment_id": "dudzvlq", "post_id": "7y6m7a", "comment": "Looks to actually be a Wyvern. Dragons have 4 legs."}, {"comment_id": "due0qr2", "post_id": "7y6m7a", "comment": "Mythical, imaginary creatures don’t have fixed classifications, depends on the lore."}, {"comment_id": "due2d2o", "post_id": "7y6m7a", "comment": "Wyverns are a type of dragon. "}, {"comment_id": "due20u0", "post_id": "7y6m7a", "comment": "Dragons can have any combination of legs and wings, wyverns are fixed."}, {"comment_id": "due2n74", "post_id": "7y6m7a", "comment": "No flying creature ever on Earth had four legs. Wouldn't make sense to give them four. But they are fiction so who cares?"}, {"comment_id": "due2qhx", "post_id": "7y6m7a", "comment": "Dragons aren't real"}, {"comment_id": "due33d8", "post_id": "7y6m7a", "comment": "r/fakealbumcovers someone pls"}, {"comment_id": "due3ljy", "post_id": "7y6m7a", "comment": "make me think of Sunless Sea （a video game）"}, {"comment_id": "due4pni", "post_id": "7y6m7a", "comment": "IDK if anyone plays MTG, but this would make an amazing artwork for a promo Polluted Delta. The flavor text on the card reads \"Where Dragons once prevailed, their bones now sink\". "}, {"comment_id": "due6k02", "post_id": "7y6m7a", "comment": "Viserion if he wasn't raised from the dead"}, {"comment_id": "due8d9f", "post_id": "7y6m7a", "comment": "Makes me think of the lost river in subnautica "}, {"comment_id": "due9jrs", "post_id": "7y6m7a", "comment": "Oh man, this should be the ultimate underwater sculpture.  I would row a boat over that thing daily."}, {"comment_id": "duea16g", "post_id": "7y6m7a", "comment": "Same!"}, {"comment_id": "duebsxp", "post_id": "7y6m7a", "comment": "This is such a pleasant and fascinating art piece. It has effectively created a story for me. "}, {"comment_id": "dueg94h", "post_id": "7y6m7a", "comment": "By the end of the day this image will be photoshopped into news articles all over Facebook telling us about the irrefutable evidence of the existence of dragons discovered in the Caribbean."}, {"comment_id": "duenx7q", "post_id": "7y6m7a", "comment": "My first reaction was \"Cool, I wonder where this picture was taken?\" I'm not a smart man. "}, {"comment_id": "due2a7q", "post_id": "7y6m7a", "comment": "r/thalassophobia would enjoy this so much"}, {"comment_id": "due78kc", "post_id": "7y6m7a", "comment": "Yep! Came to find this comment :)"}, {"comment_id": "duenqeu", "post_id": "7y6m7a", "comment": "\"enjoy\""}, {"comment_id": "due30v6", "post_id": "7y6m7a", "comment": "Reminds me of the boat floating over the giant mermaid. Both beautiful pieces. "}, {"comment_id": "due32i4", "post_id": "7y6m7a", "comment": "This would be an awesome wallpaper engine background"}, {"comment_id": "due3brh", "post_id": "7y6m7a", "comment": "Reminds me of Elder Scrolls. It had a Dragon Bones DLC. Here's some related information I found. https://www.reddit.com/r/elderscrollsonline/comments/7xw4ky/the_og_dragon_bones/\n"}, {"comment_id": "due3mk9", "post_id": "7y6m7a", "comment": "Anyone else’s phone crash when they click the comments for that video "}, {"comment_id": "due433e", "post_id": "7y6m7a", "comment": "Items Found:\n\nQuality Bone+\n\nMonster Bone S\n\nMonster Bone S"}, {"comment_id": "due4kfs", "post_id": "7y6m7a", "comment": "It reminds me a lot of this:\nhttps://www.artstation.com/artwork/18R6q"}, {"comment_id": "due4rr2", "post_id": "7y6m7a", "comment": "I could see this being a scene in Chrono Cross."}, {"comment_id": "due5ptv", "post_id": "7y6m7a", "comment": "I'm sure some blogs will use this as a clickbait thumbnail for their article. "}, {"comment_id": "due6bkg", "post_id": "7y6m7a", "comment": "This is the best artwork I have seen in a while man."}, {"comment_id": "due6eb2", "post_id": "7y6m7a", "comment": "Someone make a wallpaper engine wallpaper w this pls "}, {"comment_id": "due7doc", "post_id": "7y6m7a", "comment": "This! First thing I thought when I saw it."}, {"comment_id": "due6ujd", "post_id": "7y6m7a", "comment": "Westeros, a million years later."}, {"comment_id": "due93k4", "post_id": "7y6m7a", "comment": "You're just scrapping for that Karma."}, {"comment_id": "due9uzk", "post_id": "7y6m7a", "comment": "I think Game of Thrones would be a really cool world to do a “300 years later” of like a WW1 setting."}, {"comment_id": "duebsv4", "post_id": "7y6m7a", "comment": "This will be a thumb nail for a countdown video somewhere. "}, {"comment_id": "dueecbx", "post_id": "7y6m7a", "comment": "Reminds me of Sunless Sea"}, {"comment_id": "duejhfg", "post_id": "7y6m7a", "comment": "Why has nobody done this as a diving attraction?"}]