[{"comment_id": "dwpgyzd", "post_id": "897dg6", "comment": "You are pretty talented. The best is that haven’t give up. Truly an inspiration. "}, {"comment_id": "dwpid8w", "post_id": "897dg6", "comment": "Thanks a lot! Boredom can be a huge motivator. Art keeps me busy "}, {"comment_id": "dwpyldo", "post_id": "897dg6", "comment": "You’re an inspiration mate, love your art style btw.  "}, {"comment_id": "dwpwrag", "post_id": "897dg6", "comment": "Looking at the differences between the 2 drawings, I wouldn’t say he is talented. It looks to me more like hard work and dedication. Truly an inspiration nonetheless."}, {"comment_id": "dwpqdhw", "post_id": "897dg6", "comment": "That first drawing was utter shit bro. "}, {"comment_id": "dwphmb3", "post_id": "897dg6", "comment": "Fantastic! I really dig the portrait. Is there somewhere to see more of your work?   \nEdit: I'm totally unaffiliated with this person. Just genuinely want to know. "}, {"comment_id": "dwpimb2", "post_id": "897dg6", "comment": "Thanks so much! Yes you can follow my IG at natebibaud. I sell prints and originals at flatearthdesigns.etsy.com and my personal website is nathanielbibaud.com"}, {"comment_id": "dwpjpmm", "post_id": "897dg6", "comment": "A lot of people have asked so here’s the artists statement and bio I used for a recent show in my hometown. As well as where to find me!\n\nARTISTS STATEMENT \n“Art is something I always had an interest in, but the pursuit of which sometimes got lost for me in the race of life. Unfortunately I experienced a serious injury, which although traumatic, allowed me the chance to slow down and reassess my life. Creating art became a huge part of my recovery. Not only was it therapeutic physically, as it helped my regain strength and dexterity. But it also gave me a way to improve myself mentally, a way to see and appreciate what was around me, and a skill to harness and be proud of. Creation is an outlet to make sense of an otherwise senseless situation.”\n\nBIO\nNathaniel is a 33 year old local artist, residing in Amesbury MA. He studied architecture at the Wentworth Institute of Technology, graduating in 2009. Upon graduation he went to work in his field, consulting for a local residential design firm. In early 2010 he relocated to St. Croix, in the US Virgin Islands to work in print & marketing as a graphic/web designer. He worked for close to a year until a serious car accident in December of 2010 left him paralyzed and without the use of his hands. He began drawing very simple pictures, with assistance, as therapy while in the hospital. After a few months, he moved back home and started in on a vigorous therapy schedule. As time passed by and he gained enough strength to draw on his own, his control and ability slowly increased. After concentrating mainly on black-and-white pen drawings for the first year or so, he started introducing color to his projects using Photoshop and eventually moved on to painting. Computer aided graphics have become a large part of his creative process. Most of his drawings and paintings are laid out and experimented with in Photoshop before putting pen or paint to paper and canvas. From his home studio, Nathaniel works mainly in pen and ink, watercolor, or oil paint. Spending much of his time experimenting with styles in his work, he also is commissioned often to create traditional portrait paintings of people and animals.\n\nFIND ME\nIG: @natebibaud\nFB: Nathaniel Bibaud Art & Design\nSTORE: flatearthdesigns.etsy.com\nWEB: nathanielbibaud.com"}, {"comment_id": "dwppyp5", "post_id": "897dg6", "comment": "Your work is really beautiful. I admire your determination. I have some work on Saatchi (Beth Sandig) & recently closed my Etsy shop to go back to school. Best of luck to you!"}, {"comment_id": "dwpsi9v", "post_id": "897dg6", "comment": "I know this is a stupid question, maybe only slightly \nAre you still fully paralyzed then? Or were you only able to regain some control on your hands?"}, {"comment_id": "dwpl1ld", "post_id": "897dg6", "comment": "So, OP are you the artist or not? Are you typing this all down for him?\n\nNot trying to be rude, genuinely wondering due to the third person text and all"}, {"comment_id": "dwpxab7", "post_id": "897dg6", "comment": "What’s your condition like nowadays? curious on your progress "}, {"comment_id": "dwq1le1", "post_id": "897dg6", "comment": "Way to overcome, my friend. You are a HUGE inspiration. Blessings."}, {"comment_id": "dwpncv8", "post_id": "897dg6", "comment": "Lol flat earth designs I love it. It that a metaphor for something? Or do you think the moon landing was staged?"}, {"comment_id": "dwpsalw", "post_id": "897dg6", "comment": "[deleted]"}, {"comment_id": "dwpivvt", "post_id": "897dg6", "comment": "artist and OT here--first off, fucking beautiful work. watercolors suuuuck and you clearly have a great command over them. secondly, where was your break? C6/C7? what kinds of adaptive equipment do you use to paint?"}, {"comment_id": "dwpj4tr", "post_id": "897dg6", "comment": "Thanks! I am C5 complete. I wear a wrist splint to keep my hand and wrist steady. I have an attachment that is made to hold a fork and I jam a paintbrush or a pen in it instead. I could upload a couple photos of me working but I’m not sure where to. I’m new to reddit. "}, {"comment_id": "dwpnwmu", "post_id": "897dg6", "comment": "I’m so incredibly happy for you. My ex broke his neck and was paralyzed from C2, which I’m sure you know means he was on a ventilator. He didn’t improve, unfortunately. But his attitude was always positive. Go you. "}, {"comment_id": "dwpo255", "post_id": "897dg6", "comment": "Thank you. I’m sorry to hear about your husband. "}, {"comment_id": "dwphdby", "post_id": "897dg6", "comment": "i wish I could draw as well as even that first pic"}, {"comment_id": "dwpig8p", "post_id": "897dg6", "comment": "Work hard and someday you too can draw like you’re in kindergarten again! 😁"}, {"comment_id": "dwq18db", "post_id": "897dg6", "comment": "All you have to do is break your neck. Just do it!"}, {"comment_id": "dwpni1m", "post_id": "897dg6", "comment": "How did you break your neck"}, {"comment_id": "dwpnmjs", "post_id": "897dg6", "comment": "Passenger in a car accident. No seatbelt "}, {"comment_id": "dwphiz1", "post_id": "897dg6", "comment": "Amazing work and progress! You should crosspost this to r/succulents "}, {"comment_id": "dwpioph", "post_id": "897dg6", "comment": "Thanks maybe I will!"}, {"comment_id": "dwpp4ce", "post_id": "897dg6", "comment": "Love the shout out to your CTRS, as rec therapists do amazing work that is sometimes overshadowed or not seen as important as our sister therapies. I am proud to be a recreational therapist, and am so happy that you were able to receive rec therapy. Your art work is amazing! "}, {"comment_id": "dwppbxd", "post_id": "897dg6", "comment": "You have the best job in the place. You may be over shadowed but you have the most fun and you can have a great affect on people "}, {"comment_id": "dwphrz4", "post_id": "897dg6", "comment": "My drawing skills are the same but the top part is where I'm at now and the bottom is where I want to be able to draw"}, {"comment_id": "dwpjuqm", "post_id": "897dg6", "comment": "Keep working! Follow other artists that inspire you. Practice by trying to emulate your favorite artists styles until you begin to find your own!"}, {"comment_id": "dwpi2l1", "post_id": "897dg6", "comment": "[deleted]"}, {"comment_id": "dwpjw3w", "post_id": "897dg6", "comment": "Thank you so much!"}, {"comment_id": "dwpndzo", "post_id": "897dg6", "comment": "How much mobility have you regained?"}, {"comment_id": "dwpnklf", "post_id": "897dg6", "comment": "I’m pretty much a basic C5. But I’ve done a lot of therapy for the last seven years and combined with painting, I’ve gained decent trunk control. But my hands wrists and triceps don’t work. I basically draw from my shoulder and elbow. "}, {"comment_id": "dwptzd9", "post_id": "897dg6", "comment": "Wait, you can break your neck and survive?\n\nSo in all those movies, when protagonist breaks necks of guards etc, there is a chance that some of them are left paralyzed?"}, {"comment_id": "dwpu6sj", "post_id": "897dg6", "comment": "I always think the same thing"}, {"comment_id": "dwpggau", "post_id": "897dg6", "comment": "Were you an artist before becoming paralyzed, or is it a hobby you picked up because of therapy?"}, {"comment_id": "dwphznp", "post_id": "897dg6", "comment": "I studied architecture in college, and dabbled a little in graphic design before my accident. This began as Will be in the hospital, and then became a Hari. I didn’t have much else to do for the first couple of years after my accident so I threw a lot. I started to take it more seriously as the years passed and I got into oil painting and watercolors. Now it’s my full-time job. You can find out more about me and my work at nathanielbibaud.com and my IG name is natebibaud "}, {"comment_id": "dwpk84h", "post_id": "897dg6", "comment": "Just went through all your social media platforms and need to get my hands on something of yours as soon as I can. I love the style and the energy your art gives off to me. Thanks for being you."}, {"comment_id": "dwpkuwt", "post_id": "897dg6", "comment": "Thank you so much that means a lot. Such a great compliment. I really appreciate it. Feel free to contact me if you ever want a custom painting. I love portraits but I’ll do anything really. Have a nice night!"}, {"comment_id": "dwphqaq", "post_id": "897dg6", "comment": "Very nice work. "}, {"comment_id": "dwpjqxg", "post_id": "897dg6", "comment": "Thanks!"}, {"comment_id": "dwplstz", "post_id": "897dg6", "comment": "Love the monster jade plant!"}, {"comment_id": "dwpno3c", "post_id": "897dg6", "comment": "Not to get off topic about your amazing art but have you implemented Hyperbaric therapy at all ? I run a chamber and have had mind blowing results with many people. I am now working with a three year post accident, totally immobile and he is now lifting himself out of his chair. I know all\nInjuries are specific in nature but I was just wondering if it was offered to you or not. "}, {"comment_id": "dwpo4ky", "post_id": "897dg6", "comment": "I’ve never tried it. I honestly don’t know anything about it but I’d definitely check it out"}, {"comment_id": "dwprzm7", "post_id": "897dg6", "comment": "Mind me asking, but how’d you break your neck?"}, {"comment_id": "dwpsgnw", "post_id": "897dg6", "comment": "Car accident"}, {"comment_id": "dwpsv7z", "post_id": "897dg6", "comment": "OP stated upthread that he was in a car wreck--as a passenger, not wearing a seatbelt.                                                                                                                        "}, {"comment_id": "dwpnoet", "post_id": "897dg6", "comment": "Is that a Bruin OP"}, {"comment_id": "dwpnzqi", "post_id": "897dg6", "comment": "Yep. I was in Spaulding which was next door to the garden at that time. That was the season they won the cup"}, {"comment_id": "dwpqyfo", "post_id": "897dg6", "comment": "Are you as proud of Ashley as she is of you? I’m proud of both of you without ever having met either of you. "}, {"comment_id": "dwpruzy", "post_id": "897dg6", "comment": "I love Ashley she’s a really good friend of mine! I just saw her the other day. She’s great"}, {"comment_id": "dwprvu7", "post_id": "897dg6", "comment": "I love Ashley she’s a really good friend of mine! I just saw her the other day. She’s great"}, {"comment_id": "dwq0rdt", "post_id": "897dg6", "comment": "Probably the only redditor curious, but did you ask Ashley out?"}, {"comment_id": "dwpf5kn", "post_id": "897dg6", "comment": "Beautiful!"}, {"comment_id": "dwpfv7y", "post_id": "897dg6", "comment": "Thanks!"}, {"comment_id": "dwpfz2r", "post_id": "897dg6", "comment": "Kudos to you. Never ever stop also!"}, {"comment_id": "dwphjne", "post_id": "897dg6", "comment": "Thanks! You got it"}, {"comment_id": "dwpof96", "post_id": "897dg6", "comment": "How is life since you’ve been paralyzed? Have you been able to find fulfillment in your life or is it a constant struggle to find happiness?\n\nI’ve heard that in the end regardless of what happens to us whether it’s win the lottery or a life changing event like paralysis that our happiness usually revert to where we were before the life changing event."}, {"comment_id": "dwporw8", "post_id": "897dg6", "comment": "It was rough for the first few years. Accepting your new life takes a while. But it gets better. It takes work too though. It’s easy to let yourself wallow and shut yourself off from people. Gotta fight that"}, {"comment_id": "dwppzaz", "post_id": "897dg6", "comment": "Next Frida Kahlo!"}, {"comment_id": "dwpwc22", "post_id": "897dg6", "comment": "Hey man mad props! I've been recently paralyzed (1.5 yrs) so I understand part of what you've gone through. Your're art really shows how much you've improved as an artist and what physical therapy has done for you. I hope to make serious improvement like you have done through PT. This gives we some hope/motivation. Keep on keeping on!"}, {"comment_id": "dwrm5rv", "post_id": "897dg6", "comment": "Keep working! Even if you just work out with someone at home and move around as much as you can it helps."}, {"comment_id": "dwq1hx8", "post_id": "897dg6", "comment": "Wow, that's amazing progress.  Ashley has gotten a ton better! "}, {"comment_id": "dwrlrvg", "post_id": "897dg6", "comment": "😂"}, {"comment_id": "dwq5iu9", "post_id": "897dg6", "comment": "Amazing! You are an inspiration for many. Never give up!"}, {"comment_id": "dwq5lnf", "post_id": "897dg6", "comment": "awesome work dude \n"}, {"comment_id": "dwpgd89", "post_id": "897dg6", "comment": "I like it, good work."}, {"comment_id": "dwphlc0", "post_id": "897dg6", "comment": "Thanks!"}, {"comment_id": "dwpgeka", "post_id": "897dg6", "comment": "Yes!!!! You are awesome big guy!!! That's huge! ✌️👌🙏🙌"}, {"comment_id": "dwphnnf", "post_id": "897dg6", "comment": "Thanks!"}, {"comment_id": "dwpp1xf", "post_id": "897dg6", "comment": "We take so much for granted. I bitch about my problems and then I see this and my problems seem so meaningless. You’ve become quite the artist and you’re story is inspiring!"}, {"comment_id": "dwpjwq3", "post_id": "897dg6", "comment": "This needs more upvotes ❤️"}, {"comment_id": "dwpiybn", "post_id": "897dg6", "comment": "Inspiring "}, {"comment_id": "dwpkq75", "post_id": "897dg6", "comment": "Thanks! Now get to work "}, {"comment_id": "dwpjh7c", "post_id": "897dg6", "comment": "Awesome!! Reminded me a bit of Frida Kahlo! Keep it up Nate "}, {"comment_id": "dwpmo4i", "post_id": "897dg6", "comment": "Thank you!"}, {"comment_id": "dwpm44f", "post_id": "897dg6", "comment": "First one is like so yay sports! And then you look so overwhelmed... Is that what art does to people?"}, {"comment_id": "dwpmi5v", "post_id": "897dg6", "comment": "It’s what life does to people "}, {"comment_id": "dwpm9rn", "post_id": "897dg6", "comment": "Reminds me of a Frieda Khalo painting, very beautiful. "}, {"comment_id": "dwpmk84", "post_id": "897dg6", "comment": "Wowwww thank you!"}, {"comment_id": "dwpmnu6", "post_id": "897dg6", "comment": "I don't know if it was intentional but when I showed my husband your artwork/image, zoomed in, he said \"it's like he's cracked but put back together again.\" I appreciated the imagery in that statement, considering your circumstances. I love the style of your work-- very impressive! I liked it when I first took a look... I loved it when I zoomed in and really saw the detail. Wow! "}, {"comment_id": "dwpn2z3", "post_id": "897dg6", "comment": "Life is so hard but when I saw this, I can feel the hope "}, {"comment_id": "dwppwod", "post_id": "897dg6", "comment": "Fellow painter here too! I have nerve damage in my dominant hand/arm that made my hand shake for years. It took me awhile to get the control I had back...and that was with damaging one single nerve. I give you SO much credit. You’re incredibly talented and made something out of an incredibly hard situation. Don’t ever stop painting!!"}, {"comment_id": "dwpq65j", "post_id": "897dg6", "comment": "Thanks so much! My hand was very shaky at first. Still is a little "}, {"comment_id": "dwppz2w", "post_id": "897dg6", "comment": "“Bad luck can either break you or make you the person you really are.”"}, {"comment_id": "dwpqpao", "post_id": "897dg6", "comment": "love it. good work. and you’re smoking hot. "}, {"comment_id": "dwrgz6v", "post_id": "897dg6", "comment": "Well damn. Thank you "}, {"comment_id": "dwpqwgu", "post_id": "897dg6", "comment": "6 years on Reddit and I’ve finally found someone to hit that follow button for. Can not wait to see more of your work! Keep it up! "}, {"comment_id": "dwpqzin", "post_id": "897dg6", "comment": "This might just make me bitch about the pt for my broken ankle a little less, maybe. XD Epic progress and an epic piece, keep it up."}, {"comment_id": "dwpr4lj", "post_id": "897dg6", "comment": "I swear we look so much alike, I got confused for a sec xD"}, {"comment_id": "dwpr4yn", "post_id": "897dg6", "comment": "I like the first one because it shows character "}, {"comment_id": "dwpr4z3", "post_id": "897dg6", "comment": "Looool at your first one, man 😂. How far you’ve come is remarkable. I need to get back into it too. "}, {"comment_id": "dwpr78l", "post_id": "897dg6", "comment": "You’re going to be one of those guys that future college students learn about in their art history class."}, {"comment_id": "dwprdvj", "post_id": "897dg6", "comment": "chapeau! If you paralyzed and if you are able to draw, this means you still have haptic senses in your hands, is it right? How do you move your fingers? You have an outstanding power of will, neverless. My respects to you, collegue!"}, {"comment_id": "dwpriwy", "post_id": "897dg6", "comment": "I can’t move my fingers or wrist . I wear a splint and an attachment that holds the paintbrush. I moved from my elbow and shoulders."}, {"comment_id": "et3dn1v", "post_id": "c9vogu", "comment": "This is awesome.  Post more"}, {"comment_id": "et3fm7o", "post_id": "c9vogu", "comment": "Here are a few [more examples](https://m.imgur.com/a/FN3P0hg/zip) \n\nI’m newish to reddit so idk if that linked properly or if I did it right 😬"}, {"comment_id": "et5n3yx", "post_id": "c9vogu", "comment": "Yes please!!!"}, {"comment_id": "et4d9ib", "post_id": "c9vogu", "comment": "Please"}, {"comment_id": "et3duwl", "post_id": "c9vogu", "comment": "That is an amazing idea. This has so many more positive facets for both set of students than what your letting on to. Kudos to you. You are an awe inspiring teacher. We need teachers like you out there, inspiring our kids."}, {"comment_id": "et3h0s6", "post_id": "c9vogu", "comment": "Thank you! I strive to make my classroom a valuable asset (as opposed to being viewed as a babysitting class) and I feel as though this was very successful for all parties involved! \n\nThe art fraternity at the college has already expressed that they enjoyed it and want to make it into a yearly thing!"}, {"comment_id": "et3oz1e", "post_id": "c9vogu", "comment": "Is there a subreddit witch remake/remaster children's drawings such as this? I love the concept of remaking drawings."}, {"comment_id": "et3u0m9", "post_id": "c9vogu", "comment": "Gosh that would be so fun!! If it doesn't already exist I hope it does soon."}, {"comment_id": "et4b7o6", "post_id": "c9vogu", "comment": "Couldn't find anything so I just created one for it\n\nr/CapriSunToChardonnay"}, {"comment_id": "et4jwqa", "post_id": "c9vogu", "comment": "I don’t think so. There’s an artist that does the same thing with his kid. He has a YouTube channel that walks you through his process. He’s a French native living in Tokyo.  Here’s his Instagram: https://instagram.com/thomasintokyo?igshid=zi2iplftsoid"}, {"comment_id": "et4muor", "post_id": "c9vogu", "comment": "Yes. r/imaginationrealized has 5k members"}, {"comment_id": "et46qrr", "post_id": "c9vogu", "comment": "Would also like to remake childrens drawings"}, {"comment_id": "et3ihlf", "post_id": "c9vogu", "comment": "How did your students react when they saw the finished product?"}, {"comment_id": "et3ksq1", "post_id": "c9vogu", "comment": "We had a real gallery opening for them so they got to see their work on display with the collegiate work. And the collegiate students were there as well so the artists got to meet each other and talk about their works.  \n\nThey LOVED it. Seeing my sweet babies show up in their best dress, families in tow and pride on their faces is why I do what I do. \n\nThe best part is that my kiddos got to keep both original pieces of art so that they can forever be reminded of the experience."}, {"comment_id": "et3jqjb", "post_id": "c9vogu", "comment": "This needs to be immediately adopted everywhere!"}, {"comment_id": "et3kwra", "post_id": "c9vogu", "comment": "I would love that!!"}, {"comment_id": "et5sqsx", "post_id": "c9vogu", "comment": "It is a thing already. I’m 20 now but when I was in 4th grade we drew ourselves as superheroes and the seniors at the high school art class redid them their way"}, {"comment_id": "et3h7jz", "post_id": "c9vogu", "comment": "That is ingenious. I imagine both the kids and college students took something away from this."}, {"comment_id": "et3uish", "post_id": "c9vogu", "comment": "Awesome an artist in Tokyo does the same thing for his sons drawings https://instagram.com/thomasintokyo?igshid=zi2iplftsoid"}, {"comment_id": "et4f253", "post_id": "c9vogu", "comment": "Super cool! I love this!"}, {"comment_id": "et5d82u", "post_id": "c9vogu", "comment": "I was about to comment about him too! I love his channel and his speedpaints are really satisfying to watch"}, {"comment_id": "et3unn6", "post_id": "c9vogu", "comment": "I love this. I teach preschool, and it’s quite discouraging how early some children develop a closed mindset - (“I’m not good at that... I just want you to do it for me... he is great at ____ but I am not...etc.”). \n\nI think this lesson would extend beyond art skill to teach them that if they keep working on a skill, they will improve."}, {"comment_id": "et3q90d", "post_id": "c9vogu", "comment": "Yours has four hair strands while the original has two\n\nIf you knew anything about the customs of this species you'd know they wouldn't be caught dead in public with four hair strands smh"}, {"comment_id": "et59t58", "post_id": "c9vogu", "comment": "[deleted]"}, {"comment_id": "et44an3", "post_id": "c9vogu", "comment": "Oh I love this!\n\nOne of my little girls loves to draw. For 6, I think she’s pretty darn talented. She gets frustrated though when she sees me drawing or painting and wants to know why she can’t do it like me.\nI try to explain to her that she’ll get better with age and she’ll learn more as she grows.\nI can’t wait to show her this!\nI think it will boost her confidence a lot."}, {"comment_id": "et4fmes", "post_id": "c9vogu", "comment": "This warms my heart!"}, {"comment_id": "et4y3cg", "post_id": "c9vogu", "comment": "Have you got any of your drawings from when you were the same age? Seeing that you really did Start from a similar place might help her believe she can get to your standard?"}, {"comment_id": "et3i95n", "post_id": "c9vogu", "comment": "So cool and the kids can see how hard work pays off but in an instant way as to inspire!\n\nI love this so much, you are a wonderful teacher and those students lucky to have you as their guide through the world of Art."}, {"comment_id": "et3lrhu", "post_id": "c9vogu", "comment": "It’s teachers like you who truly make a difference. You have found a way to teach “hope and determination”.....Very, very cool."}, {"comment_id": "et3p4m6", "post_id": "c9vogu", "comment": "This reminds me of Thomas Romains father sons' design workshop"}, {"comment_id": "et3j2pu", "post_id": "c9vogu", "comment": "this is such a cool idea!!!"}, {"comment_id": "et3o8ph", "post_id": "c9vogu", "comment": "This is really cool! Post more!"}, {"comment_id": "et3onwz", "post_id": "c9vogu", "comment": "I wish there were more teachers like this in the world!! Thank you so much for going out of your way to teach such a valuable life lesson to those kids."}, {"comment_id": "et3r1rt", "post_id": "c9vogu", "comment": "Amazing!!"}, {"comment_id": "et3rez3", "post_id": "c9vogu", "comment": "That’s such a great idea! I bet they were all very happy haha :)"}, {"comment_id": "et4ftz0", "post_id": "c9vogu", "comment": "I think Randall from Monsters Inc got into some REALLY bad drugs after he joined the skater scene..."}, {"comment_id": "et4hwl0", "post_id": "c9vogu", "comment": "Randall's lack of role models led him to a dark path of drugs and being rad. He's now sponsored by Creature."}, {"comment_id": "et4s42m", "post_id": "c9vogu", "comment": "Honestly, seeing these picture I thought this would’ve been a great way for Pixar to get new monster ideas for monsters Inc if they make another sequel/prequel."}, {"comment_id": "et4gj3x", "post_id": "c9vogu", "comment": "There is an Instagram page that has a similar concept. Children submit drawings of monsters, and then experienced artists do drawings or paintings based off of the child’s drawing.\n\nI think it’s called @projectmymonsta\n\nIt’s pretty cool and fun to see interpretations of the wacky things kids draw."}, {"comment_id": "et4i8j2", "post_id": "c9vogu", "comment": "Awesome I’ll check it out!"}, {"comment_id": "et4t9j2", "post_id": "c9vogu", "comment": "This itself needs it's own sub... best thing I've seen today"}, {"comment_id": "et4u3ax", "post_id": "c9vogu", "comment": "that is more radical than ISIS"}, {"comment_id": "et4uuk6", "post_id": "c9vogu", "comment": "Their ideas may be limitless but their bank accounts won’t be"}, {"comment_id": "et4vguy", "post_id": "c9vogu", "comment": "sad but true. that being said. you can develop your drawing skills by only having paper and pencil on hand. And access to a library. Will they have formal education or certification ? No. But their skills will speak for themselves."}, {"comment_id": "et4xbwt", "post_id": "c9vogu", "comment": "I teach music. This is really cool and you're a good person."}, {"comment_id": "et523ka", "post_id": "c9vogu", "comment": "Aye, go specials! My music co teacher is my work BFF! We’re always trying to collaborate in one way or another. :D"}, {"comment_id": "et57pje", "post_id": "c9vogu", "comment": "YOU are awesome!"}, {"comment_id": "et58ffo", "post_id": "c9vogu", "comment": "You have awesome ideas."}, {"comment_id": "et5dm9o", "post_id": "c9vogu", "comment": "You sound like a good teacher"}, {"comment_id": "et98my8", "post_id": "c9vogu", "comment": "Kids has *unlimited ideas*, while grown ups has the *skills* to bring it all to life. Nice teamwork."}, {"comment_id": "et3mo64", "post_id": "c9vogu", "comment": "You're one of the teachers that there are too few of. What an awesome way to motivate and had to be fun for the college too."}, {"comment_id": "et3mu8q", "post_id": "c9vogu", "comment": "I love this idea! I teach 2nd grade and I'm going to share this with the art teacher in my school!"}, {"comment_id": "et3p477", "post_id": "c9vogu", "comment": "That’s an awesome idea"}, {"comment_id": "et3pb2r", "post_id": "c9vogu", "comment": "I love this"}, {"comment_id": "et3rkrm", "post_id": "c9vogu", "comment": "Fantastic project!!! Not only for the elementary school kids to see and aspire to, but also for the collegiate “kids” to recapture their child-like imagination that unfortunately tends to be fleeting at this stage in life."}, {"comment_id": "et3t152", "post_id": "c9vogu", "comment": "This deserves platinum, but I only only had a gold available to give. Been hanging on to it for a post that deserves it. \n\nWe need more teachers like this in the world."}, {"comment_id": "et3td6h", "post_id": "c9vogu", "comment": "This is great"}, {"comment_id": "et3u36w", "post_id": "c9vogu", "comment": "Ooo, Draw with Jazza has a series like this! There's 5 parts so far I believe. \nhttps://youtu.be/28VfuSMMQOY"}, {"comment_id": "et4evit", "post_id": "c9vogu", "comment": "Thanks! I’ll definitely check it out!!"}, {"comment_id": "et3u5du", "post_id": "c9vogu", "comment": "Nice! Quality nightmare fuel."}, {"comment_id": "et3viyd", "post_id": "c9vogu", "comment": "I think this is a great idea and I wish I could have done it as a child!"}, {"comment_id": "et3vvf8", "post_id": "c9vogu", "comment": "The heart with wings melts my soul"}, {"comment_id": "et3wao5", "post_id": "c9vogu", "comment": "This is such an amazing idea. \n\nAn artist did the same thing at ArtPrize in Grand Rapids, MI last year or the year before and it was easily my favorite entry that year."}, {"comment_id": "et3xdd3", "post_id": "c9vogu", "comment": "Thank you, you are an awesome teacher"}, {"comment_id": "et3y8c9", "post_id": "c9vogu", "comment": "This is amazing and YOU are amazing"}, {"comment_id": "et3yts7", "post_id": "c9vogu", "comment": "i love this. thank you so much for caring about what you’re doing"}, {"comment_id": "et3zh0g", "post_id": "c9vogu", "comment": "Good idea, keep them motivated!"}, {"comment_id": "et3ztdg", "post_id": "c9vogu", "comment": "Please post all of these! I love these because like you said, it shows your little ones that with time, they will improve. But I also think this is really fun for the college students and professors because in my opinion, it’s always really cool to take a very rough or vague drawing and fill in the details, elaborate on it, and just bring it to life a bunch."}, {"comment_id": "et40a1c", "post_id": "c9vogu", "comment": "This is great."}, {"comment_id": "et40end", "post_id": "c9vogu", "comment": "I need to figure out how to do this for when my little one starts drawing!"}, {"comment_id": "et40t8d", "post_id": "c9vogu", "comment": "Such a smart idea!!"}, {"comment_id": "et40zor", "post_id": "c9vogu", "comment": "YES!!!!"}, {"comment_id": "et41dua", "post_id": "c9vogu", "comment": "This is so awesome"}, {"comment_id": "dtsg262", "post_id": "7vi4a2", "comment": "Wow! This is absolutely amazing. You are very talented. Please continue to share your art with the world. Art born from our darkest emotions can have the most potent effect"}, {"comment_id": "dtshlbr", "post_id": "7vi4a2", "comment": "Thank you, I strongly agree. It is heavy subject matter but made with loving devotion.\n\nEDIT: I feel like I should mention here if you wanna see more, my website is www.milesjohnstonart.com, Instagram is @miles_art, and if you're interested in original artwork email info@lastritesgallery.com as I have a show opening with them end of March. Thanks so much for all the kind words, I'm teaching some classes today but can try to reply in the evening"}, {"comment_id": "dtsj2u5", "post_id": "7vi4a2", "comment": "I have had it with these motherfuckin' snakes in my motherfuckin' brain!"}, {"comment_id": "dtsyey0", "post_id": "7vi4a2", "comment": "Have my fuckin upvote"}, {"comment_id": "dtt6kju", "post_id": "7vi4a2", "comment": "!redditsilver"}, {"comment_id": "dttilt4", "post_id": "7vi4a2", "comment": "I've had it with these monkey fighting snakes on this Monday to Friday brain!"}, {"comment_id": "dtsku1q", "post_id": "7vi4a2", "comment": "You should cross-post this to /r/Heavymind.  They would love this."}, {"comment_id": "dtsr710", "post_id": "7vi4a2", "comment": "It was posted there 4 months ago (just browsed top all time)\n"}, {"comment_id": "dtsy0pw", "post_id": "7vi4a2", "comment": "Thanks, what an awesome sub."}, {"comment_id": "dtsuq91", "post_id": "7vi4a2", "comment": "Thats so cool. \nI can draw a stick figure"}, {"comment_id": "dtsxkwh", "post_id": "7vi4a2", "comment": "I can draw two or more stick figures."}, {"comment_id": "dtszfi9", "post_id": "7vi4a2", "comment": "With enough invested time, you could draw this too (:"}, {"comment_id": "dtszuhl", "post_id": "7vi4a2", "comment": "Freakin brag about it geeze. "}, {"comment_id": "dtt8ghi", "post_id": "7vi4a2", "comment": "I can draw a sick figure with his arms up **or** down.  And, get this, I can also turn him into a girl by adding a triangle at her waist.\n\nNext stop, OP-quality pic!"}, {"comment_id": "dtt92ll", "post_id": "7vi4a2", "comment": "Please post!"}, {"comment_id": "dtsgcmu", "post_id": "7vi4a2", "comment": "daaaaaaaaaamn!  that's incredible"}, {"comment_id": "dtsimwa", "post_id": "7vi4a2", "comment": "My personal favorite part of this is how natural you made the stomach."}, {"comment_id": "dtt585y", "post_id": "7vi4a2", "comment": "It really is an amazing drawing"}, {"comment_id": "dtt9ia9", "post_id": "7vi4a2", "comment": "I totally agree!! You almost never see soft, natural bellies in artworks and this just made the work that much more real"}, {"comment_id": "dtsih58", "post_id": "7vi4a2", "comment": "Snakes. Why did it have to be snakes?"}, {"comment_id": "dtt7u3j", "post_id": "7vi4a2", "comment": "Asps! Very dangerous! You go first."}, {"comment_id": "dtsikvo", "post_id": "7vi4a2", "comment": "*sneks "}, {"comment_id": "dtsrh6w", "post_id": "7vi4a2", "comment": "So... It's the snake or the predator. And what do you do with the snake or the predator? You burn it. You kill it. You crush it. It's like there's a... a destructive force that comes along with that, that's absolutely, well it's morally righteous. Cuz yeah... if, you know, it's a poisonous snake and it's threatening the village obviously you kill it. And then you're celebrated for it."}, {"comment_id": "dtszt4o", "post_id": "7vi4a2", "comment": "Because they are vile and slithery and invasive. "}, {"comment_id": "dtt95f5", "post_id": "7vi4a2", "comment": "Asps. Very dangerous. You go first."}, {"comment_id": "dtsi7xj", "post_id": "7vi4a2", "comment": "so what was the guilt that was so strong to inspire this?"}, {"comment_id": "dtslr6a", "post_id": "7vi4a2", "comment": "You know those tags on the underside of a mattress? "}, {"comment_id": "dtssld7", "post_id": "7vi4a2", "comment": "[deleted]"}, {"comment_id": "dtst2ao", "post_id": "7vi4a2", "comment": "pick one.. pick them all...."}, {"comment_id": "dtt698l", "post_id": "7vi4a2", "comment": "Christianity in general, maybe."}, {"comment_id": "dtsktag", "post_id": "7vi4a2", "comment": "Always love your work. "}, {"comment_id": "dtskyh5", "post_id": "7vi4a2", "comment": "This is amazing, hit me pretty damned hard. I'm really impressed with how much patience must have gone into this, the end result was absolutely worth it!"}, {"comment_id": "dtswgtw", "post_id": "7vi4a2", "comment": "Wow, this dude is really good...http://www.milesjohnstonart.com/"}, {"comment_id": "dtsjxgu", "post_id": "7vi4a2", "comment": "Where's the half-eaten apple?"}, {"comment_id": "dtslc4l", "post_id": "7vi4a2", "comment": "That many snakes? She ate the whole thing, core and all."}, {"comment_id": "dtsopqv", "post_id": "7vi4a2", "comment": "I love the low contrast. Gives it a really old and dark tone. "}, {"comment_id": "dtsgle3", "post_id": "7vi4a2", "comment": "this is amazing, how long did it take you?\n\n\nI'd love to follow your work, if you post it anywhere :D"}, {"comment_id": "dtshjn9", "post_id": "7vi4a2", "comment": "Thanks so much! Could be anywhere between 40-100 hours if I was to guess. I work as an artist full time so I don't really track this stuff anymore. It took a couple months to develop from the seeds of the idea to the final. My Instagram is miles_art if you want to see more stuff :)"}, {"comment_id": "dtskp5h", "post_id": "7vi4a2", "comment": "Makes me want to close the blinds and listen to Katatonia all day...great job! "}, {"comment_id": "dtspj2n", "post_id": "7vi4a2", "comment": "Just a couple days after finding you on Instagram, here you is"}, {"comment_id": "dtsk20b", "post_id": "7vi4a2", "comment": "You should check out Aron Wiesenfeld        http://www.aronwiesenfeld.com/ "}, {"comment_id": "dtsp4qt", "post_id": "7vi4a2", "comment": "I thought the same exact thing, with the long limbs, surreal subject matter, and Chris Van Allsburg-like style."}, {"comment_id": "dtt8okm", "post_id": "7vi4a2", "comment": "Ooo I loooooove his work. We have chatted a bit back and forth online too, hopefully going to swap some sketches :)"}, {"comment_id": "dtsydks", "post_id": "7vi4a2", "comment": "Oh man, this is insane. I can feel the turmoil radiating from the page. Amazing work. \n\nThe only criticism I can offer would actually be the title. Guilt is a good title for the work, but the guilt seems a little too light hearted for the work. This feels more like shame. Shame eats you alive from the inside. There was an interesting conversation about guilt and shame on the Atheist Experience a few weeks ago. I feel like your work more closely captures the destructiveness of shame.\n\nAmazing work."}, {"comment_id": "dtsqkbc", "post_id": "7vi4a2", "comment": "Fuck, that just punched me in the face. I don’t think I’ve ever seen the concept of guilt rendered so clearly. Nor have I ever before felt so sorry for Eve. "}, {"comment_id": "dtswd18", "post_id": "7vi4a2", "comment": "Looks like enough to start your own religion. Well done!"}, {"comment_id": "dtt20ya", "post_id": "7vi4a2", "comment": "no don't"}, {"comment_id": "dtsfvay", "post_id": "7vi4a2", "comment": "Very nice! "}, {"comment_id": "dtsm0hg", "post_id": "7vi4a2", "comment": "Pardon my french but, holy fucking shit! "}, {"comment_id": "dtspra8", "post_id": "7vi4a2", "comment": "This is so powerful, and beautiful, well done"}, {"comment_id": "dtss228", "post_id": "7vi4a2", "comment": "This reminds me of purging during ayahuasca."}, {"comment_id": "dtst00y", "post_id": "7vi4a2", "comment": "You might want to post this at r/creepy. They might appreciate it. "}, {"comment_id": "dtstloy", "post_id": "7vi4a2", "comment": "Masterpiece! I would buy it.\n\n--edit just spent some time looking at your other work - you're incredibly talented! Do you sell your work?"}, {"comment_id": "dtsu3h4", "post_id": "7vi4a2", "comment": "Holy FUCK this would make a hard album cover. Feelin this."}, {"comment_id": "dtsus3x", "post_id": "7vi4a2", "comment": "Beautiful, it reminds me of [Gustav Doré's Inferno illustrations](http://www.worldofdante.org/gallery_dore.html). Personally I really struggle with pencil shading... Respect!"}, {"comment_id": "dttdibp", "post_id": "7vi4a2", "comment": "First thought was Doré as well."}, {"comment_id": "dtsvduq", "post_id": "7vi4a2", "comment": "How tf"}, {"comment_id": "dtswdbu", "post_id": "7vi4a2", "comment": "This really speaks to me, guilt is a mother fucking serpent all right..."}, {"comment_id": "dtswdjc", "post_id": "7vi4a2", "comment": "I like your work immensely."}, {"comment_id": "dtswec3", "post_id": "7vi4a2", "comment": "Incredible!"}, {"comment_id": "dtsxjx0", "post_id": "7vi4a2", "comment": "I don't know squat about art, but I saw this and thought M.C. Escher. Amazing work."}, {"comment_id": "dtsxltm", "post_id": "7vi4a2", "comment": "Wow. I felt this, I truly feel like you captured this emotion. Thank you."}, {"comment_id": "dtsxvnq", "post_id": "7vi4a2", "comment": "Miles! I have been following your work on Instagram for quite some time. Always pumped to see it outside of the app. Your aesthetic is a favorite of mine and definitely gets me inspired."}, {"comment_id": "dtt2vqn", "post_id": "7vi4a2", "comment": "Cloverfield Paradox anyone? "}, {"comment_id": "dtt68j0", "post_id": "7vi4a2", "comment": "This is so perfect.  \nThat slimy feeling you get all over your body, that gut wrenching pain, hiding your face in your hands, not being able to cope with your actions, lying on the ground exhausted and defeated by these feelings.  Very very real, very good immersion that I can connect to."}, {"comment_id": "dttbbsq", "post_id": "7vi4a2", "comment": "The title ought to have been \"better out than in\""}, {"comment_id": "dtto6u9", "post_id": "7vi4a2", "comment": "wow...gruesome"}, {"comment_id": "dttp2tq", "post_id": "7vi4a2", "comment": "Do you have a website?"}, {"comment_id": "dttpc6f", "post_id": "7vi4a2", "comment": "Looks like a black discard "}, {"comment_id": "dtsimub", "post_id": "7vi4a2", "comment": "Wowowowowowowow WOW"}, {"comment_id": "dtsh6s3", "post_id": "7vi4a2", "comment": "So good! Nicely done... the snakes are magnificent!"}, {"comment_id": "dtsikcq", "post_id": "7vi4a2", "comment": "*sneks. Snakes don't exist."}, {"comment_id": "dtshxxp", "post_id": "7vi4a2", "comment": "Great job mate. How does one come up with inspiration for a drawing like this? Seeds of thought coming together slowly over time or just a flash of inspiration. Terrific drawing none-the-less. "}, {"comment_id": "dtsjsdo", "post_id": "7vi4a2", "comment": "Hey it’s miles!! Followed you on Instagram for a while. You guys should check his stuff out it’s incredible "}, {"comment_id": "dtshz0c", "post_id": "7vi4a2", "comment": "This is beautiful, haunting, and so many emotions beyond words.  Thank you for sharing your art with us!"}, {"comment_id": "dtsjuyg", "post_id": "7vi4a2", "comment": "I get a ‘my thoughts are snakes that consume my body’ vibe "}, {"comment_id": "dtsgur5", "post_id": "7vi4a2", "comment": "Amazing"}, {"comment_id": "dtskope", "post_id": "7vi4a2", "comment": "I absolutely love your style! It always stands out so much from all of the other posts and elicits such deep distraught emotions"}, {"comment_id": "dtsl5ju", "post_id": "7vi4a2", "comment": "You’ve captured the emotion so well through such a surreal approach to expression! Amazing detail too! "}, {"comment_id": "eiw223g", "post_id": "b2zoyb", "comment": "I do these stripped away type drawings that show images with cut away sections that show the skeleton underneath! I do this as a play on death, a Memento Mori type thing. You guys can check more of my illustrations out on my Instagram! \n\n[@mvndeep](instagram.com/mvndeep) "}, {"comment_id": "eiw7suk", "post_id": "b2zoyb", "comment": "\nfixed link: [@mvndeep](https://instagram.com/mvndeep) \n\nGotta include the protocol. \n\nVery cool art! \n\n"}, {"comment_id": "eiw8zq3", "post_id": "b2zoyb", "comment": "These are so dope!! I even checked out your Instagram man. Would definitely like for you to draw up something as a tattoo!! "}, {"comment_id": "eiwzakl", "post_id": "b2zoyb", "comment": "Dude....I would tattoo this image too my forehead because of how much I like it!  Great job. I want moar!"}, {"comment_id": "eiwf25k", "post_id": "b2zoyb", "comment": "I LOVE your style! You've got a new fan in me, for sure. keep up the awesome work ♡"}, {"comment_id": "eiw9yq3", "post_id": "b2zoyb", "comment": "i have a picture of a dinosaur that shows its skeleton and organs on different layers"}, {"comment_id": "eiwm7km", "post_id": "b2zoyb", "comment": "I think this would be an awesome tattoo "}, {"comment_id": "eiwr3xk", "post_id": "b2zoyb", "comment": "Fuckin incredible work dude!"}, {"comment_id": "eiwtf33", "post_id": "b2zoyb", "comment": "I love this and you're amazing"}, {"comment_id": "eiwu5bh", "post_id": "b2zoyb", "comment": "Very Bryce Wong "}, {"comment_id": "eiwuqtb", "post_id": "b2zoyb", "comment": "This is tattoo worthy m8! Amazing work man keep it up!"}, {"comment_id": "eiwvwke", "post_id": "b2zoyb", "comment": "If you can handle a bit of blood and inflicting pain to someone you should definitely get into tattooing. You'd make a killing with this style and talent."}, {"comment_id": "eiwys8j", "post_id": "b2zoyb", "comment": "Do you take commissions?\n\nAnd I hate that I have to say this but obviously paid "}, {"comment_id": "eix11v7", "post_id": "b2zoyb", "comment": "Noice!  \nIs it for sale?"}, {"comment_id": "eix7b3u", "post_id": "b2zoyb", "comment": "Holy shit dude this is some next level shit "}, {"comment_id": "eix7fyc", "post_id": "b2zoyb", "comment": "Do you sell prints on etsy or something? I might buy the plague doctor. "}, {"comment_id": "eix9laf", "post_id": "b2zoyb", "comment": "I love the astronaut! Do you sell these pieces?"}, {"comment_id": "eixdhnp", "post_id": "b2zoyb", "comment": "Would you consider working for the police on recreating faces when they have skeletal remains?   Or even for plastic surgeons..,art is a gift, but so is the artistic eye for what is below the skin and muscles...you have a few gifts!"}, {"comment_id": "eixgoeq", "post_id": "b2zoyb", "comment": "I love this!"}, {"comment_id": "eixthbw", "post_id": "b2zoyb", "comment": "Simply awesome good sir!"}, {"comment_id": "eixxkpk", "post_id": "b2zoyb", "comment": ">@mvndeep\n\nIt's very nice sketch, I have ever seen. Effectively understood the theme and found it interesting. "}, {"comment_id": "eiwz2tb", "post_id": "b2zoyb", "comment": "Amazing drawing, but for me personally the sash with name is like sore thumb. Seeing the name seems a bit redundant, everybody can recognize him by the head he is holding. "}, {"comment_id": "eiz6fsg", "post_id": "b2zoyb", "comment": "Even the snake skull.👍"}, {"comment_id": "eiw1y5i", "post_id": "b2zoyb", "comment": "This is wicked!!!"}, {"comment_id": "eiw26gm", "post_id": "b2zoyb", "comment": "Thanks so much!! I’m really glad you like it "}, {"comment_id": "eiw2bzk", "post_id": "b2zoyb", "comment": "That's really good! I love the red cut-away!\n\nWhered you get the reference from?"}, {"comment_id": "eiw2t9d", "post_id": "b2zoyb", "comment": "The reference for the drawing or the cut away?\n\nThe drawing is based of the statue with the same name!\n\nThe red cut-away was something I had seen in a photoshopped image somewhere online, and that gave me the inspiration to run with this!\n\nThanks for the kind words ! [you can check out more here if you want!](instagram.com/mvndeep) "}, {"comment_id": "eiw2wo0", "post_id": "b2zoyb", "comment": "This is fucking sick"}, {"comment_id": "eiw328a", "post_id": "b2zoyb", "comment": "Thanks so much mate! You can always check out my Instagram if you want to see more of these!! I have tons of skeleton cut away illustrations.\n\nIt’s @mvndeep if you’re interested !!"}, {"comment_id": "eiw2998", "post_id": "b2zoyb", "comment": "This is so cool"}, {"comment_id": "eiw2bvc", "post_id": "b2zoyb", "comment": "Almost as cool as your username !! Thanks for the kind words 🙆🏼‍♂️"}, {"comment_id": "eiwa7nc", "post_id": "b2zoyb", "comment": "This is literally the raddest thing I've ever seen do you sell prints"}, {"comment_id": "eixmcv3", "post_id": "b2zoyb", "comment": "Hey man! Thanks so much for the support!! I’m really overwhelmed by how fast that reddit post blew up. I haven’t started making prints yet, but they should be done by the end of this week if everything goes well. Just drop me a DM either here or on Instagram and I’ll get in touch !! 🖤🙆🏼‍♂️"}, {"comment_id": "eiw3zor", "post_id": "b2zoyb", "comment": "Looks so amazing!"}, {"comment_id": "eiw4627", "post_id": "b2zoyb", "comment": "Thank you!! Glad you liked it ❤️🖤"}, {"comment_id": "eiwp48h", "post_id": "b2zoyb", "comment": "Medusa did nothing wrong. Fuck Poseidon and Athena"}, {"comment_id": "eixml9j", "post_id": "b2zoyb", "comment": "I’m right there with you! Fuck em"}, {"comment_id": "eiw49jt", "post_id": "b2zoyb", "comment": "Holy shit, this is fucking awesome, man!! "}, {"comment_id": "eiw4djq", "post_id": "b2zoyb", "comment": "Thanks so much mate!! You can check out more of my stuff [here if you want](instagram.com/mvndeep) !! "}, {"comment_id": "eiw6j49", "post_id": "b2zoyb", "comment": "This is soooo cool and unique, I love it!"}, {"comment_id": "eiwlikf", "post_id": "b2zoyb", "comment": "What pen do you use for the red? Looks very nice! Not too saturated"}, {"comment_id": "eixmi5b", "post_id": "b2zoyb", "comment": "I use artline 6.0 ! It gives a really nice red and I 100% recommend it #notanad"}, {"comment_id": "eiwgraw", "post_id": "b2zoyb", "comment": "Is this stippling?"}, {"comment_id": "eixnq7y", "post_id": "b2zoyb", "comment": "Yeah it is! "}, {"comment_id": "eiwkono", "post_id": "b2zoyb", "comment": "This is so freakin cool"}, {"comment_id": "eiwl1w0", "post_id": "b2zoyb", "comment": "Thought Medusa was Mother Brain for a hot second "}, {"comment_id": "eixmdxs", "post_id": "b2zoyb", "comment": "Hahaha you wouldn’t be the first person to have told me that 😂"}, {"comment_id": "eiwl8fs", "post_id": "b2zoyb", "comment": "Would love to get this tatted, do you have a high res pic?"}, {"comment_id": "eixmgiz", "post_id": "b2zoyb", "comment": "Yeah! I sell the high resolution digital prints for tattooing purposes. I have a flat rate of 35USD and if you’re interested, you can just DM me either here or on Instagram and we can work this out 🖤❤️"}, {"comment_id": "eiwleuh", "post_id": "b2zoyb", "comment": "Amazing! "}, {"comment_id": "eiwlpce", "post_id": "b2zoyb", "comment": "This is so fucking cool dude "}, {"comment_id": "eiwmdqg", "post_id": "b2zoyb", "comment": "Love it🖤"}, {"comment_id": "eiwmt2h", "post_id": "b2zoyb", "comment": "This would make a wicked tattoo."}, {"comment_id": "eiwo3k8", "post_id": "b2zoyb", "comment": "That's a cocky ass squirrel on his helmet."}, {"comment_id": "eixmkb1", "post_id": "b2zoyb", "comment": "Ain’t it? It didn’t even do any of the work"}, {"comment_id": "eiwpceu", "post_id": "b2zoyb", "comment": "I want this on my body."}, {"comment_id": "eiwpfl6", "post_id": "b2zoyb", "comment": "I badly want to set it as my wallpapper."}, {"comment_id": "eiwpyzx", "post_id": "b2zoyb", "comment": "You should scan this. I'd love this as a wallpaper ^^"}, {"comment_id": "eiwq8z4", "post_id": "b2zoyb", "comment": "Looks like it'd be a Versace shirt. \n\nLove it"}, {"comment_id": "eixmnf1", "post_id": "b2zoyb", "comment": "I’ll cut you in on 10% if you help sell the t-shirt rights 😉"}, {"comment_id": "eiwqgjm", "post_id": "b2zoyb", "comment": "Cool! That is one amazing picture 👍🏽👌"}, {"comment_id": "eiwqtdk", "post_id": "b2zoyb", "comment": "Omgggg 😍"}, {"comment_id": "eiwrpsn", "post_id": "b2zoyb", "comment": "Badass! "}, {"comment_id": "eiwrr4m", "post_id": "b2zoyb", "comment": "It seems like the dude shooting laser beams beat them both. "}, {"comment_id": "eixmosv", "post_id": "b2zoyb", "comment": "Laser beams > demigods "}, {"comment_id": "eiws3p4", "post_id": "b2zoyb", "comment": "That's sick as hell I love it"}, {"comment_id": "eiws5j1", "post_id": "b2zoyb", "comment": "I really like your drawing style!! Have an updoot my good person! "}, {"comment_id": "eiwswny", "post_id": "b2zoyb", "comment": "Beautiful :)"}, {"comment_id": "eiwt1vy", "post_id": "b2zoyb", "comment": "Incredible "}, {"comment_id": "eiwtd9x", "post_id": "b2zoyb", "comment": "Absolutely stunning! This is the type of art i really enjoy looking at. "}, {"comment_id": "eiwtlec", "post_id": "b2zoyb", "comment": "[deleted]"}, {"comment_id": "eixmq0d", "post_id": "b2zoyb", "comment": "Call it artistic interpretation? Hahahah"}, {"comment_id": "eiwuelp", "post_id": "b2zoyb", "comment": "I loved the drawing but now I'm so curious, I want to see Perseus face. "}, {"comment_id": "eixmrmq", "post_id": "b2zoyb", "comment": "I actually always draw the entire face when I’m sketching it out just so I know where everything needs to go before doing the red slash!"}, {"comment_id": "eiwveog", "post_id": "b2zoyb", "comment": "This is fucking sick"}, {"comment_id": "eiwvf97", "post_id": "b2zoyb", "comment": "Dope"}, {"comment_id": "eiwvuhu", "post_id": "b2zoyb", "comment": "I like that you included the little snakes head too in the cut off. Very amazing work, good stuff. "}, {"comment_id": "eixmsg4", "post_id": "b2zoyb", "comment": "It’s all in the details 🤪 thank you!!"}, {"comment_id": "eiwvw4z", "post_id": "b2zoyb", "comment": "you should totally find a way to sell prints- would love to purchase!! "}, {"comment_id": "eixmvkd", "post_id": "b2zoyb", "comment": "Yeah, I’m looking into it! This post blew up so much that I’ve been getting messages all night. Hopefully I can get prints made by this weekend and figure out the logistics of it. Drop me A DM either here or on Instagram and I’ll let you know when I’m ready!!"}, {"comment_id": "eiwvx83", "post_id": "b2zoyb", "comment": "This is sweet dude"}, {"comment_id": "eiwvy51", "post_id": "b2zoyb", "comment": "I got chills when I saw this! Love it"}, {"comment_id": "eiww9am", "post_id": "b2zoyb", "comment": "This is bloody fantastic, holy shit."}, {"comment_id": "eiwwjgf", "post_id": "b2zoyb", "comment": "Do you take commissions? I have had an idea bouncing around in my head for a few years and I think i’ve finally found the perfect artist for it."}, {"comment_id": "eixmx1c", "post_id": "b2zoyb", "comment": "Hell yes I take commissions ! Just send me a DM either here or on Instagram and we can figure it out 🖤"}, {"comment_id": "eiwwm4b", "post_id": "b2zoyb", "comment": "Really love this, what a talent!"}, {"comment_id": "eiwx6nq", "post_id": "b2zoyb", "comment": "It’s really cool that Medusa’s snake hair is in the cut away too!"}, {"comment_id": "eiwycan", "post_id": "b2zoyb", "comment": "So you know this is amazing. "}, {"comment_id": "eiwz6ly", "post_id": "b2zoyb", "comment": "wow"}, {"comment_id": "eiwzyap", "post_id": "b2zoyb", "comment": "Wow. This is very epic. I love it. "}, {"comment_id": "eix056g", "post_id": "b2zoyb", "comment": "Would you sell prints of this? "}, {"comment_id": "eixn01d", "post_id": "b2zoyb", "comment": "Yeah, I’m working on getting prints ready for this by the weekend ! First time making prints so I’m trying to work out the logistics of it. Send me a DM on here or Instagram and I’ll get back to you!"}, {"comment_id": "eiyolxm", "post_id": "b2zoyb", "comment": "I will be soon! Hopefully they'll be ready by this weekend"}, {"comment_id": "eix0n69", "post_id": "b2zoyb", "comment": "This is fucking awesome\n"}, {"comment_id": "ebwq99f", "post_id": "a6ou9g", "comment": "This is absolutely stunning! I love when people introduce blues in to skin tones."}, {"comment_id": "ebwqchb", "post_id": "a6ou9g", "comment": "Thank you so much! I think i added too much blue to the upper lip. It looks like he has a green mustache "}, {"comment_id": "ebwy736", "post_id": "a6ou9g", "comment": "How long did this take?"}, {"comment_id": "ebxi4nw", "post_id": "a6ou9g", "comment": "It makes sense too, given that connective tissue (and thus veins) look blue."}, {"comment_id": "eby3iaq", "post_id": "a6ou9g", "comment": "> I love when people introduce blues in to skin tones.\n\nStrangulation works too. "}, {"comment_id": "eby62r3", "post_id": "a6ou9g", "comment": "Blues are absolutely CRITICAL for an accurate skin tone. If the skin tones looks realistic, there’s blue in it even if you can’t tell. "}, {"comment_id": "ebwrtn0", "post_id": "a6ou9g", "comment": "[removed]"}, {"comment_id": "ebwx22m", "post_id": "a6ou9g", "comment": "Why am I attracted to a drawing?"}, {"comment_id": "ebwxgip", "post_id": "a6ou9g", "comment": "If I saw this picture on Tinder, I'd swipe right."}, {"comment_id": "ebx8l4w", "post_id": "a6ou9g", "comment": "10/10 would bang"}, {"comment_id": "ebxcs4g", "post_id": "a6ou9g", "comment": "You should watch shadowhunters 🤭"}, {"comment_id": "ebxihh7", "post_id": "a6ou9g", "comment": "It’s the reason people watch hentai. It’s art"}, {"comment_id": "eby8s61", "post_id": "a6ou9g", "comment": "The jaw "}, {"comment_id": "ebx5jei", "post_id": "a6ou9g", "comment": "[deleted]"}, {"comment_id": "ebwq7t9", "post_id": "a6ou9g", "comment": "How is this even possible"}, {"comment_id": "ebwqptz", "post_id": "a6ou9g", "comment": "I saw someone do it and decided to try for myself! "}, {"comment_id": "ebwxyh8", "post_id": "a6ou9g", "comment": "There are a whole beautiful array of colors found in skin. Blues, Greens, Purples, Oranges. Usually the key to great shading and lifelike skin are colors like these. "}, {"comment_id": "ebx4hc1", "post_id": "a6ou9g", "comment": "Printing only uses 4 colors. Magenta and cyan instead of bright red and blue, but that's for tone. If you check out each separation individually, you really see how wild color is.\n\nThat said, the drawing is awesome and for a first attempt at skin tone more so. Love the technique and drawing skill. I've done plenty of colored pencil portraits and when a color isn't quite how you like it you're better off making it part of the work than changing it. Although black and white can help hide or tone down some. I personally like that kind of thing.\n\nGood work OP and obvious talent. Do more."}, {"comment_id": "ebwx8gu", "post_id": "a6ou9g", "comment": "As somebody who has the drawing level of a 7 year old child, I can't even imagine how anybody can draw like this. I can't even begin to think about the detail in my mind never mind transfering that to paper."}, {"comment_id": "ebx3r1e", "post_id": "a6ou9g", "comment": "All computer information is 0's and 1's and all visual images are composed of mixes of 3 primary colors and all matter is composed of protons, electrons and neutrons."}, {"comment_id": "ebwr79c", "post_id": "a6ou9g", "comment": "Looks better than most of my realistic skin tones with actual flesh color pencils lol Bravo! "}, {"comment_id": "ebwsoom", "post_id": "a6ou9g", "comment": "I have used actual flesh colors too and i like this more. It was more enjoyable to do"}, {"comment_id": "ebwqxe1", "post_id": "a6ou9g", "comment": "Dude, I tried this before, and I can’t tell you enough how difficult it is to pull it off. You’ve really done a great job!"}, {"comment_id": "ebwr66n", "post_id": "a6ou9g", "comment": "Thank you so much! It was hard but i think choosing the right colored pencils is key. They have to layer well. I've seen people do this with pens! We should try that too."}, {"comment_id": "ebwubgh", "post_id": "a6ou9g", "comment": "I love this, but red yellow and blue aren't good primary colors because theyre not equally spaced on the color wheel. Magenta, cyan, and yellow will give you more freedom in green hues (which is why printers use them). \n\nI mean, saturated green hues were not that important here so red yellow and blue were probably good colors to use (and it shows in the gorgeous final product), but they're not \"primary\" colors. they're more of a simplification so that we can have both the popular red and blue colors as well as the near impossible to mix yellows. cyan and magenta are also pretty hard to mix to a decent saturation, but they're not popular colors, so they've been overlooked. \n\nComputers use red, green, and blue because magenta is not a spectral color: it can't result as a pure wavelength of light, only an even mixture of red and blue. The pigment mixing problem is not an issue for computers as they simply emit wavelengths of light that mix in our brains. "}, {"comment_id": "ebwumis", "post_id": "a6ou9g", "comment": "Thank you for this! "}, {"comment_id": "ebx0n2t", "post_id": "a6ou9g", "comment": "The way I understood it was that, RGB are the spectral primary colours. Where  as Magenta, Cyan, and Yellow, reflect the primary colours off of paper."}, {"comment_id": "ebwydy9", "post_id": "a6ou9g", "comment": "This was my favourite take away from art school. adding cyan and magenta to my watercolour kit is a game changer specifically, because you can really maintain the lightness of the medium since you’re not having to add so much pigment to get certain colours.\n\nI hardly use any other paints now. "}, {"comment_id": "ebx5zjw", "post_id": "a6ou9g", "comment": "Red Green Blue are the primary colors of emmited light, and Cyan Magenta Yellow are the primary colors of reflected light."}, {"comment_id": "ebwwiht", "post_id": "a6ou9g", "comment": "OMG i'm not OP but thanks for this tip"}, {"comment_id": "ebwz0qb", "post_id": "a6ou9g", "comment": "Okay but it doesn’t change the fact that kindergartners learn primary colors as red yellow blue, and that when people state primary colors it’s a phrase referencing that and not a statement of the veracity of their primaryness "}, {"comment_id": "ebwo7zu", "post_id": "a6ou9g", "comment": "nice job"}, {"comment_id": "ebwq3zv", "post_id": "a6ou9g", "comment": "Thank you! "}, {"comment_id": "ebwx6zr", "post_id": "a6ou9g", "comment": "Who’s the babe?? Amazing work, btw!"}, {"comment_id": "ebwxubm", "post_id": "a6ou9g", "comment": "Cole Mohr! Never thought I’d see him pop up on here lol looks great!"}, {"comment_id": "ebxqzft", "post_id": "a6ou9g", "comment": "I scrolled through the comments hoping someone would say who he was, thanks!"}, {"comment_id": "ebwr1vg", "post_id": "a6ou9g", "comment": "Fantastic work! How long have you been doing art? It doesn't look at all like your first time. Great job! "}, {"comment_id": "ebwr7nv", "post_id": "a6ou9g", "comment": "Thank you so much! I've been drawing for a long time but only started drawing with colored pencils recently "}, {"comment_id": "ebwvs96", "post_id": "a6ou9g", "comment": "I wish I was blessed with your talent. I really try to apply myself into getting better at drawing and I know it’s not an ‘over-night’ process but I feel like I just have to much to learn "}, {"comment_id": "ebwxdvb", "post_id": "a6ou9g", "comment": "Don’t underestimate improvement over time. If you put in the effort, you should get the results that you want. There’s a million things that I used to tell myself I’ll “never be able to do” and then I did them and got good at them. It’s cheesy but you just have to believe that it’s possible. You are right to assume that the person that drew this did not wake up knowing how to draw so beautifully."}, {"comment_id": "ebwxy0j", "post_id": "a6ou9g", "comment": "Remember that you can get good at a lot of things if you just enjoy doing them a lot. Improvement is sometimes a matter of enjoying the repetition!"}, {"comment_id": "ebwpxux", "post_id": "a6ou9g", "comment": "Awesome work "}, {"comment_id": "ebwq49k", "post_id": "a6ou9g", "comment": "Thank you! "}, {"comment_id": "ebwzblk", "post_id": "a6ou9g", "comment": "Who is he? Just a dude out of your imagination?"}, {"comment_id": "ebxqx14", "post_id": "a6ou9g", "comment": "A model named Cole Mohr. Disturbingly sexy. "}, {"comment_id": "ebxpksm", "post_id": "a6ou9g", "comment": "It looks like Matthew daddario to me 😂"}, {"comment_id": "ebxcuqb", "post_id": "a6ou9g", "comment": "Looks like Zayn Malik"}, {"comment_id": "ebwuaqw", "post_id": "a6ou9g", "comment": "This is awesome"}, {"comment_id": "ebwumwx", "post_id": "a6ou9g", "comment": "Thank you so much! "}, {"comment_id": "ebx11nc", "post_id": "a6ou9g", "comment": "I just can't not see the [Outsider](https://vignette.wikia.nocookie.net/dishonoredvideogame/images/a/ab/Outsider_target_photo.png/revision/latest?cb=20181018223353) from Dishonored."}, {"comment_id": "ebwsds7", "post_id": "a6ou9g", "comment": "This is incredible, really well done! I wouldn’t have known it was done with just those 3 colors had you not shared that. It seems like a difficult challenge, but you did a damn good job!"}, {"comment_id": "ebwu79i", "post_id": "a6ou9g", "comment": "Finally proof that primary colors are the only important ones "}, {"comment_id": "ebwurbn", "post_id": "a6ou9g", "comment": "I like the drawing, that blue is no way primary though. How did you get the coat so dark also?"}, {"comment_id": "ebwuxko", "post_id": "a6ou9g", "comment": "Thank you for this! I'll look at my other sets so i can see the proper blue. Maybe I'll get better results.\n\nThe coat was done using my 10b pencil"}, {"comment_id": "ebwx74j", "post_id": "a6ou9g", "comment": "Tremendous. There’s probably the tiniest bit more green cast to it than I’d personally want but you honestly did an awesome job. I don’t draw, all my art exists on the computer, so I’m in awe of this.\n\nColor theory the topic I’m currently studying to try and up my photography and post-editing game. Loving this post."}, {"comment_id": "ebx1j6l", "post_id": "a6ou9g", "comment": "Why am I so attracted to a drawing??"}, {"comment_id": "ebwqgbp", "post_id": "a6ou9g", "comment": "Wow it looks amazing!"}, {"comment_id": "ebwqt8t", "post_id": "a6ou9g", "comment": "Thank you!! "}, {"comment_id": "ebwrlse", "post_id": "a6ou9g", "comment": "Noice! Keep it up"}, {"comment_id": "ebwrrkg", "post_id": "a6ou9g", "comment": "woah"}, {"comment_id": "ebwsaip", "post_id": "a6ou9g", "comment": "WOWSER ヽ( ★ω★)ノ"}, {"comment_id": "ebwsclv", "post_id": "a6ou9g", "comment": "That is so awesome man!! "}, {"comment_id": "ebwsgy3", "post_id": "a6ou9g", "comment": "Thank you so much! "}, {"comment_id": "ebwt8zi", "post_id": "a6ou9g", "comment": "Wow! I didn't even know you could do that!"}, {"comment_id": "ebwucv3", "post_id": "a6ou9g", "comment": "wow you did fantastic."}, {"comment_id": "ebwul3b", "post_id": "a6ou9g", "comment": "Thank you! "}, {"comment_id": "ebwulvy", "post_id": "a6ou9g", "comment": "So good!"}, {"comment_id": "ebwum56", "post_id": "a6ou9g", "comment": "That is really impressive. Good job! "}, {"comment_id": "ebwuqwp", "post_id": "a6ou9g", "comment": "Loook sick!"}, {"comment_id": "ebwuvhc", "post_id": "a6ou9g", "comment": "Can't think of anything artistically sophisticated to say, so I'll just say \"WOW!\""}, {"comment_id": "ebwweh2", "post_id": "a6ou9g", "comment": "Hats off man... I have not been able to pull this off. (insert the old cat with newspaper meme) I should practice"}, {"comment_id": "ebwwhtr", "post_id": "a6ou9g", "comment": "I see black but there isnt..?"}, {"comment_id": "ebwwno3", "post_id": "a6ou9g", "comment": "Is that Walt Jr?"}, {"comment_id": "ebwx0qd", "post_id": "a6ou9g", "comment": "You nailed it. I love this so much. Fuckin Glorious nice work."}, {"comment_id": "ebwx9su", "post_id": "a6ou9g", "comment": "Well I didn’t know that was possible. That’s pretty amazing nice job."}, {"comment_id": "ebwxncv", "post_id": "a6ou9g", "comment": "Those aren't the primary colors where's the rgb? \n/s"}, {"comment_id": "ebx49l0", "post_id": "a6ou9g", "comment": "What the hell? That is amazing!"}, {"comment_id": "ebx5p9m", "post_id": "a6ou9g", "comment": "This is a terrific sketch, and a good example of mixing colors.  I had a teacher say 'it is either more red, more yellow or more blue' when adjusting color.  \n\nThe green and reds in a couple of the border areas remind me of when video or color prints didn't quite line up. If this is your first try you will master this in no time."}, {"comment_id": "ebxqp3x", "post_id": "a6ou9g", "comment": "Holy shit that is one monster hand "}, {"comment_id": "ektc2e8", "post_id": "a6ou9g", "comment": "How is this possible 😭"}, {"comment_id": "ebx5mfo", "post_id": "a6ou9g", "comment": "I love the blues influence, the style and tattoos almost remind me of some of the work Jana Brike does, which I find to be super compelling. Thanks for sharing!\n\n[NSFW ish ](https://www.instagram.com/p/BgjQlw2nqH5/?utm_source=ig_share_sheet&igshid=11ntid4d65apz) "}, {"comment_id": "ebwq1wx", "post_id": "a6ou9g", "comment": "Hate to be that person but those aren't the primary colours. Switch your blue for cyan and your red for magenta then it will be.\n\nEDIT: It seems I stand corrected"}, {"comment_id": "ebwr1m8", "post_id": "a6ou9g", "comment": "The CMYK scale is for printing. Red, yellow and blue are the primary colours in all other disciplines :)"}, {"comment_id": "ebwr7qv", "post_id": "a6ou9g", "comment": "Hello! Info: printer’s primary is cyan, magenta and yellow while artist’s primary is red, blue, and yellow. What does this mean? If you’re doing print, you want your work to be revolving around printer’s primary colors to get accuracy of tone while if you’re doing traditional media: red, blue and yellow make up the primary colors and you want your work to revolve around those colors. The difference being that screens usually ‘alter’ tones to suit your eyes better hence when you print them, the tones don’t come out the same as with the screen. Hope this helps!    \n\nEdit: when I say print, I mean digital media 😬"}, {"comment_id": "ebwr92n", "post_id": "a6ou9g", "comment": "But if I'm not wrong, Cyan, Magenta, and Yellow are just the primary colors in printers, with paint, pencils, etc, Blue, Red and Yellow are considered the primary colors.\n\nBut I might be wrong.\n\nEdit: Light isn't CYMK. I'm retarded."}, {"comment_id": "ebwq4p0", "post_id": "a6ou9g", "comment": "Dammit 😢"}, {"comment_id": "eby0ol8", "post_id": "a6ou9g", "comment": "You're absolutely correct and I can't believe you got so downvoted.\n\nIt's not pedantic either, there would be a better colour range with this choice. The red op is has a bit of yellow in it and the blue has a bit of red, so the mixing possibility are not as fine. To be fair colour pencils don't mix the way paint does anyway I guess."}, {"comment_id": "ebwyadv", "post_id": "a6ou9g", "comment": "Wow... that’s really good!!!"}, {"comment_id": "ebwye23", "post_id": "a6ou9g", "comment": "Oooohhhhh that's a fun idea, thanks for the inspiration! "}, {"comment_id": "ebwyhdn", "post_id": "a6ou9g", "comment": "Your model reminds me of Herobust. Nice work!"}, {"comment_id": "ebwypz2", "post_id": "a6ou9g", "comment": "Lol wut the primary colors are cyan yellow and magenta"}, {"comment_id": "ebwyyl7", "post_id": "a6ou9g", "comment": "Nobody has mentioned this, but he looks very similar to Chris Pine. Very well done!"}, {"comment_id": "ebwz24h", "post_id": "a6ou9g", "comment": "Good Work Bro "}, {"comment_id": "ebwzcjg", "post_id": "a6ou9g", "comment": "DAMN! It's fucking AMAZING! I can't even draw like this with all colors!"}, {"comment_id": "ey5ur0u", "post_id": "cvr7i9", "comment": "Amazing work. So quality!"}, {"comment_id": "ey5uuq1", "post_id": "cvr7i9", "comment": "Thank you! I'm really enjoying this project! 🙏\n\n\n#EDIT:\n\nHi all, quick update! \n\nFirstly, all for the love and feedback you have given to me and my work has been amazing and helpful and I wanted to say thank you all! 🙏😊 This week has been my first attempt at sharing some of my current work and it’s been a big motivation to continue on!\n\nI just wanted to let you all know that I have been contacted by the official spongebob social page and they love my piece! \nI really couldn’t have imagined my ToonType! project would be so popular 😊\n\nCan’t wait to share my next letter with you all ❤️😁"}, {"comment_id": "ey70673", "post_id": "cvr7i9", "comment": "Much wow"}, {"comment_id": "ey79j3n", "post_id": "cvr7i9", "comment": "I thought they were all stickers... quality work for sure"}, {"comment_id": "ey5uxjx", "post_id": "cvr7i9", "comment": "Amazing job! I’d buy this if it were a sticker or on something"}, {"comment_id": "ey5v3n2", "post_id": "cvr7i9", "comment": "I'm planning on releasing stickers once I complete the alphabet 😊🙌\n\nEdit: spellings"}, {"comment_id": "ey6antk", "post_id": "cvr7i9", "comment": " If you ever sell this as a poster or sticker I’ll buy it in half of a split second"}, {"comment_id": "ey6ciyo", "post_id": "cvr7i9", "comment": "Thank you I  hope to get something Done with these in the future once it's all completed. If you use any socials go check out my twitter/Instagram for future updates :)"}, {"comment_id": "ey60qfx", "post_id": "cvr7i9", "comment": "You did it. You son of a bitch did it. \n\nI don’t know why but I am proud you. Good work."}, {"comment_id": "ey61tvv", "post_id": "cvr7i9", "comment": "Thank you! It's was fun to complete now on to the next letters later this week 😊"}, {"comment_id": "ey5ywp6", "post_id": "cvr7i9", "comment": "how about S for ‘’save our skins’’?"}, {"comment_id": "ey6wfuk", "post_id": "cvr7i9", "comment": "That way they can identify our bodies."}, {"comment_id": "ey69vb3", "post_id": "cvr7i9", "comment": "Foreskin or Redskins, either way hard no."}, {"comment_id": "ey5vjlc", "post_id": "cvr7i9", "comment": "Noice!! [I did something somewhat similar with pikachu.](https://imgur.com/gallery/jxSBdkk)."}, {"comment_id": "ey5vn2e", "post_id": "cvr7i9", "comment": "Nice man! That's very cool! 🙏🙌"}, {"comment_id": "ey60zea", "post_id": "cvr7i9", "comment": "No doodlebob?"}, {"comment_id": "ey61qmw", "post_id": "cvr7i9", "comment": "Sadly no! I'm such a rookie he never came to mind at the time 😒"}, {"comment_id": "ey78dkq", "post_id": "cvr7i9", "comment": "I also immediately searched for doodlebob lmao"}, {"comment_id": "ey62slj", "post_id": "cvr7i9", "comment": "If turn it upside down it would be \"S\" for \"Sandy\""}, {"comment_id": "ey62u0h", "post_id": "cvr7i9", "comment": "😅"}, {"comment_id": "ey6owmb", "post_id": "cvr7i9", "comment": "It would need Texas shaped SpongeBob"}, {"comment_id": "ey78d9h", "post_id": "cvr7i9", "comment": "So you can identify the bodies"}, {"comment_id": "ey62u7d", "post_id": "cvr7i9", "comment": "This is amazing, top right sponge with the karate mitts is missing his tie color!"}, {"comment_id": "ey62x0m", "post_id": "cvr7i9", "comment": "Oh my, awesome spot! Thank you! 🙏👌"}, {"comment_id": "ey5x30a", "post_id": "cvr7i9", "comment": "I think you’re ready"}, {"comment_id": "ey5xap1", "post_id": "cvr7i9", "comment": "I'm ready.. Promotion!\n\nEdit: spelling"}, {"comment_id": "ey5xa58", "post_id": "cvr7i9", "comment": "These are insane, my man!! What do you use to color them?"}, {"comment_id": "ey5xm11", "post_id": "cvr7i9", "comment": "Thanks dude! And I used a few sets of promarkers, mainly set 1+2 and manga set 1. 😊"}, {"comment_id": "ey6agdh", "post_id": "cvr7i9", "comment": "This came out great. Which letter is next?!?!?!"}, {"comment_id": "ey6cx5u", "post_id": "cvr7i9", "comment": "Well I have go back to work tomorrow so won't be able to start the next letter till the weekend but I'm going to put a vote on my Instagram during the week 😊"}, {"comment_id": "ey61x89", "post_id": "cvr7i9", "comment": "Amazing!! Can't wait to see more!"}, {"comment_id": "ey62e7c", "post_id": "cvr7i9", "comment": "I need to ask. Are you keeping the tiny pieces that used to bind the paper to the spiral, because if you do that shit looks intentional af. I would."}, {"comment_id": "ey62o1j", "post_id": "cvr7i9", "comment": "I use the tiny pieces to test my colours and mixing before I start to add any colour to the image. I'm going to cut em off when it comes to scanning the images in 😊"}, {"comment_id": "ey69u2i", "post_id": "cvr7i9", "comment": "This is awesome! RIP your yellow marker though!"}, {"comment_id": "ey6d2ku", "post_id": "cvr7i9", "comment": "Yes! Especially with doing the first letter I start (H- Homer Simpson) in the same yellow 😅"}, {"comment_id": "ey5vuak", "post_id": "cvr7i9", "comment": "Amazing work! In such a short time! \nCan’t wait to see your other letters dude"}, {"comment_id": "ey5wacj", "post_id": "cvr7i9", "comment": "I've had Alot of free time this weekend to get some done! Sadly I have to go back to work tomorrow 😣"}, {"comment_id": "ey5y23b", "post_id": "cvr7i9", "comment": "oh my god this is so perfect"}, {"comment_id": "ey5y73h", "post_id": "cvr7i9", "comment": "Thank you! 🙏"}, {"comment_id": "ey632ws", "post_id": "cvr7i9", "comment": "i love this"}, {"comment_id": "ey634gn", "post_id": "cvr7i9", "comment": "Thank you! 🙏🙌"}, {"comment_id": "ey63m21", "post_id": "cvr7i9", "comment": "Mee hoy Minoy...all joking aside I absolutely love this it’s amazing!!"}, {"comment_id": "ey64ero", "post_id": "cvr7i9", "comment": "Thanks kind stranger 🙏😊"}, {"comment_id": "ey664j1", "post_id": "cvr7i9", "comment": "Have you completed other letters? I would wear this on a shirt btw, you should think about going to Etsy or something."}, {"comment_id": "ey66kle", "post_id": "cvr7i9", "comment": "I've complete 3 full and 1 half finished. 3 on them are on my reddit profile or go on my instagram if you'd like to see more 😊🙏\n\nEtsy is something I've been thinking about actually!"}, {"comment_id": "ey665xr", "post_id": "cvr7i9", "comment": "What markers/colored pencils do you use if I can ask? These look awesome. You’re so talented :)"}, {"comment_id": "ey66ctj", "post_id": "cvr7i9", "comment": "Thanks so much 🙏 I use 'promarkers' 😊"}, {"comment_id": "ey667k4", "post_id": "cvr7i9", "comment": "Is soldier spongebob in there"}, {"comment_id": "ey66aff", "post_id": "cvr7i9", "comment": "Sadly no! I thought of him way to late and couldnt fit him in 😔"}, {"comment_id": "ey6abw8", "post_id": "cvr7i9", "comment": "Amazing ark work!!! Hope you made more in the future!!!"}, {"comment_id": "ey6cyqk", "post_id": "cvr7i9", "comment": "Im planing too! 🙌😁"}, {"comment_id": "ey6ajp9", "post_id": "cvr7i9", "comment": "Wow epic! I am pretty sad you dont have the pen writing scene but you got most of the iconic moments! Good job!"}, {"comment_id": "ey6clto", "post_id": "cvr7i9", "comment": "Yeah I missed a few good ones I **should** of put in 😔"}, {"comment_id": "ey6aptu", "post_id": "cvr7i9", "comment": "Are you going to use Archer for the letter A?"}, {"comment_id": "ey6ccxo", "post_id": "cvr7i9", "comment": "I was considering it but maybe for a future series! I'm going with either animaniacs or Arnold (hey!) 😊"}, {"comment_id": "ey6az3y", "post_id": "cvr7i9", "comment": "I was eagerly waiting for a follow up after seeing your earlier post.\n\nTerrific work!"}, {"comment_id": "ey6c7c3", "post_id": "cvr7i9", "comment": "Thank you! 🙏 Really enjoyed doing this one!"}, {"comment_id": "ey6b6uk", "post_id": "cvr7i9", "comment": "I LOVE WHERE YOU PUT THE MAGIC CONCH SHELL THANK TOU SO MUCH FOR DOING THAT. \n\nWe spoke about it yesterday lol.\n\nEdit: And what if for the letter \"T\" you did Tsunami and its characters? Just an idea."}, {"comment_id": "ey6c5be", "post_id": "cvr7i9", "comment": "Yes I remember! Thanks for the idea! :p\n\nAnd that would be a really cool idea for a series will consider that😊"}, {"comment_id": "ey6hlve", "post_id": "cvr7i9", "comment": "Started following your Instagram after seeing your last post. Still love your style. I'm looking forward to C for Cartman."}, {"comment_id": "ey6hwnz", "post_id": "cvr7i9", "comment": "Me too! Definitely got to add awesome-o and the coon to it 😂🙌"}, {"comment_id": "ey6j8ym", "post_id": "cvr7i9", "comment": "If only you could *legally* sell this."}, {"comment_id": "ey6qf7m", "post_id": "cvr7i9", "comment": "How do I get this tattooed on me?"}, {"comment_id": "ey7qomh", "post_id": "cvr7i9", "comment": "That would be awesome! 🙌😅"}, {"comment_id": "ey7ajbp", "post_id": "cvr7i9", "comment": "gimme an iphone format and you can tell yourself some diabetic out there has your drawing as their wallpaper"}, {"comment_id": "ey7ou1o", "post_id": "cvr7i9", "comment": "Haha awesome 😂🙏"}, {"comment_id": "ey7c3yl", "post_id": "cvr7i9", "comment": "r/BikiniBottomTwitter"}, {"comment_id": "ey8h28j", "post_id": "cvr7i9", "comment": "My god you are talented"}, {"comment_id": "ey8wkmr", "post_id": "cvr7i9", "comment": "We need stickers from every single spongebob ❤️"}, {"comment_id": "ey91pp7", "post_id": "cvr7i9", "comment": "I love this so much!"}, {"comment_id": "ey5ux00", "post_id": "cvr7i9", "comment": "Spongebob is literally my childhood so i love it. Great work 👍"}, {"comment_id": "ey5v58e", "post_id": "cvr7i9", "comment": "He was one of mine growing up too! Thanks 🙏"}, {"comment_id": "ey60hik", "post_id": "cvr7i9", "comment": "*Who lives in a pineapple under the sea?*"}, {"comment_id": "ey61uxm", "post_id": "cvr7i9", "comment": "SPONGEBOB SQUAREPANTS"}, {"comment_id": "ey5vm2h", "post_id": "cvr7i9", "comment": "you nailed it!!"}, {"comment_id": "ey5vym7", "post_id": "cvr7i9", "comment": "Thank you kind stranger 🙏"}, {"comment_id": "ey5wsbv", "post_id": "cvr7i9", "comment": "Amazing is super neat-o"}, {"comment_id": "ey5x075", "post_id": "cvr7i9", "comment": "Thanks you kind redditor! 🙏"}, {"comment_id": "ey62l9v", "post_id": "cvr7i9", "comment": "Awesome job! This looks fantastic! 👍"}, {"comment_id": "ey62rxx", "post_id": "cvr7i9", "comment": "Thank you kind stranger 🙏"}, {"comment_id": "ey664hq", "post_id": "cvr7i9", "comment": "How could you forget normal spongebob"}, {"comment_id": "ey66noo", "post_id": "cvr7i9", "comment": "What’d you use to color it"}, {"comment_id": "ey670w7", "post_id": "cvr7i9", "comment": "Alcohol markers (promarker brand) 😊"}, {"comment_id": "ey67ujm", "post_id": "cvr7i9", "comment": "Nice 👌"}, {"comment_id": "ey67zhe", "post_id": "cvr7i9", "comment": "Holy crap!!! 🖤🖤🖤🖤👏🏻👏🏻👏🏻"}, {"comment_id": "ey6fnww", "post_id": "cvr7i9", "comment": "🙏🙌"}, {"comment_id": "ey68iso", "post_id": "cvr7i9", "comment": "These are amazing! Every one I have seen has been dope!"}, {"comment_id": "ey6flrl", "post_id": "cvr7i9", "comment": "Thank you kind sir!"}, {"comment_id": "ey68vyk", "post_id": "cvr7i9", "comment": "Bob"}, {"comment_id": "ey69s15", "post_id": "cvr7i9", "comment": "Great job!"}, {"comment_id": "ey6fbal", "post_id": "cvr7i9", "comment": "Thank you 🙏"}, {"comment_id": "ey6a9wl", "post_id": "cvr7i9", "comment": "love it"}, {"comment_id": "ey6czsh", "post_id": "cvr7i9", "comment": "Thank you 🙏😊"}, {"comment_id": "ey6biwc", "post_id": "cvr7i9", "comment": "So damn talented!!"}, {"comment_id": "ey6bjdd", "post_id": "cvr7i9", "comment": "You've made an S for SpongeBob, but now you gotta flip it and make an S for Sandy!"}, {"comment_id": "ey6bsj7", "post_id": "cvr7i9", "comment": "Maybe in another alphabet series in the future 😁"}, {"comment_id": "esdmjjx", "post_id": "c77ght", "comment": "Earthworm Jen"}, {"comment_id": "esdtnka", "post_id": "c77ght", "comment": "Picasso...hold. my beer!"}, {"comment_id": "esed8sg", "post_id": "c77ght", "comment": "Love it"}, {"comment_id": "esdv7w7", "post_id": "c77ght", "comment": "Rated R"}, {"comment_id": "ese4omt", "post_id": "c77ght", "comment": "Cruising through the universe having lots of fun"}, {"comment_id": "esed5sp", "post_id": "c77ght", "comment": "WTF???"}, {"comment_id": "eseb8sj", "post_id": "c77ght", "comment": "i knew it looked familiar lol"}, {"comment_id": "eseiu5o", "post_id": "c77ght", "comment": "G-G-G-Grooooovy!"}, {"comment_id": "esdx481", "post_id": "c77ght", "comment": "Beat me to it!!!"}, {"comment_id": "esdv1dz", "post_id": "c77ght", "comment": "Gpk reference?"}, {"comment_id": "esfaf8j", "post_id": "c77ght", "comment": "It's Earthworm Sally\nSpreading diseases from Florida to Cali"}, {"comment_id": "esdo05g", "post_id": "c77ght", "comment": "I’m torn between “this is the most amazing thing I’ve ever seen” and “this is the most horrifying thing I’ve ever seen.” Either way, it’s pretty brilliant."}, {"comment_id": "ese0xhq", "post_id": "c77ght", "comment": "I was planning on sleeping tonight but"}, {"comment_id": "ese2fgj", "post_id": "c77ght", "comment": "One does not simply draw well and fuck it up halfway"}, {"comment_id": "ese57zh", "post_id": "c77ght", "comment": "Between the drawing and OPs username i'm so horrified and yet i can't stop laughing"}, {"comment_id": "ese9qu3", "post_id": "c77ght", "comment": "Indeed."}, {"comment_id": "esea0vb", "post_id": "c77ght", "comment": "The two aren't mutually exclusive"}, {"comment_id": "esfaop8", "post_id": "c77ght", "comment": "r/TIHI"}, {"comment_id": "esdnx3d", "post_id": "c77ght", "comment": "I think you’re onto something pretty dope.  Could you repeat your “incomplete method” with a known celebrity face or provide a pic of how your subject truly looks?"}, {"comment_id": "esdr4m5", "post_id": "c77ght", "comment": "The main features are all properly positioned relative to eachother."}, {"comment_id": "ese2tln", "post_id": "c77ght", "comment": "She is beauty,\nShe is grace,\nShe is missing half her face"}, {"comment_id": "ese36ja", "post_id": "c77ght", "comment": "Just by looking at her face I think I’ll invest in mace"}, {"comment_id": "esdl8p0", "post_id": "c77ght", "comment": "r/TIHI"}, {"comment_id": "esdolxo", "post_id": "c77ght", "comment": "Exactly what I thought! It's actually really cool and disturbing I like to hate it."}, {"comment_id": "esdny6t", "post_id": "c77ght", "comment": "No way my dude, you *finished* it!"}, {"comment_id": "esdwr71", "post_id": "c77ght", "comment": "Tbh this is the kind of good shit that I saw in art gallery trips for AP Art when I was in HS."}, {"comment_id": "esdx49k", "post_id": "c77ght", "comment": "Lmao I just finished ap art and hs"}, {"comment_id": "esdoc6i", "post_id": "c77ght", "comment": "Im sorry, it looks nice but i have to do this\n\n\n\nr/Cursed_Images"}, {"comment_id": "ese31a5", "post_id": "c77ght", "comment": "Sometimes it be like that"}, {"comment_id": "ese2fhw", "post_id": "c77ght", "comment": "dear god this goes without saying. but i mean theres still artistic talent"}, {"comment_id": "esdklw7", "post_id": "c77ght", "comment": "I love it"}, {"comment_id": "esdxo1y", "post_id": "c77ght", "comment": "fcking brilliant. well-executed and humorously unsettling.  \n\nit honestly looks like you did this intentionally. maybe you could try experimenting with this idea? i love this surrealist silhouette - i bet u cld do some dope stuff if you leaned into the absurdity while flexible your gorgeous(!!!) realism on purpose. like, u might be onto smth here. \n\ngud work friend :)"}, {"comment_id": "ese33xf", "post_id": "c77ght", "comment": "Thank you I appreciate you"}, {"comment_id": "esekadt", "post_id": "c77ght", "comment": "Like a portrait of what a person values most. All else is neglected."}, {"comment_id": "esdiygi", "post_id": "c77ght", "comment": "It’s me"}, {"comment_id": "esdyydv", "post_id": "c77ght", "comment": "Prove it"}, {"comment_id": "esdkmj8", "post_id": "c77ght", "comment": "Lmfao I love it"}, {"comment_id": "esdl6th", "post_id": "c77ght", "comment": "Cursed"}, {"comment_id": "esdlh2h", "post_id": "c77ght", "comment": "Intriguing, haunting, cerebral"}, {"comment_id": "esdntpa", "post_id": "c77ght", "comment": "Haha I love it. I live for weird shit like this"}, {"comment_id": "esdnb4g", "post_id": "c77ght", "comment": "Into it."}, {"comment_id": "esdq32c", "post_id": "c77ght", "comment": "Lazy fuck"}, {"comment_id": "ese34a2", "post_id": "c77ght", "comment": "I loled"}, {"comment_id": "esdyhya", "post_id": "c77ght", "comment": "This is your style now.\n\nMore please :)"}, {"comment_id": "esdoqx0", "post_id": "c77ght", "comment": "Please make more of these"}, {"comment_id": "esdk3i6", "post_id": "c77ght", "comment": "Story of my life"}, {"comment_id": "esdt00g", "post_id": "c77ght", "comment": "It’s the Snapchat filter!"}, {"comment_id": "esdt9w5", "post_id": "c77ght", "comment": "_alabama kids be like_"}, {"comment_id": "esdwwtk", "post_id": "c77ght", "comment": "Believe it or not, I thought I had seen something similar before.\nThen it hit me...\n[Oblina](https://aaahhrealmonsters.fandom.com/wiki/Oblina?file=Oblina_Shrugging.png) from Aaahh!!! Real Monsters."}, {"comment_id": "esei4ku", "post_id": "c77ght", "comment": "Thank you!"}, {"comment_id": "esdjd0y", "post_id": "c77ght", "comment": "https://i.imgur.com/yfVyWiF.jpg"}, {"comment_id": "esds4kl", "post_id": "c77ght", "comment": "This has meme potential."}, {"comment_id": "esds5lo", "post_id": "c77ght", "comment": "I want this on my wall"}, {"comment_id": "esdumf4", "post_id": "c77ght", "comment": "Please don't end it. Your drawings are great and the world would be a worse place without you."}, {"comment_id": "esdv0ge", "post_id": "c77ght", "comment": "Aww my heart"}, {"comment_id": "ese1p2q", "post_id": "c77ght", "comment": "Kinda like Game of Thrones season 8"}, {"comment_id": "ese2zof", "post_id": "c77ght", "comment": "Unfortunately.."}, {"comment_id": "esdjnko", "post_id": "c77ght", "comment": "I like it, shows inner beauty."}, {"comment_id": "esdqmkm", "post_id": "c77ght", "comment": "Always give up...."}, {"comment_id": "esds05a", "post_id": "c77ght", "comment": "Reminds me of [Angela Anaconda](https://www.google.com/search?client=safari&hl=en-us&ei=0jEYXdD4L9vWtQaW2oqADg&q=angela+anaconda&gs_ssp=eJzj4tTP1TcwNrAwLTBgBAAQiwKA&oq=angela+a&gs_l=mobile-gws-wiz-serp.1.0.46i67i275j46j0i131j0l2j46j0l2.5921.10071..11139...0.0..0.340.2191.0j1j4j3......0....1.......8..41j46i67j0i67j46i131.3cMpcvvbcX0)"}, {"comment_id": "ese1bbg", "post_id": "c77ght", "comment": "dude i'm so glad i wasn't the only one who thought of that"}, {"comment_id": "esds8s1", "post_id": "c77ght", "comment": "i shed tears"}, {"comment_id": "esdscff", "post_id": "c77ght", "comment": "Usually when you \"give up and end it\" its supposed to look stupid and unfinished, but this looks soo good it looks like a new art. I really like this!"}, {"comment_id": "esdsfgu", "post_id": "c77ght", "comment": "You should look at[Cindy Sherman’s](https://bust.com/images/articles/37518/CindyShermanheader.jpg) work. It’s reminiscent, but with digitally manipulated photographs."}, {"comment_id": "esdtnec", "post_id": "c77ght", "comment": "I like it. It somehow reminds me of something from the 90s. Angela Anaconda maybe? Or that one show with some creepy puppet dude and some lady that looked like Kathy Griffin?"}, {"comment_id": "esduhtu", "post_id": "c77ght", "comment": "I love this Snapchat filter"}, {"comment_id": "esduu0m", "post_id": "c77ght", "comment": "I don't understand how you got the perspective of the face so perfect without at least outlining the rest of the head."}, {"comment_id": "esduuyy", "post_id": "c77ght", "comment": "I just adore this. It lights my soul on fire. 🔥👻"}, {"comment_id": "esdv149", "post_id": "c77ght", "comment": "[deleted]"}, {"comment_id": "esf90pn", "post_id": "c77ght", "comment": "Haha but no don't"}, {"comment_id": "esdxpvq", "post_id": "c77ght", "comment": "Im sorry but i am so distracted by your username"}, {"comment_id": "ese3rcg", "post_id": "c77ght", "comment": "Gotta give you bonus creativity/style points on how you ended it"}, {"comment_id": "ese3y7d", "post_id": "c77ght", "comment": "I love it! It made laugh more than it should have tbh"}, {"comment_id": "ese53p6", "post_id": "c77ght", "comment": "thank you, prolapsed uterus!"}, {"comment_id": "esf2t7i", "post_id": "c77ght", "comment": "Anytime!"}, {"comment_id": "esf1wzc", "post_id": "c77ght", "comment": "This is really brilliant. Idk what it means to you but in one perspective I can see how it could represent how we see ourselves distorted from reality depending on what’s going on with us."}, {"comment_id": "esdngvs", "post_id": "c77ght", "comment": "I actually really like it"}, {"comment_id": "esdocw3", "post_id": "c77ght", "comment": "I love this. I also love the title."}, {"comment_id": "esdoh2h", "post_id": "c77ght", "comment": "THIS IS (not sparta) AWESOME!!"}, {"comment_id": "esdq8m8", "post_id": "c77ght", "comment": "I feel like this is kind of creative"}, {"comment_id": "esdqh0g", "post_id": "c77ght", "comment": "i honestly love how it turned out! it could be a character in a \"scary stories to tell in the dark\" books"}, {"comment_id": "esdqmtr", "post_id": "c77ght", "comment": "Jack stauber vibes"}, {"comment_id": "eon2f3r", "post_id": "bsgasi", "comment": "Enjoyed this ☺️☺️"}, {"comment_id": "eon5gvg", "post_id": "bsgasi", "comment": "Thanks!"}, {"comment_id": "eon2v83", "post_id": "bsgasi", "comment": "It would be awesome if you did something similar but with cold colours!"}, {"comment_id": "eon5fwv", "post_id": "bsgasi", "comment": "I actually did, they're [sunrise and sunset](https://i.imgur.com/LJHbABx.png) :)"}, {"comment_id": "eon330n", "post_id": "bsgasi", "comment": "It’s nice. Works as a phone wallpaper."}, {"comment_id": "eonep2k", "post_id": "bsgasi", "comment": "Yep haha.  Kinda wish they'd post a larger version of the darker-colored one, as well."}, {"comment_id": "eonaexq", "post_id": "bsgasi", "comment": "Same, gonna go for a summer aesthetic"}, {"comment_id": "eon2rmd", "post_id": "bsgasi", "comment": "I love it!\n\nI would totally use it as a poster"}, {"comment_id": "eongssr", "post_id": "bsgasi", "comment": "[deleted]"}, {"comment_id": "eonsoiw", "post_id": "bsgasi", "comment": "Indeed. It seems really random as to what gets attention and what doesn’t. I’ve seen things that could be done by a 4 year old get tons of attention and literal masterpieces get no karma at all. It’s so random."}, {"comment_id": "eoo7rm0", "post_id": "bsgasi", "comment": "There ought to be a new rule with regard to titles, as this is becoming all too common in this subreddit. I just want to see art. I don’t want to see false modesty or sob stories"}, {"comment_id": "eoo3p0z", "post_id": "bsgasi", "comment": "What's also sad is it seems to work. Context is king on reddit. \"Hay guys my neighbours SO with depression knit this he doesn't think it's any good\". 230k upvotes."}, {"comment_id": "eoowrzm", "post_id": "bsgasi", "comment": "I thought I was the only one swho noticed, there are far better works that go unnoticed on daily basis lol."}, {"comment_id": "eooc66l", "post_id": "bsgasi", "comment": "honestly I don’t even see the problem with what he wrote. Have you ever created something and put it up online? It’s personal as hell. \n\nI highly doubt he wanted sympathy karma. There’s getting upvotes for a post and then there’s getting upvotes for your own art. Who the hell wants pity points when showing people their art.\n\nHis title just sounds like the first ok title he came up with."}, {"comment_id": "eonm4gz", "post_id": "bsgasi", "comment": "This is very reminiscent of 90s cartoons that take place in big cities--I'm thinking Hey! Arnold, specifically. \n\nI love it! What's the medium?"}, {"comment_id": "eonvbkh", "post_id": "bsgasi", "comment": "I used pen and paper for the drawing and photoshop for the colouring!"}, {"comment_id": "eoo1bkc", "post_id": "bsgasi", "comment": "[deleted]"}, {"comment_id": "eon16ed", "post_id": "bsgasi", "comment": "Very nice! ✨✨✨"}, {"comment_id": "eon6amn", "post_id": "bsgasi", "comment": "I love the coloring on this!!"}, {"comment_id": "eon84v0", "post_id": "bsgasi", "comment": "I love this! It's honestly so beautiful. I'm currently watching Hilda on Netflix with my son, and your drawing makes me think of the style of the show 😍"}, {"comment_id": "eon92ed", "post_id": "bsgasi", "comment": "Thank you! I haven't seen it but it looks cute :)"}, {"comment_id": "eonbn57", "post_id": "bsgasi", "comment": "I just want to recommend the animated film \"A Cat in Paris\"  - fantastic movie and OPs drawing reminded me of it."}, {"comment_id": "eon6cbd", "post_id": "bsgasi", "comment": "🔥🔥🔥"}, {"comment_id": "eon6eer", "post_id": "bsgasi", "comment": "I love this"}, {"comment_id": "eonbdwd", "post_id": "bsgasi", "comment": "It looks like Hong Kong more than Japan\nBtw great artwork ~~~"}, {"comment_id": "eonbmz5", "post_id": "bsgasi", "comment": "I actually have it called Hong Kong sunset/sunrise in my folder haha. Not sure why I wrote the signs in Japanese.."}, {"comment_id": "eonivj1", "post_id": "bsgasi", "comment": "It's beautiful and very dreamy."}, {"comment_id": "eonjyac", "post_id": "bsgasi", "comment": "I love this so much!! If you added a bit of neon and purple tones to your sunset image, it would *scream* vaporwave aesthetic. Anywho, I love your style."}, {"comment_id": "eonlt5z", "post_id": "bsgasi", "comment": "太夫時内 basically days “fat husband inside temple” with a literal translation. There may be more nuance that I’m unaware of though. \n\nWhy did you pick those characters?"}, {"comment_id": "eonvdt3", "post_id": "bsgasi", "comment": "That's hilarious. I was trying to copy some symbols from some random signs I googled but obviously didn't do too well.."}, {"comment_id": "eonyss2", "post_id": "bsgasi", "comment": "The window, right in the middle, looks super wrong,  \nBut the rest is perfectly fine.\n\nEspecially the left panel, where the bars start from the left,  \nand almost start converging on the other side,  \nWhile the bottom of the window implies a whole other angle.  \nWhile the other one looks normal.\n\nPlus the reflection in the windows don't make it look like they've moved outwards,  \nMore like a 4th-dimentional translation where the insides have moved up."}, {"comment_id": "eonc0xp", "post_id": "bsgasi", "comment": "Just post your work, no one cares about the sob story behind it."}, {"comment_id": "eong5jr", "post_id": "bsgasi", "comment": "Jesus dude, clearly this wasn't for you then! Just be mediocre on your own time, no one cares about your sob story behind it."}, {"comment_id": "eon4ztr", "post_id": "bsgasi", "comment": "this is really good!!! im glad you shared this"}, {"comment_id": "eon56jx", "post_id": "bsgasi", "comment": "Wow! That’s lovely, I really like the color palette"}, {"comment_id": "eong4q1", "post_id": "bsgasi", "comment": "It's really cool, but the perspective is inconsistent"}, {"comment_id": "eontfyf", "post_id": "bsgasi", "comment": "Perspective is subjective my friend"}, {"comment_id": "eon5jz1", "post_id": "bsgasi", "comment": "Lovely"}, {"comment_id": "eon5jz4", "post_id": "bsgasi", "comment": "It’s great! Thank you for sharing :)"}, {"comment_id": "eon5kvd", "post_id": "bsgasi", "comment": "I love this!! It feels so calming to look at. Great work OP"}, {"comment_id": "eon5t25", "post_id": "bsgasi", "comment": "Ah ❤ lovely work OP"}, {"comment_id": "eon5vqm", "post_id": "bsgasi", "comment": "Woooooah this is awesome!"}, {"comment_id": "eon5wfl", "post_id": "bsgasi", "comment": "Such nice warm colors, very pretty. Good job!"}, {"comment_id": "eon60sm", "post_id": "bsgasi", "comment": "Have my upvote mate!"}, {"comment_id": "eon61mo", "post_id": "bsgasi", "comment": "I feel at peace looking at this lol"}, {"comment_id": "eon62ju", "post_id": "bsgasi", "comment": "Wow. I’m a big fan of this style and the colours, especially contrasted to the sunset version."}, {"comment_id": "eon6633", "post_id": "bsgasi", "comment": "I really like this. Does this style have a name?"}, {"comment_id": "eon692k", "post_id": "bsgasi", "comment": "this is awesome! i love all the detail! would you mind if i downloaded this to use as a wallpaper for my phone? :)"}, {"comment_id": "eon6fez", "post_id": "bsgasi", "comment": "Of course not, thank you! :)"}, {"comment_id": "eon9idb", "post_id": "bsgasi", "comment": "I think r/imaginarysliceoflife would love this"}, {"comment_id": "eon9rb8", "post_id": "bsgasi", "comment": "Noobie question but what software did you use for this?"}, {"comment_id": "eon9y4v", "post_id": "bsgasi", "comment": "I drew the picture with pen and paper first then scanned it and coloured it in photoshop"}, {"comment_id": "eon4x10", "post_id": "bsgasi", "comment": "It's beautiful it should get more attention"}, {"comment_id": "eon6gan", "post_id": "bsgasi", "comment": "Nice job, that's now my phone background."}, {"comment_id": "eon6jb1", "post_id": "bsgasi", "comment": "It's really good mate"}, {"comment_id": "eon6ubi", "post_id": "bsgasi", "comment": "This is so beautiful! Amazing job :))"}, {"comment_id": "eon6wre", "post_id": "bsgasi", "comment": "Very nice, very nice indeed"}, {"comment_id": "eon70bj", "post_id": "bsgasi", "comment": "Makes me nostalgic. Love."}, {"comment_id": "eon70hr", "post_id": "bsgasi", "comment": "I love it!!! Looks like something I would try to draw"}, {"comment_id": "eon720s", "post_id": "bsgasi", "comment": "This is fantastic! You're a very talented artist, please keep it up you have a really cool style!"}, {"comment_id": "eon78vk", "post_id": "bsgasi", "comment": "You're talented OP, thanks for sharing your drawing."}, {"comment_id": "eon7pef", "post_id": "bsgasi", "comment": "u have my attention bae"}, {"comment_id": "eon7qop", "post_id": "bsgasi", "comment": "Beautiful colours and art!"}, {"comment_id": "eon7s5e", "post_id": "bsgasi", "comment": "gosh I absolutely love this! The colors and the perspective are so fun to look at. Good stuff :)"}, {"comment_id": "eon7wus", "post_id": "bsgasi", "comment": "In love with this aesthetic"}, {"comment_id": "eon87rl", "post_id": "bsgasi", "comment": "Goddamn that's good! I wish I saw the sketches."}, {"comment_id": "eon8982", "post_id": "bsgasi", "comment": "Flip it and do it in cool colors!"}, {"comment_id": "eon96ii", "post_id": "bsgasi", "comment": "If you scroll up to one of the earlier comments you can see the cool version!"}, {"comment_id": "eon8asp", "post_id": "bsgasi", "comment": "This looks super cool!"}, {"comment_id": "eon8ddf", "post_id": "bsgasi", "comment": "I love this"}, {"comment_id": "e08i6an", "post_id": "8p4o7y", "comment": "\"My wife has been photographing some waves\"\n\nThe realism is astonishing! Congrats!"}, {"comment_id": "e08mi21", "post_id": "8p4o7y", "comment": "I sincerely think that OP missed an opportunity to post \"My wife is making waves!\""}, {"comment_id": "e08voos", "post_id": "8p4o7y", "comment": "Haha, I'll let her know, she will be very flattered :)"}, {"comment_id": "e091gq8", "post_id": "8p4o7y", "comment": "My first thought was \"I hate this stupid trend of putting white borders and captions around photos and gifs\". Now I just feel silly."}, {"comment_id": "e094zjv", "post_id": "8p4o7y", "comment": "Photograph and then draw. Drawing it in real life would be extremely difficult because how fast the water moves. That's why older era paintings never had as realistic pictures of waves as we have today."}, {"comment_id": "e08r4g9", "post_id": "8p4o7y", "comment": "Wavy 🌊🌊"}, {"comment_id": "e08wypp", "post_id": "8p4o7y", "comment": "Very cool!"}, {"comment_id": "e0916z3", "post_id": "8p4o7y", "comment": "waves don’t die 🌊"}, {"comment_id": "e091g7n", "post_id": "8p4o7y", "comment": "Tweaking tweaking off that 2CB huh?"}, {"comment_id": "e08tfcv", "post_id": "8p4o7y", "comment": "There it is"}, {"comment_id": "e098prj", "post_id": "8p4o7y", "comment": "she a wavy dude"}, {"comment_id": "e0965y6", "post_id": "8p4o7y", "comment": "Legit could imagine Kanye staring at this."}, {"comment_id": "e08jma4", "post_id": "8p4o7y", "comment": "No way, this is incredible! "}, {"comment_id": "e4478vo", "post_id": "8p4o7y", "comment": "No wave!"}, {"comment_id": "e08ket1", "post_id": "8p4o7y", "comment": "Tell her it's perfect.  I look forward to seeing more of her work.  "}, {"comment_id": "e08iokb", "post_id": "8p4o7y", "comment": "Beautiful style. I like how she captured the short choppy waves. Very cool."}, {"comment_id": "e08qtfa", "post_id": "8p4o7y", "comment": "My thoughts exactly"}, {"comment_id": "e08l945", "post_id": "8p4o7y", "comment": "I would LOVE a print of this! This is amazing!"}, {"comment_id": "e08ef0w", "post_id": "8p4o7y", "comment": "Had to zoom in to see it was a drawing. Nice work!"}, {"comment_id": "e08fyb8", "post_id": "8p4o7y", "comment": "Haha thanks, I'll let her know :)"}, {"comment_id": "e08shv5", "post_id": "8p4o7y", "comment": "Same I thought the post was a joke at first. \n\nLooks crazy real on my phone."}, {"comment_id": "e08w7yg", "post_id": "8p4o7y", "comment": "Does she have an online shop?? I’d love to purchase some prints ❤️"}, {"comment_id": "e096f3c", "post_id": "8p4o7y", "comment": "http://www.bethanymoffat.com/"}, {"comment_id": "e08y7j5", "post_id": "8p4o7y", "comment": "Ditto!"}, {"comment_id": "e0901vq", "post_id": "8p4o7y", "comment": "Same!\n"}, {"comment_id": "e090rz7", "post_id": "8p4o7y", "comment": "Same I love this"}, {"comment_id": "e095wqn", "post_id": "8p4o7y", "comment": "Ditto I'd love to have a print of this! "}, {"comment_id": "e08lcty", "post_id": "8p4o7y", "comment": "I'm pretty sure your wife is a camera"}, {"comment_id": "e08vqwp", "post_id": "8p4o7y", "comment": "r/fakealbumcovers"}, {"comment_id": "e096bvv", "post_id": "8p4o7y", "comment": "Audioslave has an album that looks quite a bit like this "}, {"comment_id": "e08tmc2", "post_id": "8p4o7y", "comment": "Great work! Your wife is in good company. [Vija Celmins](http://www.tate.org.uk/art/artworks/celmins-ocean-p78336) is internationally known for her ocean drawings."}, {"comment_id": "e08mlnr", "post_id": "8p4o7y", "comment": "She sure is making waves with her art"}, {"comment_id": "e08m67x", "post_id": "8p4o7y", "comment": "Wow this is amazing. Do you have a link to some of her other works? "}, {"comment_id": "e08ujac", "post_id": "8p4o7y", "comment": "She might really like Vija Celmins drawings. Should at least check them out for sure. "}, {"comment_id": "e08n45u", "post_id": "8p4o7y", "comment": "You have a cool wife "}, {"comment_id": "e08u076", "post_id": "8p4o7y", "comment": "That's incredible! I don't think I'll ever be able to wrap my head around how to paint waves. I'm too impatient and just end up painting little Ws everywhere. "}, {"comment_id": "e0918w9", "post_id": "8p4o7y", "comment": "It certainly requires alot of patiences, she sits there for hours on end! "}, {"comment_id": "e0972z2", "post_id": "8p4o7y", "comment": "Wavy 🌊"}, {"comment_id": "e09b8f0", "post_id": "8p4o7y", "comment": "It’s your boy max b"}, {"comment_id": "e08wunm", "post_id": "8p4o7y", "comment": "Confirmed Wavy 🌊 🌊 🌊 🌊 "}, {"comment_id": "e09b8bf", "post_id": "8p4o7y", "comment": "It’s your boy max b"}, {"comment_id": "e08z4yq", "post_id": "8p4o7y", "comment": "r/kanye "}, {"comment_id": "e09b91l", "post_id": "8p4o7y", "comment": "Y E E Z Y Y E E Z Y W H A T S G O O D"}, {"comment_id": "e08kmot", "post_id": "8p4o7y", "comment": "😳😳😳😳😳😳😳😳😳😳😳"}, {"comment_id": "e08mqq7", "post_id": "8p4o7y", "comment": "Wow, i thought it was a photo i was scrolling past. Great job! "}, {"comment_id": "e08p2bp", "post_id": "8p4o7y", "comment": "Wow I'm impressed! Hyperrealism 💯✔"}, {"comment_id": "e08pcyl", "post_id": "8p4o7y", "comment": "You mean taking pictures of water right? Because thats so damn great I cant believe its a drawing, your wife done a great job."}, {"comment_id": "e08w2dj", "post_id": "8p4o7y", "comment": "She has fucked my shit RIGHT up."}, {"comment_id": "e08yo2o", "post_id": "8p4o7y", "comment": "Took me a second before I realised this wasn't a gif that wasn't loading"}, {"comment_id": "e08yr1y", "post_id": "8p4o7y", "comment": "I'm pretty sure I follow your wife on instagram- I think from when you had posted some of her work before! Did she recently post her amazing fish print (drawing of fish that is now a print)? She is SO TALENTED!! I LOVE seeing her work pop up on my feed! "}, {"comment_id": "e6y6q49", "post_id": "8p4o7y", "comment": "Sorry only just saw this. I'll let her know, she would be very flattered :) "}, {"comment_id": "e090mnk", "post_id": "8p4o7y", "comment": "Whoa, what medium is this?? Looks like maybe charcoal but it looks so realistic I can’t tell"}, {"comment_id": "e096qag", "post_id": "8p4o7y", "comment": "This is amazing! \n\nIf she ever did one in large scale across an entire gallery wall, it would be too overwhelming to stand in front of. "}, {"comment_id": "e098dib", "post_id": "8p4o7y", "comment": "Can your wife demonstrate her technique for us learners? \n"}, {"comment_id": "e098tu6", "post_id": "8p4o7y", "comment": "Is it possible to learn this power?"}, {"comment_id": "e09912i", "post_id": "8p4o7y", "comment": "Is your wife's name Canon? "}, {"comment_id": "e09ance", "post_id": "8p4o7y", "comment": "Very cool, Kanye!"}, {"comment_id": "e09cwrp", "post_id": "8p4o7y", "comment": "No f*cking wave!"}, {"comment_id": "e09dt90", "post_id": "8p4o7y", "comment": "It's so perfect i tried moving up and down trying to make it move because i thought it was a gif. "}, {"comment_id": "e09gkgz", "post_id": "8p4o7y", "comment": "ocean confirmed wavy 🌊🌊 "}, {"comment_id": "e09gx49", "post_id": "8p4o7y", "comment": "This is awesome. \n\nIs it ok with your wife if I save this as a technique reference for whenever I try and draw waves? "}, {"comment_id": "e0a5lxs", "post_id": "8p4o7y", "comment": "This is amazing. Two questions: 1. How big is this? 2. Does she have any interest in doing commissioned work?         "}, {"comment_id": "e0aiwp8", "post_id": "8p4o7y", "comment": "This one is 760mm by 560mm :) she's looking at taking commissions later in the year."}, {"comment_id": "e0ag2vg", "post_id": "8p4o7y", "comment": "I knew right away this was Beth’s work! She’s amazing!"}, {"comment_id": "e0eol0x", "post_id": "8p4o7y", "comment": "Oh my bad, my bad. I see what I've done there. Let's do molly together and talk about the lizard people from hollow earth while we paint on skateboards."}, {"comment_id": "e1cx5uk", "post_id": "8p4o7y", "comment": "This looks like a photograph! Very cool 👍"}, {"comment_id": "e08mzc7", "post_id": "8p4o7y", "comment": "[Made me think of Audioslave ](https://upload.wikimedia.org/wikipedia/en/thumb/e/e4/Audioslave_-_Out_of_Exile.jpg/220px-Audioslave_-_Out_of_Exile.jpg) \n\nRIP Chris Cornell"}, {"comment_id": "e08kv61", "post_id": "8p4o7y", "comment": "That’s either witchcraft or a picture"}, {"comment_id": "e08vvdk", "post_id": "8p4o7y", "comment": "How many times do I have to tell you people, stop taking pictures and calling them art!"}, {"comment_id": "e09asbp", "post_id": "8p4o7y", "comment": "Sigh. You have a wife. :("}, {"comment_id": "e09bd70", "post_id": "8p4o7y", "comment": "Wow your life is sad "}, {"comment_id": "e08oi1g", "post_id": "8p4o7y", "comment": "Wow, this is superb! Hats off to your wife, thanks for sharing."}, {"comment_id": "e08qes8", "post_id": "8p4o7y", "comment": "Amazing!! Looks like a photo of choppy seas"}, {"comment_id": "e08row2", "post_id": "8p4o7y", "comment": "wow"}, {"comment_id": "e08rr48", "post_id": "8p4o7y", "comment": "Wow! "}, {"comment_id": "e08ru1g", "post_id": "8p4o7y", "comment": "Looks like a photograph. Well done"}, {"comment_id": "e08ta4x", "post_id": "8p4o7y", "comment": "oh my."}, {"comment_id": "dyvekng", "post_id": "8ixwlu", "comment": "Get an A? "}, {"comment_id": "dyveqge", "post_id": "8ixwlu", "comment": "Yes"}, {"comment_id": "dywacar", "post_id": "8ixwlu", "comment": "Pipe's too small. B-"}, {"comment_id": "dywazbi", "post_id": "8ixwlu", "comment": "B- tops. BELT AND SUSPENDERS?! Can’t trust a man who doesn’t trust his own pants. "}, {"comment_id": "dyvvehn", "post_id": "8ixwlu", "comment": "A belt AND suspenders. Can't be too careful. "}, {"comment_id": "dyvxwts", "post_id": "8ixwlu", "comment": "Looks like the built is more to hold additional things, like that ring thingie and the holster, than to hold the pants.\n\nMaybe it's the difference in time though, but usually the buttons for the suspender loop are on the inside of the waist and. At least in the pants I have. "}, {"comment_id": "dyw69zc", "post_id": "8ixwlu", "comment": "And thus, one of my favorite Western film quotes, \"How can you trust a man who wears both a belt and suspenders? The man can't even trust his own pants.\""}, {"comment_id": "dyw5868", "post_id": "8ixwlu", "comment": "A belt is useful tool to have... around."}, {"comment_id": "dywb8dw", "post_id": "8ixwlu", "comment": "I had a professor in law school who always used to say: \"you want to be a belt and suspenders lawyer so you never get caught with your pants down.\" Still good advice."}, {"comment_id": "dyw8te5", "post_id": "8ixwlu", "comment": "My grandfather did this because he had no ass and a massive beer but that pushed his pants down. The belt is to show off the buckle and Confederate flag. My phone makes Confederate capital. I typed it out that time because I am in fact not a nazi sympathizer but popi earny sure was. "}, {"comment_id": "dyvgy1n", "post_id": "8ixwlu", "comment": "That's amazing! Congrats for both. Wish I could find that shirt's yellow tone pen on my country. Which brand are those ballpoint pens, if you don't mind saying?"}, {"comment_id": "dyvif2p", "post_id": "8ixwlu", "comment": "Thanks . you can use monami or STAEDTLER pens"}, {"comment_id": "dyvepfm", "post_id": "8ixwlu", "comment": "Damn, how old is she? That must've taken years of practice"}, {"comment_id": "dyverwk", "post_id": "8ixwlu", "comment": "She is 24 year's old . yes she practice a lot "}, {"comment_id": "dyvkxs6", "post_id": "8ixwlu", "comment": "That's some elite level ball point penning right there. "}, {"comment_id": "dyvne4r", "post_id": "8ixwlu", "comment": "I absolutely love this!\n\n I quit drinking about 6 years ago now and prospecting was one of the hobbies that kept my hands and mind busy. \n\n I also didn't know pens could be used in such a great way."}, {"comment_id": "dyvpsel", "post_id": "8ixwlu", "comment": "I need to take up prospecting, what did you use a rotary dial telephone?  ;)"}, {"comment_id": "dyvkoy4", "post_id": "8ixwlu", "comment": "Holy moly that's insane"}, {"comment_id": "dyvlc7h", "post_id": "8ixwlu", "comment": "I refuse to believe that this is real absolutely amazing"}, {"comment_id": "dyvgyoh", "post_id": "8ixwlu", "comment": "Could you send a close up picture of this?"}, {"comment_id": "dyvqfbp", "post_id": "8ixwlu", "comment": "Outstanding.....is there any agent used to blend colours?"}, {"comment_id": "dyw9qpc", "post_id": "8ixwlu", "comment": "Probably not. The only person I ever met who did this sort of work explained it to me as “overlapping” colors in a way that makes them look blended. "}, {"comment_id": "dywnja4", "post_id": "8ixwlu", "comment": "No its all about the pressure used. The inks sitting on top of each other and taking up different spaces on the paper trick our eyes into seeing new colours. Much like how monitors and printers work."}, {"comment_id": "dyvs4ld", "post_id": "8ixwlu", "comment": "I love working with ballpoint but this is incredible. What kind of pens does she use?"}, {"comment_id": "dyz6mer", "post_id": "8ixwlu", "comment": "The monami pens.\n\n"}, {"comment_id": "dyvx6co", "post_id": "8ixwlu", "comment": "Can you please update with finished work? Would love to see what it looks like finished"}, {"comment_id": "dyz64cr", "post_id": "8ixwlu", "comment": "Yes , I do it ."}, {"comment_id": "dyvuge5", "post_id": "8ixwlu", "comment": "[Oh peaches](https://www.google.com/search?q=oh+peaches+gif&oq=oh+peaches&aqs=chrome.1.69i57j0l3.3893j1j9&client=ms-android-verizon&sourceid=chrome-mobile&ie=UTF-8#imgrc=rzmeSQfW8hbFsM:) but seriously, that looks fantastic "}, {"comment_id": "dyw7mo5", "post_id": "8ixwlu", "comment": "Ohhh cinnamon and gravy!"}, {"comment_id": "dyvn9lz", "post_id": "8ixwlu", "comment": "What an amazing gift (lots of practice helps I’m sure) to be able to do this. Really wonderful work. "}, {"comment_id": "dyz6x91", "post_id": "8ixwlu", "comment": "Thanks"}, {"comment_id": "dyvzov9", "post_id": "8ixwlu", "comment": "The student becomes the master."}, {"comment_id": "dyvo2v3", "post_id": "8ixwlu", "comment": "Wowwie wahwah"}, {"comment_id": "dyvtn8n", "post_id": "8ixwlu", "comment": "This ... is absurdly awesome. =D  Nice work! I've always enjoyed drawing ballpoint pens, but been frustrated by the lack of color choices and fugitive ink.  I might have to look into the brands you've mentioned.  Do you know if they're archival quality by chance?"}, {"comment_id": "dyvxhx7", "post_id": "8ixwlu", "comment": "Is no one going to point out it's Kevin Costner?"}, {"comment_id": "dyw6tup", "post_id": "8ixwlu", "comment": "control-f'd for this"}, {"comment_id": "dyw7ld9", "post_id": "8ixwlu", "comment": "Surprised this isn’t more of a discussion point. Looks kinda like he did in the Hatfields & McCoys series "}, {"comment_id": "dywc4w5", "post_id": "8ixwlu", "comment": "Haha, all the scribbles along the edges to get the pens started."}, {"comment_id": "dywcx3s", "post_id": "8ixwlu", "comment": "Amazing. I wish I had 1/16th of their ability. "}, {"comment_id": "dyys470", "post_id": "8ixwlu", "comment": "Thanks . By practise you can do it ."}, {"comment_id": "dyw0f2h", "post_id": "8ixwlu", "comment": "African American ball point pens*"}, {"comment_id": "dyvpp0m", "post_id": "8ixwlu", "comment": "That's no student.  That's a master-piece."}, {"comment_id": "dyvug8m", "post_id": "8ixwlu", "comment": "Always wondered. Was this done based on a reference or just dreamed up?"}, {"comment_id": "dywdmze", "post_id": "8ixwlu", "comment": "Generally, it'll be both. Dream up a scene, sketch out it's components and their composition, and then use references to get the rendering of the components correct. "}, {"comment_id": "dyvvaxu", "post_id": "8ixwlu", "comment": "As insanely amazing this is I can’t help wondering the subject matter and not cowboys shooting guns!!"}, {"comment_id": "dyvzl84", "post_id": "8ixwlu", "comment": "This is great! Did she use a special kind of paper for ballpoint pens? "}, {"comment_id": "dyz2fnh", "post_id": "8ixwlu", "comment": "Thanks . The Monami pens and The Fabriano papers"}, {"comment_id": "dyw0pmp", "post_id": "8ixwlu", "comment": "Is it just me or does pickaxe man look like Donald Trump with a beard if he had worked manual labor in his life?"}, {"comment_id": "dyw1kth", "post_id": "8ixwlu", "comment": "I can smell this image "}, {"comment_id": "dyw28oh", "post_id": "8ixwlu", "comment": "Best I can do is a B-"}, {"comment_id": "dywe6c6", "post_id": "8ixwlu", "comment": "Holy crap. That's amazing. Well done her.\n\nEdit: zoomed in on my phone to see female fingers. Well done her.\n\n"}, {"comment_id": "dywhbx3", "post_id": "8ixwlu", "comment": "That is fucking incredible "}, {"comment_id": "dywhyi1", "post_id": "8ixwlu", "comment": "Wow! So WOW!"}, {"comment_id": "dyvhhcz", "post_id": "8ixwlu", "comment": "Wow, great detail. I hope she keeps it up!"}, {"comment_id": "dyvi87f", "post_id": "8ixwlu", "comment": "Thanks\n"}, {"comment_id": "dyvl3e1", "post_id": "8ixwlu", "comment": "I couldn’t draw this if I traced it"}, {"comment_id": "dyvqjjz", "post_id": "8ixwlu", "comment": "[deleted]"}, {"comment_id": "dyw3de2", "post_id": "8ixwlu", "comment": "Actually they're perfectly in proportion to his tiny pipe.   Maybe it's the rest of him that's too big?"}, {"comment_id": "dyw0c6i", "post_id": "8ixwlu", "comment": "Good thing her hand is still in the photo. "}, {"comment_id": "dyvwrkv", "post_id": "8ixwlu", "comment": "I think the correct term is ballpoint pens of color. "}, {"comment_id": "dyvlrww", "post_id": "8ixwlu", "comment": "Wow, that is incredible! Thanks for sharing."}, {"comment_id": "dyz6y2y", "post_id": "8ixwlu", "comment": "Thanks a lot"}, {"comment_id": "dyvmt2m", "post_id": "8ixwlu", "comment": "Wow, she's amazing! She wins at life. "}, {"comment_id": "dyvozpl", "post_id": "8ixwlu", "comment": "Damn, now that's a prospector!"}, {"comment_id": "dyvp66d", "post_id": "8ixwlu", "comment": "I am extremely jealous of her skill. Very cool."}, {"comment_id": "dyz6szd", "post_id": "8ixwlu", "comment": "Thanks"}, {"comment_id": "dyvph9r", "post_id": "8ixwlu", "comment": "Meanwhile I can’t even take notes without getting ink on my hand. (Left handed)"}, {"comment_id": "dyvrd89", "post_id": "8ixwlu", "comment": "This kind of talent always blows my god dam mind."}, {"comment_id": "dyvri3m", "post_id": "8ixwlu", "comment": "This is amazing and her patience is outstanding. To take the time to fill all of that in, oh my. "}, {"comment_id": "dyvv07g", "post_id": "8ixwlu", "comment": "Omg your student uses pens very well. Give that kid an A++"}, {"comment_id": "dyvv3qe", "post_id": "8ixwlu", "comment": "fuck me holy shit thats awesome"}, {"comment_id": "dyvv59s", "post_id": "8ixwlu", "comment": "Keep us updated please "}, {"comment_id": "dyz6dam", "post_id": "8ixwlu", "comment": "Ok"}, {"comment_id": "dyvwfo5", "post_id": "8ixwlu", "comment": "This could be a custom Settlers of Catan box art. "}, {"comment_id": "dyvwjnv", "post_id": "8ixwlu", "comment": "If this is your student's work let's see some of yours!"}, {"comment_id": "dyvwz24", "post_id": "8ixwlu", "comment": "Can we have a video showing the progress? "}, {"comment_id": "dyvx321", "post_id": "8ixwlu", "comment": "They’re just ballpoint pens, it’s 2018, jesus. "}, {"comment_id": "dyz65ps", "post_id": "8ixwlu", "comment": "Yes only with ballpoint pens."}]