[{"comment_id": "dq6eop4", "post_id": "7eo0kj", "comment": "> user reports:\n\n> 1: This is spam\n\nIt is not. This is _vital_."}, {"comment_id": "dq6f4h0", "post_id": "7eo0kj", "comment": "Now we know what Ajit Pai has been up to!"}, {"comment_id": "dq6tyh5", "post_id": "7eo0kj", "comment": "Right and relevant. I have a sick feeling about bandwidth restrictions to professional service uploads like Pixieset. "}, {"comment_id": "dq6kkqo", "post_id": "7eo0kj", "comment": "[Here is a White House petition to save net neutrality](https://petitions.whitehouse.gov/petition/do-not-repeal-net-neutrality)"}, {"comment_id": "dq6sdsv", "post_id": "7eo0kj", "comment": "Ehh, kinda is"}, {"comment_id": "dq7qed1", "post_id": "7eo0kj", "comment": "It's spam and it's boring. Are we going to get stickied posts about all US legislation now? I thought when we had posts about people like Peter Souza it was pointed out to everyone that this isn't a politics sub."}, {"comment_id": "dq6we7v", "post_id": "7eo0kj", "comment": "No, it's the very definition of spam, and fear mongering to boot."}, {"comment_id": "dq7by9s", "post_id": "7eo0kj", "comment": "It IS spam.  By a moderator no less. I don't care of you think it is vital.   Half the spammers in the world think their message is vital.    Reporting and unsubscribing."}, {"comment_id": "dq6eeqa", "post_id": "7eo0kj", "comment": "[deleted]"}, {"comment_id": "dq73u86", "post_id": "7eo0kj", "comment": "Yeah agreed. It's insanity. Literally nobody wants this except ISPs. I'm fairly conservative and absolutely believe in the free market. But the ISPs only own a tiny amount of the infrastructure upon which the internet relies. And they're so monopolistic at this point that they would stifle the free market by being impossible to compete against. I'm as much against business interfering with politics as I am against politics interfering with business.\n\nIf you want to make more money as an ISP, you need to appeal to your customers and sell them something they didn't have. Not take away something they already had and sell it back to them."}, {"comment_id": "dq6fnr1", "post_id": "7eo0kj", "comment": ">\tThere is no \"other side\" to this goddamn argument.\n\nThis. The talking point that I see repeated among apologists for this is that this is about ”enabling the free market”. *It’s not*. There is no free market to enable with US broadband providers. Just monopolies and massive barriers to entry to keep out competition. This is pure, unadulterated regulatory capture."}, {"comment_id": "dq6erm9", "post_id": "7eo0kj", "comment": "Vote the scumbags out."}, {"comment_id": "dq707u1", "post_id": "7eo0kj", "comment": "> this is a battle we're having to fight every goddamn year\n\nPerhaps it's time to do something more drastic than call senators.\n\nSomeone in another sub reminded me of the possibility of mesh networks. At least in cities. These can't replace traditional ISPs in rural areas, can't be used to bridge continents, but it can really screw over ISP monopolies. The more they lobby your senators to be allowed to screw you over, the more interest them will be in circumventing them entirely.\n\n[It's worth a read](https://curiousmatic.com/forget-your-isp-mesh-networks-are-the-future-of-the-internet/)\n\nImagine, if you live in a city - plonking $100 down on a one-time purchase of a special router, and getting free and secure wifi at decent speeds with no monthly fees at all, and no centralized authority to cap your bandwidth and censor your use of the internet."}, {"comment_id": "dq6t3s7", "post_id": "7eo0kj", "comment": "File a complaint here- in the proceeding(s) line type- 17-108 Https://www.fcc.gov/ecfs/filings/express Under brief comments say you're filling a formal complaint against Ajit Pais plan to repeal net neutrality rules"}, {"comment_id": "dq7ef2a", "post_id": "7eo0kj", "comment": "Corporations need to grow, it’s in their dna, and their only morality. Monetizing already existing resources is a very efficient way to grow. Writing laws is a very efficient way to make it possible to monetize resources which were previously in the common. \n\nThey will never get tired of and will never stop banging on this door, not unlike a countless, tireless, bloodthirsty horde of undead. This is not their fault, it is their nature. \n\nBeing frustrated about this is exhausting, let’s focus on what we can do. \n\nWhat we can do is find ways to unite (get personal, organize, befriend people who have been radicalized), put efforts into applying impossible to ignore political pressure on this issue, and commit to the long game of election reform defanging corporations. \n\n"}, {"comment_id": "dq6ngdi", "post_id": "7eo0kj", "comment": "I wanna play devils advocate here. \n\nSo you did your due diligence and understand fully the situation(even the corporation and republicans side?) and not just listen to others?\n\nWhat if this turns out to be a good thing? Because I swear if it does. I’m going to write a ranting post, because it would be the perfect example of blind leading the blind. An example of the stupidity of the human race.\n\n/end devils advocate\n\nWe are going off “what if’s” and while they are real situations that could happen. We don’t know for sure. So let’s not “fix” want isn’t broken. "}, {"comment_id": "dq6pzaa", "post_id": "7eo0kj", "comment": "Yes, we need to keep up our fight on behalf of Netflix, Facebook, and Google against Comcast and Verizon, they'll show those corporations."}, {"comment_id": "dq6chlm", "post_id": "7eo0kj", "comment": "I’m glad to see this here, since the removal of net neutrality would be particularly bad for small businesses. Larger businesses would be able to afford to pay for faster internet speeds while smaller businesses may not be able to afford that. And people are more likely to use websites that run faster, so more likely to do business with them through their website. That’s bad news for not just photographers, but every small business in the US. "}, {"comment_id": "dq6cvhp", "post_id": "7eo0kj", "comment": "Or potentially being locked out of entire web sites due to a pay wall with your ISP.\n\nIt's bad news for information."}, {"comment_id": "dq7qu1m", "post_id": "7eo0kj", "comment": "We have two small businesses that depend on the internet. My guess is that ISPs will determine what services are used for businesses and force you to buy a 'business plan'. Best case scenario I figure sites like my photo hosts will be in the slow lane.\n"}, {"comment_id": "dq6ezck", "post_id": "7eo0kj", "comment": "So I'm posting this late but hopefully enough people will see this. \n\nIf you're driving tomorrow/this weekend for the holiday PLEASE consider getting some glass markers and writing on your car Save Net Neutrality (or something like that) and the website to get representative contact info or representative phone number or how to text to get info (text resist to 504-09). A lot of people will be on the road and it is a great way to reach several people in a short time. \n\nMahalo! You can make a difference! "}, {"comment_id": "dq6t42j", "post_id": "7eo0kj", "comment": "File a complaint here- in the proceeding(s) line type- 17-108 Https://www.fcc.gov/ecfs/filings/express Under brief comments say you're filling a formal complaint against Ajit Pais plan to repeal net neutrality rules"}, {"comment_id": "dq6krw6", "post_id": "7eo0kj", "comment": "I texted...but never got a reply text. :/"}, {"comment_id": "dq7j9te", "post_id": "7eo0kj", "comment": "Awesome idea! I'll be doing this for sure."}, {"comment_id": "dq6e4ra", "post_id": "7eo0kj", "comment": "People doing video even more so and with a lot of photographers such as wedding photographers needing to shoot video now, this will affect us. \n\nAlso the internet is still a US heavy thing. I live in Australia but laws passed in the US often have more impact than local laws and of course most of the sites we use for our photography like Instagram and Facebook and YouTube are from the US. "}, {"comment_id": "dq6ehj5", "post_id": "7eo0kj", "comment": "NN repealing laws in the US work as a precedent for ISPs in other countries to push for similar changes once they see how much money Verizon etc. are making with this. I believe there's almost nothing you can do for the US, outside the US. I tried donating to Bernie Sanders last year but they explicitly said they couldn't take foreign donations due to legal problems. Not sure if this applies now, but I personally wouldn't risk it. "}, {"comment_id": "dq7we44", "post_id": "7eo0kj", "comment": "NN does not exist in Australia, it's the ACCC that keeps things in check while allowing providers to compete. Luckily Australia has pretty decent consumer protections. Try pulling that Portugal shit in Australia... \n\nFor example: with Optus getting the rights to the EPL, you can get free EPL streaming bundled with your Optus plan, and traffic to these services is free with an optus plan. It is still available to other services for a fee, but if they're throttling other providers, you can bet ACCC will come down hard on them.\n\nI'm not saying I'm not for NN, but Australia has at least determined so far that even without NN, internet services can be regulated with effective consumer protection agencies. Important to note that Australia's telecoms market is relatively competitive. \n\nSubsequently I conclude that NN is essential in the US because they lack consumer protection, and protection against monopolies/corporate collusion."}, {"comment_id": "dq71q2e", "post_id": "7eo0kj", "comment": "Scotsman here, not much I can do regarding internal American stuff but if you guys fart we generally follow through messily later so I hope net neutrality wins the day for all us internet denizen types the world over!\n\nbeat the ten pails of shite out of these FCC hooligans!"}, {"comment_id": "dq7hdpw", "post_id": "7eo0kj", "comment": "I'm sure the EU will introduce some laws to protect us from this"}, {"comment_id": "dq74nxv", "post_id": "7eo0kj", "comment": "Hi everyone, \n\nHere is some quick info:\n#What is net neutrality?\n[What is net neutrality? (3 min video with visual descriptions)](https://www.youtube.com/watch?v=UsyzP5hejxI&t=2s)\n#Sample of our future\nHere's an [example](https://imgur.com/a/XPdfK) of what your internet options ~~could~~ **will** look like in the future if net neutrality dies.\n\n#What you can do:\n\n* Call your reps. Takes less than 30 seconds, and this site provides you with a prompt, and makes the call for you and everything!\n\n* Sign up on John Oliver's [GoFCCYourself](https://www.fcc.gov/ecfs/search/proceedings?q=name:\\(\\(17-108\\)\\)). You just need to click on the `+express` button on the right, and file your complaint. \n\n**The death of net neutrality is something NO ONE asked for, and is essentially the death of internet freedom. This act will only fillthe pockets of those with already deep pockets, and be nothing but a burden on the rest of us.** "}, {"comment_id": "dq6dbl6", "post_id": "7eo0kj", "comment": "Do you get a lot of business through social media? Oh, that sucks. Looks like you'll be paying for that and most likely losing a large portion of your audience either way. But, at least the executives at the ISPs can finally afford that third house in Aspen. Thanks, Trump."}, {"comment_id": "dq6eemt", "post_id": "7eo0kj", "comment": "Quick question, but haven't the previous Net Neutrality onslaughts happen during the Obama administration?\n\n"}, {"comment_id": "dq6xw8r", "post_id": "7eo0kj", "comment": "Pretty sure the new IG and FB algorithms have already caused that despite NN :/"}, {"comment_id": "dq6ru5t", "post_id": "7eo0kj", "comment": "Jesus fucking Christ America! What the hell's going on down there? What ever happened to 'The Land of the Free'\n\nYou guys need to put a stop to all this bullshit once and for all -NOW!\n\nI know 'socialism' can be a dirty word down there, but this is going to affect schools, and other learning institutions; certain areas of your care facilities; the poor; and others of lower income.\n\nHave a heart. Do this for them. \n\nWe're pulling for you.\n\nSigned, your Canadian cousins."}, {"comment_id": "dq6w91s", "post_id": "7eo0kj", "comment": "Net Neutrality isn't even socialism. Its a very simple concept of treating all data equally. I would prefer if we went further and regulated it like a utility but that isn't even what was on the table."}, {"comment_id": "dq6gwt3", "post_id": "7eo0kj", "comment": "So if you haven't already, there's a bot you can text, that helps you write an email or a fax, free of charge, to your senator, or governor. Text \"resist\" to \"504-09\" and it'll ask you some questions, then you're onto writing. From another thread a few weeks ago, someone posted this message, and it think it's a great one to send.\n\n\"Net Neutrality is the cornerstone of innovation, free speech and democracy on the Internet.\n\nControl over the Internet should remain in the hands of the people who use it every day. The ability to share information without impediment is critical to the progression of technology, science, small business, and culture.\n\nPlease stand with the public by protecting Net Neutrality once and for all.\"\n\nI'd love to credit the user, but have lost the comment, but please, go send some faxes, show your politicians you want net neutrality to stay."}, {"comment_id": "dq76l41", "post_id": "7eo0kj", "comment": "From Ajit Pai's (210 pages long) plan:\n\n\"...That ended  two years ago.    In 2015, the Commission imposed heavy-handed, utility-style regulation on Internet service providers (ISPs).  Since then, broadband investment has fallen for two years in a row—the first time that that’s happened outside a \nrecession in the Internet era. And new services have been delayed or scuttled by a regulatory environment that stifles innovation.\"\n\nIs this true or is this not true? \n\nFrom someone looking at this from another country it sure seems to me that this is monopolists/oligopolists fighting other monopolists/oligopolists.  \n\nHere is the plan if anyone wants to read it https://apps.fcc.gov/edocs_public/attachmatch/DOC-347927A1.pdf"}, {"comment_id": "dq77caa", "post_id": "7eo0kj", "comment": "I have not seen any evidence to say the lack of investment was due to Net Neutrality. This is the argument from ISPs however. \n\nMaybe the ISPs should have used the money they were granted from the US Government to do that exact thing; build infrastructure. There is a good primer on that [here](https://www.reddit.com/r/explainlikeimfive/comments/6c5e97/eli5_how_were_isps_able_to_pocket_the_200_billion/).\n\nThis entire issue has been heavily muddied. You will hear arguments against NN on the basis that its government regulation and government is bad. The issue with that, is that NN was not what you normally think of as Regulation. It stated that all ISPs must treat all traffic equally and that you cannot censor any of the data (other than criminal activity, of course). So saying regulation was bad is a bit of a misdirection.\n\nYou will also see people argue against NN by stating that the internet was fine for decades without it. This is mostly true, but generally due out of lack of ability. For a long time an ISP didn't have the resources or tech to put in place a system that throttled, blocked, fast-lane'd, or pay walled sections of the internet. At least not effectively.\n\nThen it started to happen and there needed to be a discussion on how to deal with the internet. "}, {"comment_id": "dq70fas", "post_id": "7eo0kj", "comment": "[Here](https://apps.fcc.gov/edocs_public/attachmatch/FCC-17-60A1.pdf) is a link to the initial decision by the FCC. The relevant info starts on page 25 of the pdf.\n\nPersonally, I'd be fine with the upholding of the \"Bright Line Rules\" (pg 27) while also re-categorizing internet providers as Title I \"information services\". I do think it is important to prevent ISPs from restricting access to third party applications through paid prioritization or outright blocking, but I'm not entirely sure that the FCC's rollback of the Title II Order won't already cover these bases, as there is already legal and regulatory precedent against these practices, including the FCC's 2010 Open Internet Order (pg 7). I won't be surprised if the repeal goes through, but I'm not at all sure that it will be as devastating to our internet usage as we all believe it will be."}, {"comment_id": "dq759en", "post_id": "7eo0kj", "comment": "Here's what you can do to help:\n\nText resist to 50409. It will take all of 5 minutes. If you are stuck for something to say try this:\n\n\"Net Neutrality is the cornerstone of innovation, free speech and democracy on the Internet.\n\nControl over the Internet should remain in the hands of the people who use it every day. The ability to share information without impediment is critical to the progression of technology, science, small business, and culture.\n\nPlease stand with the public by protecting Net Neutrality once and for all.\"\n\nWant to contact the FCC and comment on Net Neutrality?\n\nGo to www.gofccyourself.com ——> click Express (it's over there on the right)\n\nFill out the form to comment on Net Neutrality. An example might read:\n\n\"Chairman Pai, Commissioner Clyburn, Commissioner O'Rielly, Commissioner Carr, and Commissioner Rosenworcel,\n\nI support strong net neutrality, backed by title II oversight of ISP’s. Please preserve net neutrality and Title II!\n\nThank you.\"\n\nPlease do it. We need all the help we can get."}, {"comment_id": "dq6j80c", "post_id": "7eo0kj", "comment": "[Here is a White House petition to save net neutrality](https://petitions.whitehouse.gov/petition/do-not-repeal-net-neutrality)"}, {"comment_id": "dq6ol6c", "post_id": "7eo0kj", "comment": "[deleted]"}, {"comment_id": "dq71ngc", "post_id": "7eo0kj", "comment": "CenturyLink recently purchased Level 3, which was one of the larger \"backbone\" companies."}, {"comment_id": "dq76m94", "post_id": "7eo0kj", "comment": "Doesn't matter who owns the infrastructure, if the data is going to a European consumer they can't throttle it. "}, {"comment_id": "dq6f9qe", "post_id": "7eo0kj", "comment": "Glad I live in Germany."}, {"comment_id": "dq6fe7g", "post_id": "7eo0kj", "comment": "Large policy changes like this in the US affect the world. Either directly, by changing how sites operate, or indirectly through influence towards your own national policies. Often times these policies spread. Money is universal."}, {"comment_id": "dq6h9uq", "post_id": "7eo0kj", "comment": "I fucking hate the US. Fuck patriotism, fuck republicans, fuck corporations, fuck everything about this awful goddamn country. I’m going to fucking move to Europe as soon as I get the chance. "}, {"comment_id": "dq6psyk", "post_id": "7eo0kj", "comment": "**https://www.usa.gov/elected-officials**"}, {"comment_id": "dq75706", "post_id": "7eo0kj", "comment": "THANK YOU FOR THIS!!! ON POINT!!! "}, {"comment_id": "dq83kiz", "post_id": "7eo0kj", "comment": "What if: speeds stay the same, but websites have an option to pay for faster than \"normal\" access speeds? ISP's have already been doing it forever..."}, {"comment_id": "dq8szyp", "post_id": "7eo0kj", "comment": "Move to Canada. We have strong net neutrality laws. "}, {"comment_id": "dq7oxoj", "post_id": "7eo0kj", "comment": "The Internet was completely unregulated when it was created, and it was unregulated when it exploded into what it is today. "}, {"comment_id": "dq7p7r6", "post_id": "7eo0kj", "comment": "Net Neutrality as we have it right now was put in place to maintain that."}, {"comment_id": "dq6oywr", "post_id": "7eo0kj", "comment": "No it is not. Quit giving the government more power  that can’t be taken back."}, {"comment_id": "dq6vo8r", "post_id": "7eo0kj", "comment": "You must not understand this issue."}, {"comment_id": "dq6jk0t", "post_id": "7eo0kj", "comment": "Lots of anti-capitalist liberals here.  You guys vote for Bernie? "}, {"comment_id": "dq6jx0e", "post_id": "7eo0kj", "comment": "Anti monopoly isn't anti capitalist. Quite the opposite.\n\nDo you like monopolies exploiting their powers? "}, {"comment_id": "dq6l8x6", "post_id": "7eo0kj", "comment": "Bernie isn't anticapitalist and anticapitalist liberal is a non sequitur."}, {"comment_id": "ead01vo", "post_id": "9zy9e9", "comment": "An interactive version can be found here: http://photography-mapped.com/interact.html"}, {"comment_id": "eadkkni", "post_id": "9zy9e9", "comment": "I like this one\n\nhttp://www.canonoutsideofauto.ca/play/"}, {"comment_id": "ead0ubf", "post_id": "9zy9e9", "comment": "Hey, thank you for sharing this :)"}, {"comment_id": "ead659w", "post_id": "9zy9e9", "comment": "Awesome, just starting out with product photography to make product pictures for my company and needed to learn what Aperture, ISO and so on is. Thanks!"}, {"comment_id": "eafya2a", "post_id": "9zy9e9", "comment": "[This is also a great place to learn the basics and it’s free!](https://expertphotography.com/a-beginners-guide-to-photography/)"}, {"comment_id": "ead6ble", "post_id": "9zy9e9", "comment": "That is awesome! Thank you!"}, {"comment_id": "eadk2ve", "post_id": "9zy9e9", "comment": "I've been looking for an Android app like this for a long time. Still haven't found one. "}, {"comment_id": "eajhafg", "post_id": "9zy9e9", "comment": "Thanks for this I have lots of fun trying out different settings"}, {"comment_id": "eacw3yf", "post_id": "9zy9e9", "comment": "This is perfect, thx op"}, {"comment_id": "eacxnr0", "post_id": "9zy9e9", "comment": "Why is the fan running backwards?"}, {"comment_id": "eacy6kp", "post_id": "9zy9e9", "comment": "A dumb excuse: Its a table top Exhaust fan..."}, {"comment_id": "eacwabd", "post_id": "9zy9e9", "comment": "Really good way of showing this and teaching people. Starting out the exposure triangle was one of the hardest things for me to fully understand, but once it clicked, it all made sense"}, {"comment_id": "ead7bnd", "post_id": "9zy9e9", "comment": "Once it clicked 🙄👍"}, {"comment_id": "eacwhpe", "post_id": "9zy9e9", "comment": "Yeah... The aperture value was really confusing at first... "}, {"comment_id": "ead0a7t", "post_id": "9zy9e9", "comment": "This made me realize I’ve been thinking of aperture wrong.  I’ve been saying “bigger is blurrier” as a way to remember how to use it.  The opening is bigger but the number is smaller.  I’ll have to keep that in mind moving forward."}, {"comment_id": "ead1za4", "post_id": "9zy9e9", "comment": "Think of it as fractions. 1/2.8 is bigger than 1/16. "}, {"comment_id": "eaegsst", "post_id": "9zy9e9", "comment": "So now I’m seeing the lower the number the more shallow the depth of field."}, {"comment_id": "eacwf0p", "post_id": "9zy9e9", "comment": "Unfortunately, I don’t think this really explains how these three things interact together on it’s own. It’s clever, but it needs a lot of explanation for its target audience. "}, {"comment_id": "eacxl8k", "post_id": "9zy9e9", "comment": "Yeah real rookies may not understand it by simply watching this... A basic knowledge/ a explanation will really help...."}, {"comment_id": "eacwr0k", "post_id": "9zy9e9", "comment": "What didn’t it show?"}, {"comment_id": "eaf9x0k", "post_id": "9zy9e9", "comment": "Its pretty weird - an instructional gif that only makes sense to people who already understand the mechanics."}, {"comment_id": "eaddo0d", "post_id": "9zy9e9", "comment": "I know what these things are but I'm not completely aware how they work, so this was perfect for me."}, {"comment_id": "eadgauw", "post_id": "9zy9e9", "comment": "The difference in brightness needs to be a lot more extreme"}, {"comment_id": "eacyk7n", "post_id": "9zy9e9", "comment": "This is so awesome! I wish this was around back when I was starting. It would have been a huge help. Great job! "}, {"comment_id": "eacyxa8", "post_id": "9zy9e9", "comment": "Thank you :)"}, {"comment_id": "ead2vrt", "post_id": "9zy9e9", "comment": "I remember seeing this represented with the same objects (a fan and a cactus) in the digital encyclopedia Encarta 2000. How time has passed. "}, {"comment_id": "ead0ptk", "post_id": "9zy9e9", "comment": "This is incredibly helpful!"}, {"comment_id": "ead52tp", "post_id": "9zy9e9", "comment": "This is great. Perfect for new photographers nowadays who haven’t learned to truly take the triangle into consideration!!! <3"}, {"comment_id": "eae2y1c", "post_id": "9zy9e9", "comment": "Oh my god now I get it."}, {"comment_id": "eae3myq", "post_id": "9zy9e9", "comment": "It’s very hard for people to understand at first for sure "}, {"comment_id": "eae6ccl", "post_id": "9zy9e9", "comment": "This helps so much"}, {"comment_id": "eae8d9i", "post_id": "9zy9e9", "comment": "Photog n00b here. I appreciate you. "}, {"comment_id": "eadgc3k", "post_id": "9zy9e9", "comment": "This is really helpful!!!"}, {"comment_id": "eadhg94", "post_id": "9zy9e9", "comment": "This is awesome! "}, {"comment_id": "eadht6d", "post_id": "9zy9e9", "comment": "Thank you!"}, {"comment_id": "eadmev8", "post_id": "9zy9e9", "comment": "This is the best way to make someone understand the Exposure triangle."}, {"comment_id": "eadnugs", "post_id": "9zy9e9", "comment": "Saving this for later."}, {"comment_id": "eadpxlf", "post_id": "9zy9e9", "comment": "https://camerasim.com/camerasim-free-web-app/"}, {"comment_id": "eadyqqr", "post_id": "9zy9e9", "comment": "Thanks for this!"}, {"comment_id": "eae1b0g", "post_id": "9zy9e9", "comment": "I'd really like to see a version of this that also compares a rolling shutter vs a global shutter in a cinema camera"}, {"comment_id": "eaeqxu3", "post_id": "9zy9e9", "comment": "I will make it happen... :)"}, {"comment_id": "eae7kny", "post_id": "9zy9e9", "comment": "This is gold."}, {"comment_id": "eaer6hh", "post_id": "9zy9e9", "comment": "This is some essential knowledge of the craft; a creative presentation of this information indeed."}, {"comment_id": "eaevi1g", "post_id": "9zy9e9", "comment": "Thank you!"}, {"comment_id": "eaf16ig", "post_id": "9zy9e9", "comment": "Once upon a time..."}, {"comment_id": "eaf2dr8", "post_id": "9zy9e9", "comment": "Very easy to understand Shutter, Aperture and ISO. Very useful."}, {"comment_id": "eaf2tap", "post_id": "9zy9e9", "comment": "This is great 👌🏼"}, {"comment_id": "eaf61nt", "post_id": "9zy9e9", "comment": "there is also an interactive version of this in the canon companion app, along some very nice explanations that helped me to get into photography "}, {"comment_id": "eamgg1e", "post_id": "9zy9e9", "comment": "Mods Should pin this "}, {"comment_id": "ead65jx", "post_id": "9zy9e9", "comment": "I'm wanting to get in to photography. The technical terms are really intimidating so this is great thank you ! "}, {"comment_id": "eadxgom", "post_id": "9zy9e9", "comment": "It's really simple (the technical aspects) once you get past the fear of not understanding anything. "}, {"comment_id": "eae8flz", "post_id": "9zy9e9", "comment": "Same. Check out phlearn. I’ve learned so much from their videos. "}, {"comment_id": "ead89e1", "post_id": "9zy9e9", "comment": "Oh this is cool!"}, {"comment_id": "eallrbc", "post_id": "9zy9e9", "comment": "Neat! :-D"}, {"comment_id": "ekb0q3w", "post_id": "9zy9e9", "comment": "the best bits is is when osolating mechanism moves in and out of frame"}, {"comment_id": "eadfvq8", "post_id": "9zy9e9", "comment": "r/oddlysatisfying "}, {"comment_id": "ead2427", "post_id": "9zy9e9", "comment": "[deleted]"}, {"comment_id": "ead39gw", "post_id": "9zy9e9", "comment": "Depends on the time of the year"}, {"comment_id": "eaf0mks", "post_id": "9zy9e9", "comment": "A beginners guild to Photography in what, 20 seconds?"}, {"comment_id": "eagwf9w", "post_id": "9zy9e9", "comment": "I need that software. Now."}, {"comment_id": "ead3fit", "post_id": "9zy9e9", "comment": "jeez *another* one of these?"}, {"comment_id": "eae36o2", "post_id": "9zy9e9", "comment": "It seems so."}, {"comment_id": "eelmse0", "post_id": "ai6psf", "comment": "Impressive, especially considering it looks like he's just lucking it with the timing. Not even a remote shutter in sight.\n\nIt's also encouraging to see what can be captured with an entry-level DSLR, kit lens and a bunch of creativity. "}, {"comment_id": "eeln53d", "post_id": "ai6psf", "comment": ">it looks like he’s just lucking it with the timing\n\nI’m assuming he might’ve had some timing attempts off-camera, impressive nonetheless! Or burst shots maybe. "}, {"comment_id": "eem66mh", "post_id": "ai6psf", "comment": "To be fair, that's the only kind of gear I'd actually feel comfortable using 6 inches from a bunch of firecrackers. My 5D MkIV, no fucking way (although maybe, with 100mm macro and a big piece of plexi with a hole for the lens :P) "}, {"comment_id": "eelpnot", "post_id": "ai6psf", "comment": "Serial picture Mode mang"}, {"comment_id": "eenoxig", "post_id": "ai6psf", "comment": "Modern mirrorless cameras can capture continuous 60fps stills in 4k resolution. You just set the exposure, hold down the shutter release, and find the perfectly-times shots in post."}, {"comment_id": "eelk5u8", "post_id": "ai6psf", "comment": "3/3 would invest in a BBQ lighter"}, {"comment_id": "eelmk3r", "post_id": "ai6psf", "comment": "Nice stuff!\n\nI did [something similar](https://www.instagram.com/p/BioqcP5h1sq/?utm_source=ig_share_sheet&igshid=1lwncpydc7cu7) a few months back for a uni project, unfortunately pyrotechnics aren't as easy to get down under so did my best with isopropyl and a water spray bottle."}, {"comment_id": "eelosbx", "post_id": "ai6psf", "comment": "For this scale you could get a lot done with the insides of party poppers, sparkler dust, etc."}, {"comment_id": "eelugol", "post_id": "ai6psf", "comment": "Love seeing locals on Reddit"}, {"comment_id": "eelznmr", "post_id": "ai6psf", "comment": "I was just thinking how i dont think i could get away with this here. \nCasually lighting fires in my part of Aus aint a great idea.\n\nReally like your shot though. I have some old 40k stuff i should shoot with...."}, {"comment_id": "eelok1r", "post_id": "ai6psf", "comment": "Clearly these suck. Kit Lens. No IBIS. Not using a Gitzo. His camera only has one card slot. What a fucking amateur.  /s\n\nIn all serious it just goes to show that creativity and putting something interesting in front of the lens is by far the most important element of great photos."}, {"comment_id": "eelp1pr", "post_id": "ai6psf", "comment": "[deleted]"}, {"comment_id": "eelr94a", "post_id": "ai6psf", "comment": "[deleted]"}, {"comment_id": "eeloexn", "post_id": "ai6psf", "comment": "Look up @sgtbananas on Instagram. He and a few others had their pictures on display at SDCC last year. If you want I can give you the other names."}, {"comment_id": "eem70wq", "post_id": "ai6psf", "comment": "I have no interest in action figures or small scale stuff but have been following him on Instagram for a long time. He does really cool photos. Can't remember where I heard about him, but it may have been from a Tested video. "}, {"comment_id": "eelt93p", "post_id": "ai6psf", "comment": "Ahem... *action figures*"}, {"comment_id": "eeltpeu", "post_id": "ai6psf", "comment": "🤨"}, {"comment_id": "eelpvfn", "post_id": "ai6psf", "comment": "It’s just basic stuff. You don’t need a lot to create cool results. Sometimes Simple is best. "}, {"comment_id": "eem9o68", "post_id": "ai6psf", "comment": "Reminds me of [Worn Out Trooper](https://instagram.com/worn_out_trooper), one of my favorite photography IG accounts (that, sadly, just retired)."}, {"comment_id": "eemmfqq", "post_id": "ai6psf", "comment": "This also kills the toys. I am positive at least one of the shocktroopers didn't make it back home in one piece. "}, {"comment_id": "eemq77c", "post_id": "ai6psf", "comment": "Needs to stop down too add more realism.  The shallow DOF makes them look small"}, {"comment_id": "eelmvd1", "post_id": "ai6psf", "comment": "Ugh, this makes me want to relive my childhood. "}, {"comment_id": "een2h67", "post_id": "ai6psf", "comment": "Have experimented with lighting using toys but never thought to do this stuff...some great shots."}, {"comment_id": "eelnvr4", "post_id": "ai6psf", "comment": "I’ve always wanted to do this! But I’ve always been too lazy... and too bad at photography..."}, {"comment_id": "eem5c47", "post_id": "ai6psf", "comment": "Impressive, I don't think I can do this with my figures."}, {"comment_id": "eelno95", "post_id": "ai6psf", "comment": "Is that 55-250?"}, {"comment_id": "eelqh31", "post_id": "ai6psf", "comment": "so cool"}, {"comment_id": "eeltlws", "post_id": "ai6psf", "comment": "Who is he"}, {"comment_id": "eeo0f5f", "post_id": "ai6psf", "comment": "He's the kid from toy story who destroys toys "}, {"comment_id": "eeltolt", "post_id": "ai6psf", "comment": "Idk 😐 "}, {"comment_id": "eem5luo", "post_id": "ai6psf", "comment": "Woow, I'm blown away. "}, {"comment_id": "eem6mai", "post_id": "ai6psf", "comment": "This is really cool"}, {"comment_id": "eem7mdm", "post_id": "ai6psf", "comment": "Very clever and unique! Love it, where can I find more?"}, {"comment_id": "eem9vl7", "post_id": "ai6psf", "comment": "very creative"}, {"comment_id": "eemkmnb", "post_id": "ai6psf", "comment": "Those poor toys! 😜"}, {"comment_id": "eemko0y", "post_id": "ai6psf", "comment": "So cool "}, {"comment_id": "eemlyp3", "post_id": "ai6psf", "comment": "I think i could give him a run for his money with my clay soldiers filled with ketchup circa 1989"}, {"comment_id": "eemqosv", "post_id": "ai6psf", "comment": "Really good work. Just waiting for Disney to sue him."}, {"comment_id": "eemt45z", "post_id": "ai6psf", "comment": "Cool"}, {"comment_id": "eemtwe4", "post_id": "ai6psf", "comment": "Great! I'm Inspired! I shall now go look for more things to add to my $10k kit to improve the theoretical quality I could produce if i took photos... hmm maybe a new backpack!"}, {"comment_id": "eemw4vn", "post_id": "ai6psf", "comment": "So cool!"}, {"comment_id": "eemz0v3", "post_id": "ai6psf", "comment": "Looks mega.\n\n  \n\n\nWhat do you think makes those ~~toys~~ action figures look pretty reall? Angle, focal length, post-processing? The environment? I'm sure a combination of them all but I reckon if I attempted this, they would just look like toys on a bit of lawn\n\nEdit: a word"}, {"comment_id": "een07a4", "post_id": "ai6psf", "comment": "Good idea!"}, {"comment_id": "een5izr", "post_id": "ai6psf", "comment": "Do you keep water or a fire extinguisher with you? I'd love to do something like this, but in California our fire risk is waaaaayyyy too high!"}, {"comment_id": "eenczzb", "post_id": "ai6psf", "comment": "He's on this sub or /r/SonyAlpha, I can't remember which. Seen his work before"}, {"comment_id": "eenme5n", "post_id": "ai6psf", "comment": "Song is \"Ala persona\" by Senpai Run if anyone is wondering \n"}, {"comment_id": "eennmhp", "post_id": "ai6psf", "comment": "Now this is a cool hobby "}, {"comment_id": "eenvfqa", "post_id": "ai6psf", "comment": "Anybody know the name of this song?"}, {"comment_id": "eeo0b6v", "post_id": "ai6psf", "comment": "He reminds of that kid in toy story who destroys toys"}, {"comment_id": "eeo6mvt", "post_id": "ai6psf", "comment": "\"I don't believe that man's ever been to medical school.\""}, {"comment_id": "eeo4kt8", "post_id": "ai6psf", "comment": "Used to do that as a kid, only did not have a dslr to shoot it with. This guy is living the dream."}, {"comment_id": "eetelst", "post_id": "ai6psf", "comment": "I am so inspired. I want to blow shit up with my camera. Now if it was above 30 and would stop raining. Or just stop raining. And tax season to be over. Ok my career is getting in the way of my hobby"}, {"comment_id": "ef81rpk", "post_id": "ai6psf", "comment": "Does anyone know what that blue thing  is that's being used? I cant figure it out. "}, {"comment_id": "eelyj4u", "post_id": "ai6psf", "comment": "He should learn to tether. That way he’s not face full of danger."}, {"comment_id": "eelzm2i", "post_id": "ai6psf", "comment": "Also some safety goggles can work wonders when your head down into fireworks"}, {"comment_id": "eelnfxd", "post_id": "ai6psf", "comment": "Ok this is epic (really)"}, {"comment_id": "eelkn1n", "post_id": "ai6psf", "comment": "Pretty neat. "}, {"comment_id": "eelmeyb", "post_id": "ai6psf", "comment": "really awesome "}, {"comment_id": "eely7zx", "post_id": "ai6psf", "comment": "r/ACBA"}, {"comment_id": "eem0j2r", "post_id": "ai6psf", "comment": "As an amateur photographer I think this would be so fun "}, {"comment_id": "eem7xxp", "post_id": "ai6psf", "comment": "So do it! "}, {"comment_id": "eelp34z", "post_id": "ai6psf", "comment": "This is pretty cool, however, these are NOT explosives. They are fireworks, simple sparklers and smoke balls.\n\nNot sure why that bugs me, but it does."}, {"comment_id": "eelx3dp", "post_id": "ai6psf", "comment": "I'm not sure what you think an explosive is... Personally I feel anything smaller than a fat boy atom bomb isn't an explosive, but I know some are willing to accept something as weak as a little boy. \n\nSo yeah, next time this guy should get some radiation shielding and IBIS and use some **real** explosives. "}, {"comment_id": "eenh6el", "post_id": "ai6psf", "comment": "They are explosives"}, {"comment_id": "een3t79", "post_id": "ai6psf", "comment": "Yeah. It’s technically not an explosion, it’s deflagration. And even at that, small deflagrations. "}, {"comment_id": "eelzgiu", "post_id": "ai6psf", "comment": "Because the article is being dishonest. Explosives convey a totally different feeling than fireworks."}, {"comment_id": "eelygdf", "post_id": "ai6psf", "comment": "Everyone is an artist nowadays "}, {"comment_id": "een6mal", "post_id": "ai6psf", "comment": "Same can be said for critics."}, {"comment_id": "eem4owr", "post_id": "ai6psf", "comment": "I now want to 3D print an action figure of myself and do this."}, {"comment_id": "eelu93l", "post_id": "ai6psf", "comment": "Great deal"}, {"comment_id": "eaueb6j", "post_id": "a21drm", "comment": "I thought you were going to battle her lol"}, {"comment_id": "eauehqt", "post_id": "a21drm", "comment": "Same. I am disappointed by the lack of laser noise. "}, {"comment_id": "eavwlqc", "post_id": "a21drm", "comment": "I’m actually disappointed in the lack of sword play. "}, {"comment_id": "ebi54j3", "post_id": "a21drm", "comment": "yo same!!! it totally looked like it was gonna turn into a duel "}, {"comment_id": "eaud756", "post_id": "a21drm", "comment": "The lightsaber(!) is an acrylic tube with a high powered torch.  \nI used two cameras to make this, both mounted on the same tripod.  \nVideo: Panasonic GH5s with SLR Magic 12mm CINE t-1.6  \nStill: Panasonic GH5 with Leica Summilux 12mm 1.4  \nThe still camera is operated by wireless remote in Bulb mode (transmitter's my right hand) while I wave the light stick around with my left hand - takes a bit of coordination to get right, and needs a very still model  "}, {"comment_id": "eaudocj", "post_id": "a21drm", "comment": "I love the video.  Really demonstrates the technique and gives a cool effect before transitioning to the still.  Hardly needed the description of how thou did it because of that. \n\nThe picture is great,  I love the warm tone and the reflections. "}, {"comment_id": "eaue3d0", "post_id": "a21drm", "comment": "Is the color from a gel on the tube? And what torch did you go with?"}, {"comment_id": "eauz2st", "post_id": "a21drm", "comment": "Eric Pare, is that you? 😂"}, {"comment_id": "eauk3fo", "post_id": "a21drm", "comment": "What wireless transmitter are you using? "}, {"comment_id": "eauhd8m", "post_id": "a21drm", "comment": "Is that an Astera tube?"}, {"comment_id": "eaurv13", "post_id": "a21drm", "comment": "thanks. i was wondering. "}, {"comment_id": "eauh1jm", "post_id": "a21drm", "comment": "It's awesome. Please post the still if you haven't already. "}, {"comment_id": "eauf2dw", "post_id": "a21drm", "comment": "Very nice. I'm sure you're familiar with the work of [Eric Paré](http://www.instagram.com/ericparephoto)."}, {"comment_id": "eauf38q", "post_id": "a21drm", "comment": "Yes he got me started on lightpainting!"}, {"comment_id": "eazcmmi", "post_id": "a21drm", "comment": "Holy shit, that guy is a insane artist.    "}, {"comment_id": "eaue4hr", "post_id": "a21drm", "comment": "Wow, amazing video, fantastic shot! First going into it I had my doubts as to what I'm watching here (I expected the photographer to just instruct the model and take shots) but this was a wonderful behind the scenes insight with a great edit of the photo being taken. Do gives us more when you find the time! Kudos!"}, {"comment_id": "eaufrdz", "post_id": "a21drm", "comment": "Auckland ? "}, {"comment_id": "eaufs2c", "post_id": "a21drm", "comment": "Yes! Ladies Bay"}, {"comment_id": "eaugb92", "post_id": "a21drm", "comment": "r/lightpainting would love this. "}, {"comment_id": "eauw7a9", "post_id": "a21drm", "comment": "I've done a similar thing using a wooden dowel, paracord, a whisk, and steel wool. Getting the settings right for that is particularly tricky, since the steel wool doesn't burn bright enough to illuminate the front of the subject with ambient light, but that problem is partially mitigated with shooting in the snow.\n\nThe person behind the subject spinning the dowel needs a strong and steady arm, though. To get it to burn bright enough, you have to get it to about 6 or 7 rotations per second. You're going to be covered in burning shrapnel, so both the technician and subject need to either be cool with the tops of their heads getting singed, or they need to be covered with something, ideally fire resistant.\n\nThe end result, if done right, will look an awful lot like the Dr. Strange portals.\n\nI wish I had pictures of this, but I was working with someone else to pull this off, and it was all shot on their camera. I was the only one who could pull off the rotations, and we were still learning. So, I learned the bit about getting burned the hard way."}, {"comment_id": "eaujulq", "post_id": "a21drm", "comment": "Cool photo, if I was being fussy though it'd have been possible to line up the model's head and center of the twirl in the foreground puddle as well though."}, {"comment_id": "eawnk7s", "post_id": "a21drm", "comment": "Too on the nose, and that would put two faces in frame. The one in the puddle would draw attention away from the real one. I like how there is only one focal point, one place to draw the eye."}, {"comment_id": "eav7b4w", "post_id": "a21drm", "comment": "Am I the only one who's just a *little* disappointed that it didn't end with him passing the lightsaber \"through\" the model and having her empty dress collapse onto the rocks?"}, {"comment_id": "eavo5hp", "post_id": "a21drm", "comment": "If he'd struck her down, she'd only become more powerful than you can possibly imagine."}, {"comment_id": "eavure6", "post_id": "a21drm", "comment": "I thought I was watching Columbia Pictures' new intro and torch bearer. I was expecting the camera to zoom into the girl with the Columbia logo appearing underneath."}, {"comment_id": "eb0zevq", "post_id": "a21drm", "comment": "I have one of these and now I know what I need to do lol. This is awesome. "}, {"comment_id": "eaum8wh", "post_id": "a21drm", "comment": "Beautiful animation that shows how the photo was taken."}, {"comment_id": "eauoh8y", "post_id": "a21drm", "comment": "Is it possible to learn this power?"}, {"comment_id": "eaurcs8", "post_id": "a21drm", "comment": "It’s not a story the Jedi would tell you..."}, {"comment_id": "eauof8q", "post_id": "a21drm", "comment": "“That doesn’t look like a lightsaber... that looks stupid...” \n*takes photo*\n... :0"}, {"comment_id": "eaufvsl", "post_id": "a21drm", "comment": "Ha hey, that's awesome, and I place I know too! So cool. "}, {"comment_id": "eaug7mo", "post_id": "a21drm", "comment": "Awesome!!"}, {"comment_id": "eaughz7", "post_id": "a21drm", "comment": "This is super dope!"}, {"comment_id": "eaumsvr", "post_id": "a21drm", "comment": "Great!"}, {"comment_id": "eauph2a", "post_id": "a21drm", "comment": "She has the high ground."}, {"comment_id": "eauszjv", "post_id": "a21drm", "comment": "Nailed it, great shot & beautiful post work here... thanks for sharing!\n"}, {"comment_id": "eautzyq", "post_id": "a21drm", "comment": "Wowzers - that was super cool!"}, {"comment_id": "eauu3v3", "post_id": "a21drm", "comment": "Looks to be around Glendowie/St Heliers. Around the corner from where I grew up! I used to go to the spots up by Glover park, have a little smoke on a sunny afternoon and look over this area, seeing Rangitoto and all the other islands in the bay. Memories! "}, {"comment_id": "eavjr6x", "post_id": "a21drm", "comment": "Was Ladies Bay!"}, {"comment_id": "eauxst0", "post_id": "a21drm", "comment": "This might be a technique that you couldn't do it alone."}, {"comment_id": "eauynfh", "post_id": "a21drm", "comment": "I think just shooting a model on a New Zealand beach would be pretty amazing by itself."}, {"comment_id": "eauzarh", "post_id": "a21drm", "comment": "There are few sounds more satisfying to me than a camera shutter.\n\nI would love to see a post processing video that talks about how you brought out her features and coloring."}, {"comment_id": "eauzl2z", "post_id": "a21drm", "comment": "By torch do you mean what we call a flashlight? \nI am going to try this thank you, but was worried about using a gas fired high powered torch! "}, {"comment_id": "eav5qqo", "post_id": "a21drm", "comment": "Yes! I wouldn’t want to use fire this close to a model!"}, {"comment_id": "eav3hvd", "post_id": "a21drm", "comment": "I love this presentation of what you're doing. Really cool stuff!"}, {"comment_id": "eav4sws", "post_id": "a21drm", "comment": "Nice job! That's pretty cool!"}, {"comment_id": "eavb83z", "post_id": "a21drm", "comment": "I remember your other similar photo. Really cool stuff. "}, {"comment_id": "eavc7l0", "post_id": "a21drm", "comment": "your jedi training is complete."}, {"comment_id": "eave2r3", "post_id": "a21drm", "comment": "Amazing..."}, {"comment_id": "eaveq8x", "post_id": "a21drm", "comment": "That is sweet as pie."}, {"comment_id": "eavetu4", "post_id": "a21drm", "comment": "Awesome"}, {"comment_id": "eavex0p", "post_id": "a21drm", "comment": "We will watch your career with great interest"}, {"comment_id": "eavi308", "post_id": "a21drm", "comment": "Thanks guys! It's still early days as I transition from being a concert cellist to a full time photographer, but so far it's going well."}, {"comment_id": "eavjvow", "post_id": "a21drm", "comment": "What sort of acrylic tube did you use? Like something from a hardware store?"}, {"comment_id": "eavlg7v", "post_id": "a21drm", "comment": "Was that done up in Auckland?"}, {"comment_id": "eavlllh", "post_id": "a21drm", "comment": "Yes, that's Rangitoto in the background."}, {"comment_id": "eavtb55", "post_id": "a21drm", "comment": "One of the most beautiful photos I’ve ever seen."}, {"comment_id": "eavtvya", "post_id": "a21drm", "comment": "How do you mount two cameras on the same tripod?"}, {"comment_id": "eavuaj5", "post_id": "a21drm", "comment": "With something like this:\nhttps://www.amazon.co.uk/Opteka-Camera-Bracket-Tripod-Mount-x/dp/B0072JK21Y"}, {"comment_id": "eavui8g", "post_id": "a21drm", "comment": "This is awesome. What type of acrylic tube do you use"}, {"comment_id": "eavw1ds", "post_id": "a21drm", "comment": "I bought a legit lightsaber to fight with and it looks legit to. I had the same idea to use it for long exposure and I have to say it looks awesome. If your gonna do it red is the color to get"}, {"comment_id": "eavw64g", "post_id": "a21drm", "comment": "Your photos are very impressive you must be very proud. "}, {"comment_id": "eavwvp7", "post_id": "a21drm", "comment": "What was the shutter speed for the camera? Is there a good rule of thumb for light painting? I’ve only ever done steel wool so I’m not experienced with it. "}, {"comment_id": "eavyvg1", "post_id": "a21drm", "comment": "this is dopeeeee"}, {"comment_id": "eavz00i", "post_id": "a21drm", "comment": "My jaw dropped... Stunning work my friend, keep it up"}, {"comment_id": "eaw26gu", "post_id": "a21drm", "comment": "\"lightsaber\" and \"photography\" in the same sentence. Instant upvote"}, {"comment_id": "eawgem3", "post_id": "a21drm", "comment": "This looks like the place that faked lightning strike video was recorded with the guy screaming gibrish in an Aussie accent. "}, {"comment_id": "eawgj8j", "post_id": "a21drm", "comment": "Link?"}, {"comment_id": "eax07x1", "post_id": "a21drm", "comment": "Good job, but the next step has to be actually making yourself not visible in the photo :)"}, {"comment_id": "detrp2g", "post_id": "5yxrwc", "comment": "This is great! It's like good old 90s Internet. \n\nThanks for the link.  "}, {"comment_id": "detrydi", "post_id": "5yxrwc", "comment": "My pleasure :)"}, {"comment_id": "detwcyi", "post_id": "5yxrwc", "comment": "Will soak it up for sure.\nHere's his playlist on youtube\nhttp://www.youtube.com/playlist?list=PL7ddpXYvFXspUN0N-gObF1GXoCA-DA-7i"}, {"comment_id": "detwyvz", "post_id": "5yxrwc", "comment": "Thanks for sharing the playlist :)"}, {"comment_id": "deughcv", "post_id": "5yxrwc", "comment": "youtube-dl, here I come..."}, {"comment_id": "dfwrwai", "post_id": "5yxrwc", "comment": "Leaving a comment so I came back to this later "}, {"comment_id": "detx7z7", "post_id": "5yxrwc", "comment": "Very nice. Nothing to sign up for, no BS, just straight to the course. I've been curious about how a structured college class in photography is as compared to all the books, lectures, workshops, etc. that I've seen over the decade.  \n\nEdit, watching this right now...this is great stuff."}, {"comment_id": "deuur8d", "post_id": "5yxrwc", "comment": "I'm actually getting my BFA in photography from a local Art Institute so I can actually fill you in!\n\nEssentially for most classes we have a final project assigned at the start of the semester. The final project can be anything we want it to be, our goal is just to produce a coherent body of work that is not only technically correct but also impactful in some way. \n\nFor day to day stuff we'll have basic assignments in the beginner classes like \"come in with 10 photos with slow shutter speeds showing motion\" \"10 photos stopping motion\" \"one subject shot 10 separate times from different angles\" and such. \n\nAs the classes get more advanced we start doing more advanced dark room or digital techniques like pushing film, toning prints, making a composite image in the dark room from multiple images and enlargers or the same thing in photo shop. \n\nA lot of days are basic work days spent in the dark room or in the digital labs editing photos. For digital we're taught methods on how to color correct images and then how to print them so they are the same as the screen. We have full access to the teacher to ask any questions. \n\nA lot of what we learn is in those basic work days. Just being able to always ask a question whether it be about gear, techniques, technical editing questions etc. \n\nWe're also usually tasked with writing a paper or two about a photographer of our choosing. Sometimes they have to be from a certain era sometimes anything we like. Then we have to present to the class our work. So you end up learning about and being exposed to a lot of photographers. Many classes are also spent looking at photo books as a group and talking about other photographers work. Great way to get inspiration!\n\nOnce every three or four classes we have to have printed work for a group critique on our final project. Great for getting feedback and nailing down your idea. \n\nOur finals are usually our final project matted, and sometimes framed, and prepared as if we were showing them for a gallery. At the end of the year 1-4 of your works can be selected for the annual school gallery as well. "}, {"comment_id": "deugh6m", "post_id": "5yxrwc", "comment": "I watched these when it was posted a couple of months ago. In truth there's more \"interesting to know\" than \"this will improve my photography\" but it's given me lots of ideas.\n\nAnd now I understand *why* light refracts when it goes through a lens, not just *how*."}, {"comment_id": "detwa29", "post_id": "5yxrwc", "comment": "Excellent resource for us teachers! Much appreciated!"}, {"comment_id": "detwjxv", "post_id": "5yxrwc", "comment": "Appreciate your feedback! Thanks :)"}, {"comment_id": "deu2chv", "post_id": "5yxrwc", "comment": "Thanks for this! Already watched the first lecture is pretty good.\n\nFair warning: It is technical"}, {"comment_id": "deufnv1", "post_id": "5yxrwc", "comment": "This is about the third repost of this course link. Maybe it should be put in the sidebar."}, {"comment_id": "deuh0in", "post_id": "5yxrwc", "comment": "Agreed. I've see it posted at least 5 times since January. "}, {"comment_id": "detxxxe", "post_id": "5yxrwc", "comment": "Uhoh, they aren't captioned (and YouTube's auto-captions aren't good enough according to the courts), [someone tell Gallaudet!](http://reason.com/blog/2017/03/07/berkeley-deletes-200000-free-online-vide) "}, {"comment_id": "deuaf09", "post_id": "5yxrwc", "comment": "[deleted]"}, {"comment_id": "detyqne", "post_id": "5yxrwc", "comment": "Jesus that article is audist and ignorant. What a source lol Google's auto captions are fucking useless though"}, {"comment_id": "detu82r", "post_id": "5yxrwc", "comment": "Great link. Thanks. "}, {"comment_id": "detuoxp", "post_id": "5yxrwc", "comment": "Appreciate the love! Thanks :)"}, {"comment_id": "df04wm0", "post_id": "5yxrwc", "comment": "This is great. It also makes me wish I had some kind of formal education earlier in my life, because I realise that I don't really know how to learn. Still absorbing something from it though, I think."}, {"comment_id": "detyr8v", "post_id": "5yxrwc", "comment": "Fantastic.  Thanks OP!"}, {"comment_id": "deujbzr", "post_id": "5yxrwc", "comment": "Just commenting to save this link"}, {"comment_id": "deutz7f", "post_id": "5yxrwc", "comment": "Loving this so far. Also making me the shit out of my college days."}, {"comment_id": "deuu82q", "post_id": "5yxrwc", "comment": "Awesome! Thanks for sharing!"}, {"comment_id": "deuwsaz", "post_id": "5yxrwc", "comment": "Save"}, {"comment_id": "deuxxc4", "post_id": "5yxrwc", "comment": "Thanks"}, {"comment_id": "dev17fv", "post_id": "5yxrwc", "comment": "I'm just adding a comment so it's in my Reddit history and I can go back to this. Thank you so much for this!"}, {"comment_id": "dez6on2", "post_id": "5yxrwc", "comment": "saving the link"}, {"comment_id": "detxw31", "post_id": "5yxrwc", "comment": "Thank you. Is it for beginners, mid-level or professionals?"}, {"comment_id": "deu81vd", "post_id": "5yxrwc", "comment": "even though it says it's for beginners, im a few lectures in and i have to say that some of the mathematical terms about optics, etc are a bit over my head. but you can still get through it and get the general picture from the lectures even without any prior knowledge."}, {"comment_id": "detzkgf", "post_id": "5yxrwc", "comment": "Here's an excerpt from the prereqs section:\n\n> The course assumes no prior knowledge of photography. I also assume no programming experience. The only knowledge I assume is enough facility and comfort with mathematics that you're not afraid to see the depth-of-field formula in all its glory, and an integral sign here or there won't send you running for the hills. Some topics will require concepts from elementary probability and statistics (like mean and variance), but I define these concepts in lecture. I also make use of matrix algebra, but only at the level of matrix multiplication. Finally, an exposure to digital signal processing or Fourier analysis will give you a better intuition for some topics, but it is not required.\n\nSo it looks like anyone can use it!"}, {"comment_id": "deubxyj", "post_id": "5yxrwc", "comment": "In reference to Berkeley: lets sue him because it doesn't cater to the blind! "}, {"comment_id": "deujzos", "post_id": "5yxrwc", "comment": "lol a photography class for the blind"}, {"comment_id": "deud9cl", "post_id": "5yxrwc", "comment": "Holy crap, this is AWESOME! As a noob who plans to take a community college intro course this summer, this is totally helpful and useful. Thank you so much!"}, {"comment_id": "dev0yq7", "post_id": "5yxrwc", "comment": "Makes you wonder if you should stay home and do this instead, doesn't it?"}, {"comment_id": "deu3vfs", "post_id": "5yxrwc", "comment": "Great stuff, thanks for sharing. "}, {"comment_id": "deu8j5h", "post_id": "5yxrwc", "comment": "I shall check this out..."}, {"comment_id": "deuidjw", "post_id": "5yxrwc", "comment": "Saving. "}, {"comment_id": "deuiec5", "post_id": "5yxrwc", "comment": "Jesus FFS you've broken google's server! \nSeems the lecture is very popular jaja says the page. And that the videos is on youtube."}, {"comment_id": "deuka7z", "post_id": "5yxrwc", "comment": "Wow!! Will definitely go through the course, this is amazing."}, {"comment_id": "deukwti", "post_id": "5yxrwc", "comment": "Wait, so I don't have to buy the class notes for $50 ?"}, {"comment_id": "deulyb6", "post_id": "5yxrwc", "comment": "Just started watching. Looks like good stuff, but definitely more technical than creative."}, {"comment_id": "dgfmmaa", "post_id": "5yxrwc", "comment": "Thanks dude!"}, {"comment_id": "dikpqzc", "post_id": "5yxrwc", "comment": "My pleasure :)"}, {"comment_id": "deu73sp", "post_id": "5yxrwc", "comment": "Awesome!! Saved for future self improvement!"}, {"comment_id": "detyx6e", "post_id": "5yxrwc", "comment": "Wow. Thanks. :)"}, {"comment_id": "deuwu0p", "post_id": "5yxrwc", "comment": "I never understood why profs allow questions during lectures. They are never useful and just waste everyone's time. Great videos regardless, though!"}, {"comment_id": "edckhj6", "post_id": "acza2g", "comment": "By the way, this is how we get those wonderful giant Moon over the landscape shots. People always ask me, \"Was the Moon really this big?\" and the answer is, \"With the right zoom lens, yes it was.\" :)"}, {"comment_id": "edcvfh8", "post_id": "acza2g", "comment": "How did I only just understand this!?"}, {"comment_id": "edcywx9", "post_id": "acza2g", "comment": "I believe that’s actually because of relative distance ~~between~~ of the subject and background, not focal length. Tele lenses just make it more likely for you to shoot from farther away from your subject."}, {"comment_id": "eddcvx9", "post_id": "acza2g", "comment": "Could you please link an example? "}, {"comment_id": "edc6gfu", "post_id": "acza2g", "comment": "It's important to note that this demonstration uses a camera that moves for each exposure.\n\nIf you change focal lengths with a stationary camera all that changes is the field of view. "}, {"comment_id": "edc91ro", "post_id": "acza2g", "comment": "2 to 3 seconds in while the tree is at it's biggest.  The background moving closer to the effect of the zoom.  It's called compression.  Longer focal length the more compression.  it effects things in other ways but that is the most noticeable in this"}, {"comment_id": "edced1g", "post_id": "acza2g", "comment": "Which is what a dolly does "}, {"comment_id": "edeu56a", "post_id": "acza2g", "comment": "They probably shot in video actually. I like doing this with my DJI OSMO+"}, {"comment_id": "edc9g75", "post_id": "acza2g", "comment": "It'd make sense to have the info on the focal length and so on."}, {"comment_id": "edcawh0", "post_id": "acza2g", "comment": "Yes I wish they had that  too. "}, {"comment_id": "edck2wp", "post_id": "acza2g", "comment": "I recall from the original that this image was made with a fixed prime and cropping, so the focal length isn't changing, just the crop and/or distance."}, {"comment_id": "edcbwqm", "post_id": "acza2g", "comment": "[Here’s the source](https://www.instagram.com/p/BsEPvdsFQkL/) if anyone is interested."}, {"comment_id": "edce39a", "post_id": "acza2g", "comment": "You get one internet star! \n\nThanks!"}, {"comment_id": "edcchm7", "post_id": "acza2g", "comment": "Thank you! "}, {"comment_id": "edcn68k", "post_id": "acza2g", "comment": "A very interesting disclaimer. The entire GIF is shot on ONE lens/focal length. The dolly-zoom effect in the 2nd part is actually digital (the creator zoomed in at the same rate of the camera moving back).\n\nThere are actually many resources to research about this. It clears the misconception that focal length creates compression. Focal length does not, distance does. A longer focal length simply forces you to stand further - hence everything will look compressed due to paralax effect (maybe paralax I'm not too sure).\n\nAn understandable example would be this: hold an apple one meter from your camera at night, it will look 10 times as big as the moon. Now move the apple further away from the camera a few dozen steps, it will look exactly as big as the moon. The focal length never changed, but if you cropped in on the 2nd picture, the moon is as big as an apple. "}, {"comment_id": "edesxdr", "post_id": "acza2g", "comment": "That resolution upholds pretty well for a digital zoom "}, {"comment_id": "eddasiz", "post_id": "acza2g", "comment": "It makes sense. Couldn't have figure it out. Thanks!"}, {"comment_id": "edc8835", "post_id": "acza2g", "comment": "I can’t stop watching this."}, {"comment_id": "edcaxeo", "post_id": "acza2g", "comment": "Hypnotic isn't it? "}, {"comment_id": "edcgbqq", "post_id": "acza2g", "comment": "It reminds me when I tried LSD"}, {"comment_id": "edcaaxb", "post_id": "acza2g", "comment": "Can someone please explain what is happening here to a noob such as myself?"}, {"comment_id": "edcb94u", "post_id": "acza2g", "comment": "It's something that gets reposted again and again in various forms. Every time the poster claims that the focal length of the lens is what makes the difference. But it's not, it's the distance from the camera to the subject. "}, {"comment_id": "edcwwys", "post_id": "acza2g", "comment": "FStopper made a video to explain what happened\n\nhttps://www.dpreview.com/videos/7518158804/video-there-s-no-such-thing-as-lens-compression-its-just-perspective-distortion"}, {"comment_id": "edcbz2z", "post_id": "acza2g", "comment": "The camera man walks away from the tree twice. The second time, they zoom in on the tree as they walk away so that the tree stays the same size. "}, {"comment_id": "edcans8", "post_id": "acza2g", "comment": "https://en.wikipedia.org/wiki/Dolly_zoom"}, {"comment_id": "edcioyf", "post_id": "acza2g", "comment": "Is this the same effect on Travis Scott  “Sicko mode”?"}, {"comment_id": "edczwug", "post_id": "acza2g", "comment": "Not this again."}, {"comment_id": "edcdzdg", "post_id": "acza2g", "comment": "Thank God I'm not stoned..."}, {"comment_id": "edctpgf", "post_id": "acza2g", "comment": "Any guesses how wide the lens is when the mountains are at their furthest and the tree is up close? Certainly wider than any of the garbage lenses I have. "}, {"comment_id": "edctrwe", "post_id": "acza2g", "comment": "No idea. Idk if they're shooting crop sensor, full frame,  large format or what.  "}, {"comment_id": "eddahwr", "post_id": "acza2g", "comment": "Just an amateur asking a question: the question is irrelevant, but I've been trying to wrap my head around this. Whats the prime difference in final results (including post processing) between a crop sensor and a pro full frame camera? "}, {"comment_id": "eddhpv3", "post_id": "acza2g", "comment": "The only difference is the size of the rectangular image that is captured. [As you can see from this image,](https://www.photographymad.com/files/images/crop-factor-sensor-size.jpg) A crop sensor is going to more zoomed in if you enlarge each image to the same size. You're also going to not capture light coming from the outer edges of the lens if you're using a full frame lens. Other differences have to do with the quality of the sensor."}, {"comment_id": "eddi0yz", "post_id": "acza2g", "comment": "Full frame has a shallower depth of field (\"more background blur\"), and a bit less noise. \n\nAnd obviously no crop factor so the image circle shows e.g. actual 50mm where the crop camera would loose a bit of the sides and look more similar to a 85mm lens. But that's not a quality difference. \n\nThe difference is not huge but images in low light will look a bit better OOC. Also you will get about a stop more blur, so a 2.8 lens on FF will look like a f/1.8 lens shot on crop. That also has downsides of course if you want everything in focus because you have to stop down more. \n"}, {"comment_id": "eddje5c", "post_id": "acza2g", "comment": "Should be on damnthatsinteresting"}, {"comment_id": "edc91fo", "post_id": "acza2g", "comment": "Its crazy how much difference this makes."}, {"comment_id": "edcglzp", "post_id": "acza2g", "comment": "Man I swear I saw this on YouTube a while back."}, {"comment_id": "edch0vx", "post_id": "acza2g", "comment": "I was literally just thinking about what this weird zoomy technique was called. Stop reading my mind reddit!"}, {"comment_id": "edchrua", "post_id": "acza2g", "comment": "Dolly Zoom."}, {"comment_id": "edcoeli", "post_id": "acza2g", "comment": "Am I the only one getting stressed out by this? Kinda feels like it’s pulling on my soul"}, {"comment_id": "edd4v0q", "post_id": "acza2g", "comment": "It's so strange seeing this because I literally just searched Joshua Tree and found a flicker with this as the banner. "}, {"comment_id": "edd663n", "post_id": "acza2g", "comment": "Anyone like me trying to pause the video but failed too many times and gave up?"}, {"comment_id": "edd6vjs", "post_id": "acza2g", "comment": "u/sumthingmessy "}, {"comment_id": "edd9kvx", "post_id": "acza2g", "comment": "This is by Ari Fararooy. One of the best video creators out there. This guy makes insanely beautiful and satisfying videos!\n\nFind him here: [https://www.instagram.com/ari\\_fararooy/](https://www.instagram.com/ari_fararooy/)"}, {"comment_id": "eddfc2u", "post_id": "acza2g", "comment": "It's called the \"Vertigo effect\" and was popularized by Alfred Hitchcock"}, {"comment_id": "eddukip", "post_id": "acza2g", "comment": "OMG this looks Soo good "}, {"comment_id": "ede72za", "post_id": "acza2g", "comment": "I love the Joshua trees. They are such and intetesting plant. When they first start growing they look like cats tails in the ground. "}, {"comment_id": "ede7e4b", "post_id": "acza2g", "comment": "Can anyone explain how they got the background to be so much larger when it was closer to the tree?"}, {"comment_id": "edea4r4", "post_id": "acza2g", "comment": "It wasn't closer, it was farther away and cropped in tight on the tree."}, {"comment_id": "edf1gne", "post_id": "acza2g", "comment": "Assume the background is at least several hundred meters away. When you stand in front of the tree it is hundreds of times closer to you than the background, so it is hundreds of times larger in frame. When you step back a hundred meters from the tree, the ratio changes - the tree may only be 4-5x closer than the background, so the perceived scale changes too - it is only 4-5 times larger in frame now. \n\n&#x200B;\n\ntl;dr It all depends on your distance from each object. Change the ratio of distances and the ratio of perceived sizes changes to match."}, {"comment_id": "edeejve", "post_id": "acza2g", "comment": "I was actually explaining this to a friend the other, how different focal lengths affect the background. This is the perfect gif for my point!"}, {"comment_id": "edet8ea", "post_id": "acza2g", "comment": "The background doesn't change at all with different focal lengths, it changes with camera to subject distance. "}, {"comment_id": "edes6kd", "post_id": "acza2g", "comment": "This is one of the reasons a serious photographer would never be able to fully explore their creativity on a camera phone.\n\nFor example the current iPhone camera has 35mm-equivalent focal length of approximately 28mm, while its “portrait mode” lens does 56mm. You can do some digital zooms on top of that but the image quality deteriorates significantly pretty quickly. \n\nThese are adequate and useful for most travel and event snapshots, portraits etc. It may also let you do some landscapes. However one is not allowed to do a landscape that allows you to encompass both the foreground and the background, or change the field of view creatively to alter the perspectives, as demonstrated well in this animation. "}, {"comment_id": "edf5lli", "post_id": "acza2g", "comment": "This is great,  not just for landscape,  it's how you get the garbage out of the frame,  wouldn't work there now and  that tree has poop on it now from what I understand.    "}, {"comment_id": "edfa2ec", "post_id": "acza2g", "comment": "The fun part here is that the same picture is available in both parts of the loop, it is just different cropping. \n\nWhen the camera moves away, if you imagine cropping to the tree each frame, you get what the other part of the loop shows."}, {"comment_id": "ei7m0x3", "post_id": "acza2g", "comment": "Wow!"}, {"comment_id": "edcbvqk", "post_id": "acza2g", "comment": "I just wet my panties "}, {"comment_id": "edco8yq", "post_id": "acza2g", "comment": "r/perfectloops"}, {"comment_id": "edcbfsh", "post_id": "acza2g", "comment": "Slower you slut. (Some cultural reference right?)\nAnd with descriptions please."}, {"comment_id": "edcbm73", "post_id": "acza2g", "comment": "I wish, especially for the focal length zoom... "}, {"comment_id": "evs32kt", "post_id": "ckzeg6", "comment": "I've spent way too much time watching people struggle to find the exit pupil to take an image with a cell phone through a scope or mounted binoculars (wildlife viewing). The fastest way to find the very small exit pupil is to do the reverse of what is shown here. Start with the phone at some distance and find the small dot of light that is the exit pupil. Now follow it as you move the phone closer, continue until basically as close as the eyepiece will allow while maintaining the bright circle in the centre of the camera. By now it will appear as a circular image roughly in the middle of your screen. Make minor adjustments as needed. For advanced results, change your metering to spot mode, and even adjust manual exposure, sometimes you need to dial it down a half stop or so to get a more balanced exposure. Avoid HDR modes, they use multiple frames to create an image which is more likely to introduce blur or softness as telescopes are often quite \"slow\" which means your shutters speeds will be limited somewhat. Conditions dependent of course. Happy digiscoping!"}, {"comment_id": "evs3fyo", "post_id": "ckzeg6", "comment": "Excellent advice! \nAfter much trial and error I found that the “reverse of what is shown” method works great. Thanks for the additional tips!"}, {"comment_id": "evsmn7m", "post_id": "ckzeg6", "comment": "[deleted]"}, {"comment_id": "evs1vlg", "post_id": "ckzeg6", "comment": "This is called digiscoping and is fun!\n\nOne time, I went to Point Reyes and out of sheer luck, a volunteer group had set up telescopes aimed at elephant seals. Closest you could get to those seals without dying"}, {"comment_id": "evs21pk", "post_id": "ckzeg6", "comment": "I did a winter tour in Grand Teton and me with my 500mm got crappy photos while everyone with their iPhone got excellent ones because the tour guide used the scope and they used the method from the video."}, {"comment_id": "evs6921", "post_id": "ckzeg6", "comment": "I doubt that regarding the elephant seals. They’re not very aggressive, at Año Nuevo State Park you can get within steps of them and there’s mostly a perfunctory chain barrier for the people."}, {"comment_id": "evsrjyn", "post_id": "ckzeg6", "comment": "I went on a tour in Monteverde, Costa Rica and used my phone through telescopes there to get some awesome animal shots. \n\nIt’s really fun to do!"}, {"comment_id": "evry7b9", "post_id": "ckzeg6", "comment": "I read a post once where a guys kid put it up to a telescope to photo the moon to some cool results."}, {"comment_id": "evs2ciu", "post_id": "ckzeg6", "comment": "It is hard as fuck to get it aligned and focused. [It can be done](https://i.imgur.com/0tVjreZ.jpg) but it’s insanely hard in my experience and you will take 100+ shitty shots for every good one you get."}, {"comment_id": "evshapo", "post_id": "ckzeg6", "comment": "Yep, I did this as part of my coursework in school. Its hard as fuck to get it aligned, especially as the moon moves so quickly in the sky so you only have a few seconds to get the shot before you have to realign the telescope. Really fun though, would highly recommend"}, {"comment_id": "evs8lv5", "post_id": "ckzeg6", "comment": "I did this a couple weekends ago, it was a blast. Heres my post on /r/telescopes  \n https://www.reddit.com/r/telescopes/comments/ch4kco/finally_got_the_scope_out_last_weekends_heres/"}, {"comment_id": "evwxl9x", "post_id": "ckzeg6", "comment": "Yes, I actually did this for the 2017 solar eclipse with an iPhone. [Here](https://i.imgur.com/R7M4v6L.jpg)"}, {"comment_id": "evsr2s4", "post_id": "ckzeg6", "comment": "I've [done this](https://imgur.com/a/XdmxF3e) a handful of times with a pretty cheap telescope and a 3 year old smartphone."}, {"comment_id": "evs4fui", "post_id": "ckzeg6", "comment": "Also with telescopes and microscopes."}, {"comment_id": "evs4uxk", "post_id": "ckzeg6", "comment": "It takes insane skills to get a proper photos on a microscope."}, {"comment_id": "evsd34z", "post_id": "ckzeg6", "comment": "It's easy once you get the hang of it\n\nhttps://i.imgur.com/3mrB9Vq.jpg"}, {"comment_id": "evteghn", "post_id": "ckzeg6", "comment": "Really? I thought it was easy as hell back when I had to do it for undergrad microbio.\n\n&#x200B;\n\n[https://i.imgur.com/92CngY5.jpg](https://i.imgur.com/92CngY5.jpg)"}, {"comment_id": "evs4wc6", "post_id": "ckzeg6", "comment": "I can only imagine.. and pro level patience"}, {"comment_id": "evsfq5d", "post_id": "ckzeg6", "comment": "[removed]"}, {"comment_id": "evs19ix", "post_id": "ckzeg6", "comment": "I do that too often"}, {"comment_id": "evs4pmy", "post_id": "ckzeg6", "comment": "I've done this twice, when my dslrs battery ran out and I used to spot a bird, use the binocs to take a record shot, works like a charm (:"}, {"comment_id": "evs8dba", "post_id": "ckzeg6", "comment": "With microscopes too! You have to be very steady though, otherwise you won’t have a good view from your phone"}, {"comment_id": "evsa2ip", "post_id": "ckzeg6", "comment": "Wow! this view is amazing.."}, {"comment_id": "evt21fp", "post_id": "ckzeg6", "comment": "To anyone who wants to do this a bit more easily(it can be quite tricky to not only line it up but then hold it there) there are small, pretty cheap mounts you can get that work well. I found them at Scheels several years ago, I’m sure you can find them on Amazon and such as well."}, {"comment_id": "evs2pxh", "post_id": "ckzeg6", "comment": "Duh"}, {"comment_id": "evs145e", "post_id": "ckzeg6", "comment": "Yes, that is how light works..."}, {"comment_id": "evs1lk1", "post_id": "ckzeg6", "comment": "Not everyone knows about this"}, {"comment_id": "evs1j7l", "post_id": "ckzeg6", "comment": "It is, you’re right.  Very well done, everyone’s proud of you.\n\nNow explain to us all why a DSLR lens with a similar focal length doesn’t work quite as well?  Especially (apparently - so I’ve found) in telescope optics?"}, {"comment_id": "evsbzcz", "post_id": "ckzeg6", "comment": "https://m.imgur.com/a/5wWifXc best i could do 😀"}, {"comment_id": "evszf45", "post_id": "ckzeg6", "comment": "This is where the Nikon P1000 excels."}, {"comment_id": "evt4kz7", "post_id": "ckzeg6", "comment": "you can do it with a microscope too.  i've done it to inspect 2D barcode printing errors at work."}, {"comment_id": "evt9m33", "post_id": "ckzeg6", "comment": "Anyone know how to do this with the iPhone X without it freaking out? When I tried this, the camera would flip back and forth between the 2 lenses and I would keep losing the shot."}, {"comment_id": "evtbm5w", "post_id": "ckzeg6", "comment": "Good question!\nI have the Xs max and it does the same thing (but only when I’m using 2x zoom)\nTurns out the phone decides which lens to use depending on which one it thinks looks best. \n\nSo, the only way to ensure it doesn’t freak out is to keep it zoomed under 1.9x\nIn this clip I was completely wide at 1x"}, {"comment_id": "evt9tk7", "post_id": "ckzeg6", "comment": "Ohhh ima try"}, {"comment_id": "evtdhav", "post_id": "ckzeg6", "comment": "[Here’s](https://i.imgur.com/i7ondcZ.jpg)my photo of the moon with a iPhone 6s through a telescope. Like others have said, it’s really difficult to hold everything still and in alignment."}, {"comment_id": "evtgplf", "post_id": "ckzeg6", "comment": "Oh my gosh that’s incredible!!"}, {"comment_id": "evtdyjf", "post_id": "ckzeg6", "comment": "Oh nice, that makes sense. Thanks!"}, {"comment_id": "evtmdbo", "post_id": "ckzeg6", "comment": "Amateur tip: when taking a video, use your phone horizontally."}, {"comment_id": "evtw7q8", "post_id": "ckzeg6", "comment": "thanks for the feedback! \nI made the assumption that most folks who use reddit are on mobile and intentionally filmed it vertically for their sake."}, {"comment_id": "evtovx2", "post_id": "ckzeg6", "comment": "I got a few nice moon shots with the telescope"}, {"comment_id": "evtw57r", "post_id": "ckzeg6", "comment": "Also telescopes"}, {"comment_id": "evu2l2u", "post_id": "ckzeg6", "comment": "It works with microscopes too, and you can take awesome pics of microscopic things. It's amazing."}, {"comment_id": "evu7b67", "post_id": "ckzeg6", "comment": "Sweet! Have you shot any yourself?"}, {"comment_id": "evu5zd6", "post_id": "ckzeg6", "comment": "[deleted]"}, {"comment_id": "evu7abr", "post_id": "ckzeg6", "comment": "Nice capture!"}, {"comment_id": "evu69bq", "post_id": "ckzeg6", "comment": "Same with telescopes"}, {"comment_id": "evu6aho", "post_id": "ckzeg6", "comment": "Same with telescopes"}, {"comment_id": "evua6wz", "post_id": "ckzeg6", "comment": "I’ve actually done a lot of this and it’s really fun to do!"}, {"comment_id": "evufuay", "post_id": "ckzeg6", "comment": "Thank you! I will use this (eventually)."}, {"comment_id": "evum3tc", "post_id": "ckzeg6", "comment": "That's actually very useful."}, {"comment_id": "ex47lvv", "post_id": "ckzeg6", "comment": "Will try thanks"}, {"comment_id": "evs2ajx", "post_id": "ckzeg6", "comment": "I did not knew it could work. Seems I will bring my binoculars with me to Japan"}, {"comment_id": "evs4j22", "post_id": "ckzeg6", "comment": "[Or, here's an idea ... you buy a $10 telescope addon for your phone which actually fits in your pocket.](https://www.ebay.com/sch/i.html?_from=R40&_trksid=m570.l1313&_nkw=phone+monocular&_sacat=0)"}, {"comment_id": "evujska", "post_id": "ckzeg6", "comment": "I do this with microscopes all the time.  \n\nScope camera manufacturers should and must be worried. I get very good results."}, {"comment_id": "evujzai", "post_id": "ckzeg6", "comment": "seriously! it's crazy how well it works"}, {"comment_id": "evsa0xd", "post_id": "ckzeg6", "comment": "I made pictures of my research this way, but with (stereo)microscopes. It's fun! The positioning is a bit difficult but once you get the hang of it it's very easy to do."}, {"comment_id": "evsc08u", "post_id": "ckzeg6", "comment": "Hey I have the same set of binoculars, Nikon Monarch, right? I’ve had to return it in twice because of broken eye cups."}, {"comment_id": "evscbk8", "post_id": "ckzeg6", "comment": " https://imgur.com/rQQtKhI I've taken this with my phone. It was pretty hard because I had no support for the binoculars."}, {"comment_id": "evsd0xf", "post_id": "ckzeg6", "comment": "Why does the colour look different through the lenses?"}, {"comment_id": "evslvev", "post_id": "ckzeg6", "comment": "Quality and coatings on the glass elements can effects the colors. Modern lenses usually have better color reproduction than vintage lenses."}, {"comment_id": "evsib2r", "post_id": "ckzeg6", "comment": "Good binoculars like the Nikon shown here can do this.\nBut what about the cheapo ones?"}, {"comment_id": "evsjmgb", "post_id": "ckzeg6", "comment": "I've done this for birding and at concerts.  It's not high quality, but gets the job done."}, {"comment_id": "evsjtxs", "post_id": "ckzeg6", "comment": "They also work with microscopes"}, {"comment_id": "evskbny", "post_id": "ckzeg6", "comment": "Also works on microscopes.\n\nNot as easy as it looks."}, {"comment_id": "evskpqd", "post_id": "ckzeg6", "comment": "I find one in fifty pictures captured this way is usable."}, {"comment_id": "evsly36", "post_id": "ckzeg6", "comment": "This would probably work quite well with electronic stabilised binoculars."}, {"comment_id": "evso2f0", "post_id": "ckzeg6", "comment": "Pro tip - binoculars generally have terrible correction for chromatic aberration."}, {"comment_id": "evspk8f", "post_id": "ckzeg6", "comment": "There's a few companies that make case that fit over the eyepiece of the binoculars to help with centering. I know Swarovski and Zeiss sell them to fit their binoculars."}, {"comment_id": "evssuei", "post_id": "ckzeg6", "comment": "Was doing this very thing this morning: https://flic.kr/p/2gNoF1P"}, {"comment_id": "evsvm13", "post_id": "ckzeg6", "comment": "[Works with Microscopes too!](https://i.imgur.com/hp4Y5Ga.jpg) I do it at work every day.  If I have to take several pics, I bust out [this thing](https://www.amazon.com/dp/B01788LT3S/); which is meant for telescopes, but I use it on several microscopes."}, {"comment_id": "evsx315", "post_id": "ckzeg6", "comment": "love this trick !! i use it a lot at concerts~\n[here's a before/after shot](https://imgur.com/a/oO4W3Pr)"}, {"comment_id": "evtx60j", "post_id": "ckzeg6", "comment": "Shadow Mountain in Grand Lake?"}, {"comment_id": "evu70jo", "post_id": "ckzeg6", "comment": "Not sure! I just know I was above grand lake’s “down town” looking south"}, {"comment_id": "evuc2pt", "post_id": "ckzeg6", "comment": "I used to do this with a microscope during hemo class. Took pictures of my own red and white cells"}, {"comment_id": "ew1xre8", "post_id": "ckzeg6", "comment": "This is clever"}, {"comment_id": "e42rad4", "post_id": "96rwhs", "comment": "Not gonna remove it. We always welcome discussion.\n\nMods are looking through these threads for ideas and having discussions about what to change. We are listening. Stay tuned.\n\nEdit:\n\n**We are removing the restriction on question threads.**\n\nThe almighty megathread stays up but you may post your questions as individual threads. For now, other restrictions (self promotion, especially spam) stay, but we're looking through _all_ of our rules and seeing what we should remove, at least temporarily to test it.\n\nWe've been seriously talking about this for some time now, and will be wanting your feedback regularly. This thread brought things to a head, we said - okay, let's do that thing we've been talking about, starting right now.\n\nOpen feedback is best, but if you want to modmail us, please do so.\n\nPlease do remember that we are janitors, we're not trying to be petty little fief rulers ... these rules were all originally put in place due to a huge amount of feedback. Now, due to a huge amount of feedback the other way, we're changing them. They may change again so _please tell us what you want._\n\nAnnouncement incoming.\n\nEdit 2:\n\nA few new points:\n\n[We are talking about what the daily stickies should be.](https://www.reddit.com/r/metaphotography/comments/95wdt2/daily_threads/)\n\nAfter watching how the new questions-policy goes, we may choose a middle ground, where some _specific types_ of questions get redirected. Perhaps instead of judgement calls regarding basic questions, we'll try to redirect types of questions like \"which camera should I buy\" or \"nikon vs canon\" or \"mirrorless vs dslr.\"\n\n/u/ccurzio is by far our most active mod, thus many of your mod interactions will be with them - please stop and think, for a moment, that that means _they are doing the most to make this place good_ and they are, in fact, a real person. Before you get all indignant, please consider the person and consider your own actions - if you don't like the rules, we want criticism, but please don't target individuals who are doing the biggest job of enforcing the rules."}, {"comment_id": "e42t7rf", "post_id": "96rwhs", "comment": "Thanks. I think in an in-general loosening of the reins is a good thing - especially with question threads. I’ve been here long enough to remember the ‘what camera should I buy’ threads - I don’t want em back, but, we used to have a more active sub.  I’d like to go back to that. \n"}, {"comment_id": "e42u9io", "post_id": "96rwhs", "comment": "Thank you for doing what you do for us. You can't ever satisfy us all, but It is nice to see you're actually listening. "}, {"comment_id": "e42t591", "post_id": "96rwhs", "comment": "Thank you for taking the time and actually listening to the community! We appreciate it, looking forward to seeing more from this subreddit."}, {"comment_id": "e42sw9h", "post_id": "96rwhs", "comment": "Thank you so much for removing the restriction on questions."}, {"comment_id": "e43gpx1", "post_id": "96rwhs", "comment": "> /u/ccurzio is by far our most active mod, thus many of your mod interactions will be with them - please stop and think, for a moment, that that means they are doing the most to make this place good and they are, in fact, a real person. Before you get all indignant, please consider the person and consider your own actions - if you don't like the rules, we want criticism, but please don't target individuals who are doing the biggest job of enforcing the rules\n\nMight also want to tell your colleague that being a dick to people consistently isn’t the best way to have a good relationship with the community "}, {"comment_id": "e4379r3", "post_id": "96rwhs", "comment": "Here's my 2 cents on question threads.\n\n\"What camera should I buy?\" should go into the megathread.\n\n\"What kind of gear should I bring if I'm touring with a band?\" should be allowed as its own thread. I was pretty annoyed when that thread got deleted a few weeks ago, despite having around 50 comments, with a lot of good insight."}, {"comment_id": "e42zxc5", "post_id": "96rwhs", "comment": "OP is a hero!!\n\nSeriously though, this is a very nice response. People tend to forget mods generally aren’t powertripping or anything, they just want the place to work optimally without spam/shit drowning everything. Let’s see how this works out!\n\n"}, {"comment_id": "e432bw1", "post_id": "96rwhs", "comment": "Thank you so much for listening, being civil, and being flexible.  You're awesome.  Let's hope this helps things grow around here."}, {"comment_id": "e439dr4", "post_id": "96rwhs", "comment": "If you're looking for suggestions, one option is to have a weekly camera suggestion megathread to avoid repetitive questions, but general questions or other gear get their own posts. Or if you do want gear posts, then enforce a form they have to fill out with budget, uses, etc. I've seen these work in other threads, and it would make things a lot easier on the mods.\n\nWhat's important to remember is that some portion of the community will always want things to be different than they are, even if they also wouldn't like the change."}, {"comment_id": "e4499m2", "post_id": "96rwhs", "comment": "> ccurzio is by far our most active mod, thus many of your mod interactions will be with them - please stop and think, for a moment, that that means they are doing the most to make this place good and they are, in fact, a real person. Before you get all indignant, please consider the person and consider your own actions - if you don't like the rules, we want criticism, but please don't target individuals who are doing the biggest job of enforcing the rules.  \n\nYou do realize that the **quality** of the interactions have just as much of an impact as the **quantity** of them, right? Just a casual glance through this shows there's not a whole lot of love for them. And it's not just the removal of posts that shouldn't be on the front page, but their overall attitude. If they're gonna be rude and condescending, then maybe there should be some re-thinking in regards to who's the \"face\" of the /r/photography community considering they're the most active, as you say."}, {"comment_id": "e44kplg", "post_id": "96rwhs", "comment": "> please stop and think, for a moment, that that means they are doing the most to make this place good and they are, in fact, a real person\n\nThat starts with the mod team.  You have a mod who has been rude to countless contributers to /r/photgraphy.  And I'm not talking about people posting \"what camera should I buy?\"  These are folks who are regulars here who contribute the content that makes this subreddit what it is.  I've never seen so many people call out the actions of one mod in a subreddit. "}, {"comment_id": "e43l6pd", "post_id": "96rwhs", "comment": "YES thank you for removing the restriction. My least favorite thing to see is\n\n/u/ccurzio: YoUr PoSt HaS vEeN rEmOvEd FrOm /R/pHoToGrApHy"}, {"comment_id": "e42wcct", "post_id": "96rwhs", "comment": "I somewhat agree with OP but I will unsubscsribe if my entire front page is \"Beginner here: Canon or Nikon?\"\n\nIs there a way to auto-filter questions with keywords and phrases like \"should I buy\" to ask them to go to the wiki before posting?"}, {"comment_id": "e42vabe", "post_id": "96rwhs", "comment": "Yay!"}, {"comment_id": "e43cm33", "post_id": "96rwhs", "comment": "I think this is the first time I've ever seen a mod team positively respond to user feedback and make a major change to a sub.\n\nLike I actually have to tip my hat for this one. You guys are a diamond in the rough. "}, {"comment_id": "e43ponh", "post_id": "96rwhs", "comment": "> We are removing the restriction on question threads.\n\nI don't think that's what people are asking for. The frustration is because of \n\n1. post something\n2. get response (yay!)\n3. thread gets removed with copy pasta anwer\n4. spot a similar thread that lived\n5. argue with mod (yeah they're people, they make mistakes, but why make rules that are not possible to consistently enforce)\n\nWhy not only ban questions that are *literally* answered in the FAQ, except when the FAQ is out of date or doesn't apply. Or block everything and just approve that which is looking good. Point 2 - 3 are the ones that discourage from ever posting again the most."}, {"comment_id": "e42setg", "post_id": "96rwhs", "comment": "> Not gonna remove it. We always welcome discussion.\n\nI feel like every post like this has that disclaimer but we've never actually removed one, to my knowledge. \n\nIn fact, not sure how OP missed the one from [4 days ago](https://www.reddit.com/r/photography/comments/95fg1n/im_just_going_to_ask_it_how_does_this_subreddit/) ;) "}, {"comment_id": "e432bjj", "post_id": "96rwhs", "comment": "I have a suggestion. Remove your mods who are assholes to people, starting with u/ccurzio. Just look at the guy's comment history and the discussion in the thread the other day about him. He's constantly a dick to people for no reason. There's no reason someone like that should be a mod. He makes you all look bad, bullies people into not participating, and makes this sub a miserable unfriendly place. The thread was full of reasons why people don't like this sub and all he did was argue and pick fights with people. "}, {"comment_id": "e4428rf", "post_id": "96rwhs", "comment": "I've been participating in online social forums for almost thirty years, and I have seen the same dynamics and patterns happen over and over. \n\nWhich is why I always give this advice to mods: removing content should always be the absolute last option. \n\nMods always seem to obsess over the number of users in a sub, but don't pay much attention to the amount of content being posted. The problem is if there's no content, your users leave. And the really dangerous fact that most mods seem to forget: Delete my post once, shame on you; delete my post twice, shame on me. Having a post deleted *stings* and may dissuade many people from ever trying again. \n\nHere's the model: You have signal (posts / good content) and you have noise (spam, abuse). Every post is some level of signal vs. noise. The goal is to maximize signal and minimize noise. The problem is that so many mods think a wise move is to remove posts that *they perceive* as being \"not enough signal.\" \n\nThe problem is that the signal / noise ratio is different for every person. And when you get \"a lot\" of users complaining about some kind of post, you really should consider the number of people complaining vs. the number of viewers you have. In other words - don't let the noisy minority drive your decisions (even if you agree with them). \n\nFor the most part, leave posts that are \"lower\" signal. Only remove posts that are virtually 100% noise. Let voting deal with the rest. "}, {"comment_id": "e43i6pd", "post_id": "96rwhs", "comment": "Why is ccurzio a mod? He’s rude as hell and he is singlehandedly ruining the sub for thousands of people. Demod him and solve the problem."}, {"comment_id": "e435cno", "post_id": "96rwhs", "comment": "I feel like completely removing question restrictions is just as extreme as the situation we have/had now. Instead if no question threads we will be flooded with the same stuff. Maybe change the stickied question thread to a gear buying advice thread and only allow other qestions than these outside of this new stickied thread. "}, {"comment_id": "e43birb", "post_id": "96rwhs", "comment": "Might be worth it to do some kind of quasi-rigorous survey.\n\n"}, {"comment_id": "e4448iz", "post_id": "96rwhs", "comment": "Just understand that everything is a cycle. Don't ignore the cycle, but just be aware of it. In five or six years don't be surprised if the forum wants to change back. And then back again. It's not bad, it's just a reminder to be mindful and don't let the frustration build up. Are you guys doing annual or bi-annual surveys to get feedback? Don't let the pressure build up."}, {"comment_id": "e43hakl", "post_id": "96rwhs", "comment": "I feel that if you're going to ask for honest opinion, and we  show specific instances of where a particular mod was needlessly being rude, you should accept it as constructive criticism instead of calling it \"targeting\".  Once you do that, you're introducing your own biased as a fellow mod and it makes it harder to have an honest conversation.  It's not personal. "}, {"comment_id": "e42yztp", "post_id": "96rwhs", "comment": "Remove the subjective rule on what constitutes a \"broad photography discussion\""}, {"comment_id": "e4339vh", "post_id": "96rwhs", "comment": "Thank you for listening."}, {"comment_id": "e434wxk", "post_id": "96rwhs", "comment": "Please. When you get the updates. Sticky them as posts or in the comments to stuff like polls or threads. Because I'm not necessarily a regular user of the sub. But I would love to participate and take action to improve this sub. Thanks mods!!"}, {"comment_id": "e43n67c", "post_id": "96rwhs", "comment": "As someone who subscribes to this sub, but doesn't frequently actually *go* to the sub, I didn't even know there was a \"general discussion\" thread.  I thought I subscribed to this sub to see discussion, but it appears it's mostly been hidden away.  "}, {"comment_id": "e43ykib", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e437qgh", "post_id": "96rwhs", "comment": "I understand there has to be restrictions, especially with self promotion, but maybe there could be a specific day for photo review? Maybe themes with a certain style/mood just to see what people are creating? Everyone is passionate photography here, it would be nice to see what people are making."}, {"comment_id": "e43elqf", "post_id": "96rwhs", "comment": "Maybe we can have weekly or monthly stickied threads on \"what camera to buy?\", \"Promote your blogs/articles here\"  and other common topics. \n\nAlso, there are many subreddits where days of the week are set aside for specific topics. Perhaps we can do something like a \"teach me Tuesday\" when inexperienced photographers can ask questions about shooting and editing techniques, and a \"photo Friday\" for us all to show off. Not that I'd want threads locked for posting the \"wrong\"  thing on the wrong day, but more of a general encouragement to focus on those things on those days. \n\nJust a couple cents' worth of ideas, anyhow. "}, {"comment_id": "e43jwa2", "post_id": "96rwhs", "comment": "Fair play."}, {"comment_id": "e437ytx", "post_id": "96rwhs", "comment": "> We are removing the restriction on question threads.\n\nIf it counts for anything, I'm not in favor of this. \n\n> please tell us what you want.\n\nI like how things are handled right now. \n\nI've seen a number of posters bring this topic up every few weeks, and IMO their posts stems from A. being butthurt that their special snowflake post was removed or B. not understanding just how useful the megathreads are and how few questions go unanswered because they never actually tried using it.\n\nI'm in a cranky mood tonight, so ... take this with a grain of salt."}, {"comment_id": "e430cd3", "post_id": "96rwhs", "comment": "All hail the mods!"}, {"comment_id": "e43ofk6", "post_id": "96rwhs", "comment": "Glad to hear you're actively responding to this post, but it is a shame that it had to come to that. "}, {"comment_id": "e45tw5i", "post_id": "96rwhs", "comment": "8/14/2018 12:32 am - This was a mistake. The sub is now drowning in the most basic questions. A balanced middle ground is in order."}, {"comment_id": "e42rgo0", "post_id": "96rwhs", "comment": "I absolutely hate the bucket \"post here with a question\" threads.  I'd rather see a \"post youtube video links here\" thread while the rest of the subreddit is filled with actual conversations."}, {"comment_id": "e42xkgh", "post_id": "96rwhs", "comment": "I'm yet not sure this isn't just going too far the other way.\n\nFor example, how many times do I see lazy questions over and over in some subs. \"Hey I'm looking to buy a camera, what's the best one?\"\n\nNo budget info, no information on what type of shooting they plan to do or what their goals are, etc. These type of posts can then water down a forum slowly taking it over.\n\nDefinently is tough to find a good balance to the health of a forum."}, {"comment_id": "e42ta9w", "post_id": "96rwhs", "comment": "Agreed. As someone fairly new to photography, I’d prefer to read through other people’s questions to learn something than all these YouTube posts of people promoting their videos. Just my opinion..."}, {"comment_id": "e42ty0h", "post_id": "96rwhs", "comment": "So you want a thousand threads asking which camera is better? Because that’s how you get those. "}, {"comment_id": "e435fbg", "post_id": "96rwhs", "comment": "I stopped coming to this subreddit because I didn't come here to be on youtube. "}, {"comment_id": "e43a542", "post_id": "96rwhs", "comment": "Absolutely! If I want to see the Reviews and tutorials *I go to Youtube*. I loathe the weekly discussion format because it just seems to feel forced and like you said, it’s a bucket. Post gets lost and nobody pays attention!"}, {"comment_id": "e439tdb", "post_id": "96rwhs", "comment": "Agreed. Been posting here for years. Asked one question a question thread and it went unanswered and have never remembered to check it out and answer questions. \n\nOn the flip side, I often see an interesting question as a self post and by the time\nI click it, it’s been removed. "}, {"comment_id": "e42zyhr", "post_id": "96rwhs", "comment": "Yes!\n\nAgreed. "}, {"comment_id": "e43k6fz", "post_id": "96rwhs", "comment": "This"}, {"comment_id": "e43ceme", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e43ldet", "post_id": "96rwhs", "comment": "As someone who only tried once to post a question here and probably didnt phrase it in quite the right eay, i agree with this. I want to come here and learn about taking photos with equipment i might already have\n\nEdit downvoted for an opinion, seems right, lol"}, {"comment_id": "e42s1jg", "post_id": "96rwhs", "comment": "Instead of removing so many threads deemed unworthy, why not put prominent flair on them, like \"Gear Advice\" etc."}, {"comment_id": "e42t1yk", "post_id": "96rwhs", "comment": "Yes, we are discussing using post flair. Thanks!"}, {"comment_id": "e43acf0", "post_id": "96rwhs", "comment": "Aww shucks, take this upvote!"}, {"comment_id": "e42qxff", "post_id": "96rwhs", "comment": "I rather have more \"bad\" threads than a dead sub.\nYou are by far not the only one."}, {"comment_id": "e42v7aa", "post_id": "96rwhs", "comment": "Plus there is no symbol for the subreddit on Reddit mobile. It is just the generic one all subs get that don't have a symbol."}, {"comment_id": "e43399k", "post_id": "96rwhs", "comment": "I agree. The entire idea behind Reddit’s voting system is to allow the users to decide on the content. Downvote something if it is truly not worthy content. "}, {"comment_id": "e42tugi", "post_id": "96rwhs", "comment": "To me, bad threads = dead sub. "}, {"comment_id": "e42wm9s", "post_id": "96rwhs", "comment": "Doesn't always work. Check out the Sony Alpha sub for example. 80% posts of meh pics.\n\nEdit: Ah shit. Replied to wrong person.. sorry."}, {"comment_id": "e434h55", "post_id": "96rwhs", "comment": "Yup.  The only reason I come here is to see if there has been new gear announced.  I want those general questions on the front page.  Posts stay on the front page for days I feel.  "}, {"comment_id": "e42xz9l", "post_id": "96rwhs", "comment": "The rules of Reddit make bad threads drown under good threads though. Upvote threads that promote positive discussion, downvote threads that don't. Easy! "}, {"comment_id": "e42s8or", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e42qj01", "post_id": "96rwhs", "comment": "Yeah, I agree with you. Everything is auto-removed and no real discussion goes on beyond new camera and gear releases. "}, {"comment_id": "e42qul7", "post_id": "96rwhs", "comment": "Thank you.  I firmly believe this subreddit could be a real resource for average people, and I don't think the mods mean to subvert that goal.  I suspect years of removing posts titled, \"which camera should I buy\" led to mods simply removing everything without thinking.  This subreddit was a godsend back when it was useful in that sense, because everywhere else required memberships or affiliations to post questions, and nowhere else had the level of viewership or traffic as this subreddit.  \n\nThere are some really accomplished and experienced and talented people on this sub who could be invaluable if given the opportunity.  But it needs to change for that to happen."}, {"comment_id": "e42s5kf", "post_id": "96rwhs", "comment": "nobody posts anything other than gear talk.. for the love of god if you want art talk and debates post them! fuck ill even help anyone with researching any of the art related stuff they want to talk about\n\nthere have been plenty of topics like this in the past and it always boils down to 'I want this, I want that' yet none of those people ever put effort into posting the topics they want to talk about \n\n"}, {"comment_id": "e42u4bw", "post_id": "96rwhs", "comment": "It’s not only auto removed but aggressively removed by mod u/ccurzio who on top of removing everything also talks down to users and belittles them"}, {"comment_id": "e42qqou", "post_id": "96rwhs", "comment": "Honestly I think this sub could learn from a sub like r/analogcommunity, which has a good rate of conversation and information, without blogspam, even though it's quite a small sub"}, {"comment_id": "e42t7sn", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e42rcwd", "post_id": "96rwhs", "comment": "Of course,  analogcommunity is an offshoot of /r/analog based on their sidebar\n\nIf you're saying that a lot of the crap that gets removed here doesn't have a place here....I'd agree ;)\n\nAnd a 4k sub and a 600k sub are a little different. "}, {"comment_id": "e42zbih", "post_id": "96rwhs", "comment": "half of the posts on the front page seem to be pictures of film and pictures of cameras, no thanks."}, {"comment_id": "e42zdze", "post_id": "96rwhs", "comment": "Anal OG community....\n\nOH! Analog! That took me too long.  Butts on the brain."}, {"comment_id": "e42rpu7", "post_id": "96rwhs", "comment": "I agree wholeheartedly. I intended to post a specific question here yesterday regarding tradeoffs among lenses I own for some upcoming travel. I was immediately dissuaded by the second rule:\n\n>Questions asking for help (including ... advice) should be posted in the most recent Official Question Thread.\n\nWhat the fuck good is the sub then if **all** discussion is pigeonholed indiscriminately into a single thread under threat of removal? Useless."}, {"comment_id": "e430m6i", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e42u9aa", "post_id": "96rwhs", "comment": "What about u/ccurzio? Overly aggressive moderator not only in removing 99% posts but also in talking down to users daily"}, {"comment_id": "e433x6n", "post_id": "96rwhs", "comment": "Yeah I scrolled through that guy's post history and i'm amazed at how combative and just plain rude he is. Dude should maybe take a break from reddit..."}, {"comment_id": "e4345ie", "post_id": "96rwhs", "comment": "Exactly. I don't mind the moderating, but the looking down on others. Jeez. "}, {"comment_id": "e42sihz", "post_id": "96rwhs", "comment": "All the fstopper/petapixel/\\*rumors/blog advertorials should be put in a single catch-all thread instead.Let the genuine questions and conversations live by themselves."}, {"comment_id": "e42tki1", "post_id": "96rwhs", "comment": "Pretty sure petapixel is automoderated, fyi \n\nLensrentals on the other hand tends to have some pretty stellar content, as well as commentary from Roger from time to time"}, {"comment_id": "e42r2un", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e42z291", "post_id": "96rwhs", "comment": "I thought I was the only one who ran into this clown.\n\n/u/gimpwiz kick this guy out"}, {"comment_id": "e42tajw", "post_id": "96rwhs", "comment": "a"}, {"comment_id": "e43ol4n", "post_id": "96rwhs", "comment": "Wow. What a turd. This is the kind of person I have encountered in the 'enthusiast' end of the industry. I wouldn't normally agree with demodding someone, but the power has definitely gone to his head. "}, {"comment_id": "e42ss62", "post_id": "96rwhs", "comment": "Holy shit. \"Your submission has been removed\" on overdrive"}, {"comment_id": "e431a7s", "post_id": "96rwhs", "comment": "What the fuck? I saw all of those threads and loved them before they got removed. This is ridiculous. "}, {"comment_id": "e42rfd0", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e433nsh", "post_id": "96rwhs", "comment": "Yeah that guy is kind of (is) a dick."}, {"comment_id": "e440m36", "post_id": "96rwhs", "comment": "Just gonna leave my own personal run in with Quixote here: https://reddit.com/r/photography/comments/8nl1cr/50_person_group_shot_outdoors_highnoon_how_would/"}, {"comment_id": "e433atu", "post_id": "96rwhs", "comment": "Lol jesus christ"}, {"comment_id": "e42twq5", "post_id": "96rwhs", "comment": "He is an example of what a bad mod and is extremely heavy handed.   Following his history and personal experience, he seems to care more about keeping things in the one thread and showing off his power than having an open discussion about anything.  I guess there is your answer.  We did it reddit!  You can't have a live subreddit when he's deleting most of it.\n\n[Example](https://www.reddit.com/r/photography/comments/968m5f/is_iphone_x_basically_good_enough_to_print_on/e3yjz0j/?context=3) \n\n[Another example](https://www.reddit.com/r/photography/comments/960dta/this_is_rphotography_why_is_an_artists_work_being/)\n\n[Yet another example](https://www.reddit.com/r/photography/comments/95y8ak/can_anyone_help_me_identify_the_cause_ofand/e3wawmo/?context=3)"}, {"comment_id": "e4476wm", "post_id": "96rwhs", "comment": "Agreed.  He has removed posts of mine as well.  Then see a post of the same thing I asked posted the same day or later that week.  He also has an assholish undertone to everything."}, {"comment_id": "e42tp2g", "post_id": "96rwhs", "comment": "Yeah, it seems like he’s doing way too much policing for one person. \n\nRecognized your name from r/Austria... Are you in Vienna, or somewhere else? American in Salzburg here. "}, {"comment_id": "e43ghae", "post_id": "96rwhs", "comment": "I’m trying to fathom spending that much time in a day removing such benign and curious questions about photography. Smh this really highlights how much worse this sub is than I thought. How can anyone learn or hold a freaking discussion when the mods are this draconian. "}, {"comment_id": "e44uae0", "post_id": "96rwhs", "comment": "\"pitching a complete and utter endless shitfit of a tantrum after being politely told to \"please use the questions thread.\"\n\nThat's what he said to me.  I was having a lively argument with another user in the question thread about my question getting deleted on the main page.  We strongly disagreed with each other, but neither said anything spiteful.  Don Quixote took the time to interject for no reason other than to troll me because he didn't agree with my opinion.  Talking down to the community infuriates people and makes them hate you, and not want to participate in that community.  Why should we respect someone who makes personal attacks against the users he disagrees with.  "}, {"comment_id": "e4571dy", "post_id": "96rwhs", "comment": "Damn, talk about power tripping. "}, {"comment_id": "e42w9i7", "post_id": "96rwhs", "comment": "[removed]"}, {"comment_id": "e42zm25", "post_id": "96rwhs", "comment": "Feel the same way. Professional photographer here. Feel like this sub has become about arguing or promoting products. It’s a shame. Love to see what everyone is working on, getting advice and offering advice. "}, {"comment_id": "e436dt1", "post_id": "96rwhs", "comment": ">Love to see what everyone is working on\n\nThat type of content would be great as long as people don't half arse it and just post an imgur link. This would be genuinely interesting content and could easily spark some discussion for all levels of photographer to be interested in. \n\n"}, {"comment_id": "e42rksq", "post_id": "96rwhs", "comment": "I'll agree with OP. \n\nI want new threads when I open the sub in the morning. There's deadwood hanging out for 3-4 days at a time. Yes, new gear is coming, that should be up there for a day and then get pushed down. On reddit I don't recheck posts that I've already read. The top 10 comments stay the same and the rest ends up as bickering or snark. \n\nKeep it fresh. "}, {"comment_id": "e433ts7", "post_id": "96rwhs", "comment": "I haven't been here long.\n\nI'm going to ASSUME that if the mods created a periodic \"ask questions thread\" there was probably a problem with the alternative (free-for-all questions).\n\nMy recommendations are:\n\n* If you can figure out a way of having free-for-all questions while avoiding whatever problems the mods were trying to deal with, then I would _guess_ the mods would be amenable to changing.\n\n* If the mods don't want to change, start your own subreddit and tell us about it."}, {"comment_id": "e439inu", "post_id": "96rwhs", "comment": "> I'm going to ASSUME that if the mods created a periodic \"ask questions thread\" there was probably a problem with the alternative (free-for-all questions).\n\nDing ding."}, {"comment_id": "e42vfv0", "post_id": "96rwhs", "comment": "I have to agree on the daily mega thread for questions, it's mostly what I come here for at the moment because that's where I find most of the interesting questions/answers happening. As someone who's still quite new to photography it's also the only thread at the moment where I actually feel comfortable asking something that's most likely very beginner material."}, {"comment_id": "e43czzn", "post_id": "96rwhs", "comment": "There's something new from Sony?"}, {"comment_id": "e42rnx9", "post_id": "96rwhs", "comment": "Reddit is like this as a whole, it discourages discussion in new threads in favour of \"stickied weekly posts\" (that nobody enters).\n\nThe other day I've posted in r/apple a gif of a screencap I took showing a feature I didn't knew existed.\n\nIt was removed for being \"gif/video only\", as rule number whatever forbids. I've messaged the mods saying, it wasn't a simple meme video, it was actually something interesting and insightful for the members, and the reply was: \"it was removed correctly. Post again as a self post\""}, {"comment_id": "e42r8qz", "post_id": "96rwhs", "comment": "r/askphotography is pretty good for questions. I have been amazed on how much time some people put on really helpful and insightful answers. "}, {"comment_id": "e42s5xx", "post_id": "96rwhs", "comment": "That's a pretty terrible sub for questions, especially due to the size of it.\n\nIt's great if I want to be the 800th person this week to ask which Canon I should get, but meaningful discussion is not existent. Questions are looking for a singular answer and usually nothing more."}, {"comment_id": "e42rphc", "post_id": "96rwhs", "comment": "No reason to not have those on a sub called photography"}, {"comment_id": "e43pxfa", "post_id": "96rwhs", "comment": "Yeah, although I would put some kind of rule limiting the \"gonna buy my first camera, suggestions?\" thread. Specially those threads where what I wrote is all the information they are providing."}, {"comment_id": "e43dm03", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e42vod5", "post_id": "96rwhs", "comment": "Its a shame but if you want actual quality content you've got to go places where people pay for it - good periodicals. \n\nThis is just a popular website for average people who want average content, nothing more. "}, {"comment_id": "e434259", "post_id": "96rwhs", "comment": "I love he General question threads. Short, sweet, and I get an answer in minutes. I mean honestly photography is a pretty broad thing maybe you’d like it better on a niche photography sub. "}, {"comment_id": "e437rgb", "post_id": "96rwhs", "comment": "This is a large and rapidly growing subreddit.  At close to 700,000 subscribers, moderation is important to keep trolls and spammers away, but the balance between community involvement and killing trolls and spammers is hard."}, {"comment_id": "e43oiwx", "post_id": "96rwhs", "comment": "Mostly a lurker here.  My thoughts on the whole situation:\n\nI'm surprised at how quickly mods were willing to open the questions floodgates.  If I were a (more) cynical person I'd say that this was an intentional effort to show us how quickly the sub goes to shit with unrestricted questions.  I've definitely seen an uptick in questions that really don't belong on the front page of the subreddit.\n\nDid anyone consider, yanno, an _intermediate step_?  I've felt like the \"submitting to r/photography\" notes has been too strongly worded for a while, especially with the \"When in doubt, post in the question thread only, without making a separate post.\"  I think a much more reasonable starting point would've been making the question megathread a gear question megathread.  Many shallow questions are gear related anyways.  Add \"basic technique\" to that and  you'd probably catch most of them.  Add a few examples of questions that belong and don't belong in the question megathread under the new policy and I think people would be less scared off.\n\nSide note: I keep on seeing people say that the vast vast majority of questions in the megathread get answered.  Yes, usually by three or four comments.  For some questions, that's appropriate.  What I think (what I hope?) most people who are complaining about things getting buried are actually complaining about are questions which could've prompted more substantial discussions getting the same 2-4 responses as \"should I upgrade from the 5d2 to the A7iii\".\n\n*Anyways*, **I don't consider \"too many questions put into the megathread\" to be the core of the problems with this sub**.  With 600k+ subscribers why couldn't we get more activity on the posts that remained?  I rarely saw much discussion on articles about the art side of photography when they get posted here.  The top post here is about Net Neutrality ffs.\n\nHere's an idea:\n\nPortfolio/image series critiques.\n\nFor the first full weekend of every month, you can post a (cohesive) set of 8-24 pictures.  Then people can give feedback, with an emphasis on the overall thematic content (and less \"you're backfocused here, you needed to stop down there, is your monitor calibrated?\").  I think this is closer to what people do in art schools.\n\nMaybe even have themed months: street, landscape, travel, whatever.  I don't have any firm belief that I picked the right time intervals/number of photos.\n\nBasically, I'm trying to find a niche not currently filled by r/pics, /r/itookapicture, or /r/photocritique, that's both unlikely to result in a ton of spam and also going to bring content to the sub that we don't currently have."}, {"comment_id": "e44f28f", "post_id": "96rwhs", "comment": ">  If I were a (more) cynical person I'd say that this was an intentional effort to show us how quickly the sub goes to shit with unrestricted questions.\n\nThat has indeed been done exactly for that reason before, and the sub did immediately (and predictably) turn into shit. The kind of shit it has turned into right now.\n\n> I think a much more reasonable starting point would've been making the question megathread a gear question megathread.\n\nExactly. I firmly believe (and hope it goes back to this, please god) that at the very least all the \"gear purchasing\" question are swiftly removed and asked to be moved to the questions thread. There's a million questions every day of the kind \"what's a good cheap camera for a beginner\" or variations of such. And it's not that these are \"bad\" questions that don't deserve to be answered, so to just \"let the voting taking care of it\" fixes nothing—the questions don't deserve to be \"downvoted\" as if they were crap/spam/etc. It's just that there's so many of these gear-purchasing questions, and they are by definition specific to the needs of *one specific person*, and also by definition not invitations to \"a discussion\", so they shouldn't be directly in the sub.\n\n**Mods, please, don't let this sub get flooded in these gear questions, I implore you.**"}, {"comment_id": "e442k74", "post_id": "96rwhs", "comment": ">  post a (cohesive) set of 8-24 pictures\n\nWe used to have an album thread; we're discussing bringing it back if you want to hop into /r/metaphotography and contribute! \n\nThe issue is that feedback is few and far between, a few users have been talking about policing it more strongly and it's something we're discussing "}, {"comment_id": "e436qwm", "post_id": "96rwhs", "comment": "I don't want to be that guy but the community has to share a lot of the blame on this one. any good advice given on this sub is quickly met with vitriol from people who seem to not have much experience and you quickly regret ever telling the cold hard truth, and if not, is quickly met by silence from the people taking the advice. a quick \"thanks\" goes a long way guys. it's the only reward there is, because at the end of the day you have to realise that giving our competition tips on how to compete with us is not really something we need to do."}, {"comment_id": "e44i2ej", "post_id": "96rwhs", "comment": ">it's the only reward there is, because at the end of the day you have to realise that giving our competition tips on how to compete with us is not really something we need to do.\n\nThe hell kind of attitude is this to have on improving someones grasp on a craft. This is akin to a metalsmith or a carpenter going 'oh well I'd love to help you improve your technique but you might price me out in 10 years so no dice kid'. "}, {"comment_id": "e42s9l7", "post_id": "96rwhs", "comment": "This is how I know you haven't been here for 6 or 7 years, or at least not been paying attention to the sub, cause if you were you would know **everyone** was complaining about all these general photography question posts so the mods started putting them in weekly threads.\n\nThen people were complaining that they weren't seeing any good content so the mods decided to allow some general questions posts again.\n\nThen **everyone was complaining** that there was way too much general crap question posts, so the mods moved everything back to weekly threads.\n\nAnd here we are now, the cycle continues again with your post complaining that there aren't any general questions posts anymore..\n\nYou just can't win. People will complain no matter what. \n"}, {"comment_id": "e42t1bl", "post_id": "96rwhs", "comment": "This is true. But if people complain about wanting something for months or more, we'll probably do it ... even if we've seen it go back and forth before."}, {"comment_id": "e42vk18", "post_id": "96rwhs", "comment": "This is true. \n\nI remember when reddit first introduced comments and the first comment was about an users complaining about *comments*. "}, {"comment_id": "e43p9sa", "post_id": "96rwhs", "comment": "Finding the right balance is like the eternal search for the perfect camera bag (shoo shoo, peak design fans). You'll never get there, but by god you're gonna keep trying"}, {"comment_id": "e432ipc", "post_id": "96rwhs", "comment": "I remember some of that, but I also believe in the possibility of a middle-ground."}, {"comment_id": "e42s1o2", "post_id": "96rwhs", "comment": "Why not put all the videos, blog post, etc in a weekly megathread? "}, {"comment_id": "e42soz0", "post_id": "96rwhs", "comment": "I was doing youtube roundups for a while but they never got much activity so I stopped putting in the time. \n\nWe've been discussing it on [metaphotography](https://www.reddit.com/r/metaphotography/comments/95wdt2/daily_threads/) too "}, {"comment_id": "e43owew", "post_id": "96rwhs", "comment": "If you did that, the sub would be barren."}, {"comment_id": "e43f2hk", "post_id": "96rwhs", "comment": "A lot of communities have this exact debate. These \"questions go here\" weekly megathreads are implemented in the first place because the new tab was probably a constant sea of the same noob questions. And worse than repetitive, they're often low effort. \"What camera should I buy? Thanks.\"\n\nI think it comes down to being a (possibly inadvertent) power struggle between the dedicated regulars of the community who have /r/photography on their bookmark bar or whatever, and the more casual visitors and subscribers. The former group  wants to weed out the crap so they don't have to sift through it looking for high-quality discussions, and that's an understandable desire. But I think as communities grow they have to decide who they'll cater to. Reddit has limits and you can't please everyone. At the end of the day, it's just a discussion board. But one thing that's worked for the community I moderate (which is different in that it's a support community, but the same principle could apply,) is having a discord channel where the regulars hang out and talk about what they want, and the new tab is what it is. (Still subject to some moderate posting rules to keep things relatively substantive.) You create a new resource that scratches that itch for your most dedicated users, but it's very much connected to what you've already built.\n\nEdit: Aaand only after writing that did I check the sidebar to see the irc/slack links. Fair enough. I'm just talkin', don't mind me. "}, {"comment_id": "e43j0q3", "post_id": "96rwhs", "comment": "slack is oddly dead, I've never seen someone join that who actually wants to hang around and chat (other than the other mods)\n\nAnd the IRC is full of slack-ass idlers. (As IRC does) "}, {"comment_id": "e44e8x3", "post_id": "96rwhs", "comment": "I've hung around the IRC channel (and one of the Discords that was alive for a while) and it was either dead, or people were talking about stuff that had *nothing* to do with photography."}, {"comment_id": "e42rus2", "post_id": "96rwhs", "comment": "Hard agree - hands off moderation is great for allowing a fun and lively sub. There's a reason the kerbal space program sub has always been great - very light handed moderation. \n\nIf content is bad it'll get downvoted, the problem here is that there's so little content the front page is a bunch of YouTube links sitting at zero karma because nothing is pushing them down."}, {"comment_id": "e42sf85", "post_id": "96rwhs", "comment": "Notabug.io has no moderators, no censorship and no compulsory profile accounts. Everyone manages just fine, you've got antifascists, trumpeters, communists and neo-cons having a fine ol' time together without a moderator in sight."}, {"comment_id": "e42rzbg", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e42t2z1", "post_id": "96rwhs", "comment": "Yes, reddit is kinda worse than forums in most respects except that reddit is bigger than all the forums."}, {"comment_id": "e42toxi", "post_id": "96rwhs", "comment": "Agreed, to an extent.\n\n- Theres a lot of different photog related subs (ITAP, analog, pics, photocritique, etc), and its because of this diversification, that most content and active users has gone to other subs. This kind of kills any sort of \"pizzazz\" that this sub should. If I thought I took an awesome photo, and wanted to share it with photographers, why shouldnt I post it to r/photography instead of r/ITAP? ITAP IMO is almost becoming r/pics in terms of being more for people who want eye catching photography for the \"general person\" rather than photographer. Most of us are photographers here, and this sub should be dedicated to having the ability to share, discuss, nearly all things photography related.\n\n- To add to this, real discussion is indeed stifled here, and I dont believe its malicious at all, but rather following rules too stringently in an attempt to keep things more \"clean\" on this sub. \n\n- Yes the stupid questions thread does clean up A LOT of questions that would otherwise fill the sub. I dont think those questions should really go into the main part of this sub. \n\n- Yes, moderation is difficult.\n\n- I dont know what the fix is. But starting a conversation is the beginning. \n\n- Maybe try;\n - Removing \"community discussion thread\"\n - Improving the Wiki\n"}, {"comment_id": "e42ua01", "post_id": "96rwhs", "comment": "Without the Community Discussion Thread, it becomes hard to police self-promotion. There, a little bit of self-promotion is allowed, and you get to see others' work all in one place.\n\nBut without it, then you have people saying \"I took this great photo last weekend\" interspersed with real spammers trying to drive views to their content, further interspersed with questions which we are now allowing on the front page. It becomes too difficult of a judgment call for us moderators.\n\nWe may reconsider this, but for now we're changing only the question policy."}, {"comment_id": "e448k3z", "post_id": "96rwhs", "comment": "Last time this was attempted, the mods just decided to not delete any threads, even if they obviously needed to be in the questions thread, just so that they could say, \"See we told you so\".  Don't open the floodgates, but let some more water in at least."}, {"comment_id": "e449e15", "post_id": "96rwhs", "comment": "This time we're leaving the question thread open, and deleting spam. Last time we stopped deleting spam iirc.\n\nThis isn't opening the floodgates, believe me."}, {"comment_id": "e44k864", "post_id": "96rwhs", "comment": "Having flairs like 'beginner question' or something like that would be good"}, {"comment_id": "e44l5qb", "post_id": "96rwhs", "comment": "Not every method people access reddit has the ability to filter by flair (though they should), and who classifies what a thread's \"level\" is? "}, {"comment_id": "e45mkr6", "post_id": "96rwhs", "comment": "This sub has the same problem as any other hobby specific sub-reddit. There really just isn't that much to talk about that isn't new gear news. After a couple months the questions get very \"samey\". People don't want to explain what crop sensor equivalence is for the millionth time because it is incredibly simple. Then you have more specialized topics, but they only interest a small fraction of the people reading. Which pretty much leaves Youtube videos and blogs explaining why the latest gear is so much better than the \"most amazing gear ever\" you bought last year."}, {"comment_id": "e42uikh", "post_id": "96rwhs", "comment": "You are not alone. I'm baffled that posts with honest and good discussion can't stay up just because the same question was asked x years ago. Or even some months ago. Especially when its an interesting question for most, and not \"what camera should I buy\". The crowd is not the same, the landscape is not the same, so the answers probably are new. I mean, when is a discussion about culling, flagging and tagging photos not relevant for a photographer? I don't care what people did some months ago, or what the people that happened to stop by did then, I want a dynamic discussion what people are doing right now. "}, {"comment_id": "e44frw6", "post_id": "96rwhs", "comment": "I would agree in principle, but it would have to be threads created in the spirit of a discussion, not just self-interested.\n\nFor example, if someone asks \"How can I sort through my wedding images I shot last week in Lightroom?\" or whatever, then it's *not* an invitation to a discussion, it's one guy's specific needs requesting suggestions to solve his specific problem.\n\nBut if the thread is more like \"How to cull images in a large collection?\", then, a-ha, now we can have a discussion and people can suggest different approaches they've used for their circumstances, etc. And you are right, for that kind of thread, that there could be \"repeat\" threads after a while even if the subject was touched on a number of weeks/months before, to invide new fresh answers on a topic that affects many/all photographers.\n\nThe questions where someone is asking for a specific resolution to his personal self-interested specific needs ... those don't invite discussion by definition and, I believe, should be moved to a questions thread."}, {"comment_id": "e42sfsz", "post_id": "96rwhs", "comment": "[deleted]"}, {"comment_id": "e435290", "post_id": "96rwhs", "comment": "/r/AnalogCommunity is a much better place for discussing all things analog photography and I think that /r/analog should be left for pictures only. "}, {"comment_id": "e42vm9j", "post_id": "96rwhs", "comment": "I'd really like a comprehensive guide to taking better photos and editing them without taking all my time."}, {"comment_id": "e42wpyq", "post_id": "96rwhs", "comment": "A lot of people were just shitting on it (and the other half weren't, I guess) but if you want to shoot RAW but are pressed for time, the new Auto in LR 7.1 + the new profiles (7.3?) get edits done FAST. \n\nI use it for most of my family shit that I can't spend time editing. \n\n"}, {"comment_id": "e431m5s", "post_id": "96rwhs", "comment": "I think this sub should encourage posting more about your own photos.\nI don't want that people have to justify themselves saying like \"shameless plug\", or acting like they're sorry by promotig themselves sharing their photos.\nPost your own photos should be almost required in a sub like r/photography.\n(Is there a way to add clickable links to someone username?)\nIf not, what are we talking about all day here?\n"}, {"comment_id": "e436pju", "post_id": "96rwhs", "comment": "with 600k people it will become /r/pics \n\nI'm very much all for people posting about projects and such but having a ton of random imgur links and sob stories would make me instantly run as far away as possible. "}, {"comment_id": "e43785v", "post_id": "96rwhs", "comment": "You can just type /u/andcore and reddit's markdown (or whatever the hell it's called now) will automatically link it (and notify them) \n\nre: people posting their own photos....this sub would have 0 discussion very fast. It's something we are talking about but will likely lead to disaster. "}, {"comment_id": "e436vys", "post_id": "96rwhs", "comment": "> I think this sub should encourage posting more about your own photos.\n\nWe have the Community Thread for that. There's also /r/photographs and /r/itookapicture. "}, {"comment_id": "e439c4o", "post_id": "96rwhs", "comment": "I hate hate hate talking about gear. As a creative person, photography was my #1 medium, but after several years of photojournalism, I just dreaded going into public with a camera, because it would be an onslaught of dudes explaining to me the newest, latest gear I could never afford. I always had a modest setup, and when people ask \"what are you shooting with,\" I'd say \"doesn't matter.\" Yes, I know it matters, which is why I have the best that I can comfortably afford, but *seeing* matters more. "}, {"comment_id": "e44mmds", "post_id": "96rwhs", "comment": "We need more posts by people like you. Where are those posts? WHERE?!\n\n;)"}, {"comment_id": "e43csgc", "post_id": "96rwhs", "comment": "Where should we go if we're trying to find solid photography advice? Especially off we're new?"}, {"comment_id": "e43dzd6", "post_id": "96rwhs", "comment": "Normally I'd have said the questions thread; but now just go make a post! "}, {"comment_id": "e43khgz", "post_id": "96rwhs", "comment": "Yea I joined Reddit about a year ago and I was really surprised this subreddit was so inactive."}, {"comment_id": "e43twr2", "post_id": "96rwhs", "comment": "I once posted a vid of one of my lenses with a messed up focus ring, asked if anyone knew this issue and knew how to fix it... it got removed because it needed to be in the general discussion post, so dumb"}, {"comment_id": "e43xu1s", "post_id": "96rwhs", "comment": "> I joined this subreddit about 6-7 years ago, and I remember it being a great place to get honest, quick, and insightful answers to anything I wanted to know about photography, from technical gear related questions to discussions on inspiration and history. Now, you are liable to have those posts last about 20 minutes before a mod removes it and tells you to post it in the weekly \"general discussion\" thread - which, if we're being honest, is nothing more than a catch-all place for actual people with genuine questions so their posts don't dilute the subreddit's otherwise boilerplate posts about new gear and bloggers.\n\nThat is literally the exact thing that happened to me on two separate occasions recently. When I got into photography about 7 years ago I visited r/photography every day for discussions, help, and news. Now the content barely changes from day to day and the couple of times I have posted to try to start what I thought would be useful discussions, my posts have been removed within an hour or two. I genuinely do hope things can change for the better around here, and change soon."}, {"comment_id": "e443fx2", "post_id": "96rwhs", "comment": "I haven’t been here long but I really agree with this sentiment. I feel as though most forums and message boards (here as well as other subreddits and sites) are mostly gear related. And I totally understand the obsession. Gear is fun, it costs a lot and people will always want to know what they’re getting before they buy. But the truth is, all most all pros (especially art photogs) will tell you that if you want to be better, think more about photos and less about gear. I don’t know if I’ve ever seen discussions about exhibitions, photo books, or ideas about photography here.\n\nI read a pretty interesting quote from Emmet Gowin recently (in a great book called Photographs not Taken) that a think sums it up well. Recalling an interview, he writes:\n\n\n“I was asked if she could see my darkroom. ‘Of course,’ I said, ‘but wouldn’t you rather see my books? They might tell you more about me.’ “\n"}, {"comment_id": "e448v95", "post_id": "96rwhs", "comment": "I use this subreddit to lurk-n-learn, but I hardly ever find anything worth clicking on that doesn't feel like someone trying to sell their work or webpage"}, {"comment_id": "e449g03", "post_id": "96rwhs", "comment": "If you see self-promotion, please report it. We try very hard to verify that people aren't just trying to gather traffic."}, {"comment_id": "e44ckk8", "post_id": "96rwhs", "comment": "I started browsing here around the time I found ted Forbes first masterclass series or something, so I found a lot of relevant shit. Nowadays, I’d be far more interested in a contemporary art section of discussion, like what /r/fineartphoto tried to be. I had been working a bit to download and upload onto drive a my entire rubrics for some of the classes I did in my undergrad. This would mostly be readings and a kindve outline, some topics more technical and others a bit more theoretical. \n\nI’d be pretty happy to start working on something like this again and start posting it for people to use/discuss. Something else sort of related, I’ve tried to start streaming film reviews, which is largely in the interest of being able to have these discussions in general and exercise the vocabulary of looking at artwork/film. Anyhow, I’m not sure how many others would be familiar and interested with this sort of thing, but it seems to me something that a lot of other photographers could enjoy and learn something from. "}, {"comment_id": "e44gl2j", "post_id": "96rwhs", "comment": "I'm glad to see this change.\n\nIt'll be worth posting in this sub again. "}, {"comment_id": "e44hfpx", "post_id": "96rwhs", "comment": "Could links to other camera and photography subreddits be added to the sidebar?  If people have Pentax specific questions they'll do better asking at /r/Pentax than here.  I can think of a dozen or so more specific subs to list.  Sidebar links would help people find places where they're more likely to get useful help and keep their posts from cluttering up the regular forum.  Assuming people read the sidebar, which no one does, but still, links to other subreddits would be good."}, {"comment_id": "e44la8o", "post_id": "96rwhs", "comment": "> I can think of a dozen or so more specific subs to list. \n\nWe used to have a pretty crushing limit on sidebar characters, I'm not sure that's still the case (/u/gimpwiz? /u/anonymoooooooose) \n\nAnd yeah, lots of methods of accessing reddit don't include the sidebar anyway. "}, {"comment_id": "e45ne18", "post_id": "96rwhs", "comment": "Your post is 20x as long as most of the posts that get removed. If there was no rule to remove low effort questions this post would have never made it to the front page and few would have seen it or commented. It would be lost in a sea of \"new photographer what camera to get\" posts. The sub is always changing and striving to improve. I hope some compromise will work out with the new changes, the questions rule wasn't added without reason originally. "}, {"comment_id": "e461usy", "post_id": "96rwhs", "comment": "Someone makes this post every few months, and no real changes ever happen. This place used to be great, but now I don't even visit because every time I have a question it gets removed and then not even anwered 3/4 of the time when I inevitably post it in the general questions thread. The mods really went out of control with this subreddit. \n\n"}, {"comment_id": "e42tvun", "post_id": "96rwhs", "comment": "There used to be an attempt at an annual photo comp, some years better organised than others. \n\nI lost heart when a video of two cunts critiquing all the posts over a few glasses of wine got stickied by the mods.  "}, {"comment_id": "e447ujo", "post_id": "96rwhs", "comment": "The problem with the megathreads for Q&A are they are useless... In all subreddits.\n\nI understand the point of them; a single centralised places for small q's and a's, but realistically very few people will go through the thread hoping to answer some poor guys or girls question.. personally I simply don't have enough time to and it's kind of a boring activity.\n\nWhen I'm browsing and I see a single post/question I am more likely to think \"I know the answer to that, I'll respond\", which will generate conversation.\n\nIf I just see megathreads I would rather spend my time on the toilet browsing /r/funny"}, {"comment_id": "e44c0wb", "post_id": "96rwhs", "comment": "> realistically very few people will go through the thread hoping to answer some poor guys or girls question\n\nI understand that it's not a fun activity for some, but you should go check the megathread out at least once. You'll be surprised at how few questions go unanswered. The questions-to-answers ratio is estimated to be at about 90%, which is quite good.\n\n>  I simply don't have enough time to and it's kind of a boring activity.\n\nThat's fair.  Answering the gear questions isn't for everyone, and I'll admit it's something I don't do often either. I skim it occasionally, mostly to look for Pentax questions.\n\n> I'm browsing and I see a single post/question I am more likely to think \"I know the answer to that, I'll respond\", which will generate conversation.\n\nSee, that's where we differ. For me, it's more work to search individual posts in search of questions I might be able to answer, click the expando feature, read the post, decide whether to click through to access the reply box. Whereas the questions are lumped into the megathread. There's less clicking through. It's psychologically neater and easier (for me, anyway). I can even use Ctl-F to find posts using certain words like Pentax. For me, I very much prefer to have all the gear posts contained in one thread. \n\nAnd by shuffling all the gear posts into a megathread, it's easier to find the interesting discussions in the general sub. Yes, that has been thin lately. But that's not the mods' fault. It's on us, the community, to create them."}, {"comment_id": "e4488o5", "post_id": "96rwhs", "comment": "I can answer as one who regularly answers questions in the megapost - it's sorted by new, so it's easy to see the new stuff. I check for unanswered - also easy to see. I glance at the remainder to see if my input is needed.\n\nIt doesn't take too much of my time."}, {"comment_id": "e433wg4", "post_id": "96rwhs", "comment": "I hate general discussion threads...never once got an answer on any question threads on any sub. Hate them."}, {"comment_id": "e4374pz", "post_id": "96rwhs", "comment": "Surely you've never tried ours.\n\nWe sort by new, we have regulars (including me) who go and read every single question, and we even have a bot that reposts questions that get no responses."}, {"comment_id": "e437b3u", "post_id": "96rwhs", "comment": "> never once got an answer on any question threads on any sub\n\nDid you try ours? Worked pretty well "}, {"comment_id": "e8pvv6e", "post_id": "9sma9q", "comment": "No flip out screen?! Are you kidding me? "}, {"comment_id": "e8pw6i8", "post_id": "9sma9q", "comment": "If it doesn't have dual card slots I don't want it."}, {"comment_id": "e8q9r0o", "post_id": "9sma9q", "comment": "Looks like it has IBIS though"}, {"comment_id": "e8q58i3", "post_id": "9sma9q", "comment": "At least no one put him on a tripod ..."}, {"comment_id": "e8rzptn", "post_id": "9sma9q", "comment": "No one's flipping out about the blackface!? Are you kidding me? "}, {"comment_id": "e8pui7l", "post_id": "9sma9q", "comment": "Seems awkward getting through doors in that big DSLR!  \n(Should have gone with a mirrorless.)  \n(*runs away*)"}, {"comment_id": "e8pup29", "post_id": "9sma9q", "comment": "I use mirrorless, you made me laugh."}, {"comment_id": "e8q412j", "post_id": "9sma9q", "comment": "I see no viewfinder!"}, {"comment_id": "e8px1co", "post_id": "9sma9q", "comment": "That was the before picture. Here's the after picture:\n\n> [This guy was really popular at the party and [completely wiped out at the end of the night.](https://i.imgur.com/ppXJ0wA.png)](https://www.reddit.com/r/interestingasfuck/comments/9sjz91/dslr_camera_costume_that_works_as_it_should/e8peak2/)"}, {"comment_id": "e8q6c8c", "post_id": "9sma9q", "comment": "Hes doing a nighttime long exposure."}, {"comment_id": "e8pw2di", "post_id": "9sma9q", "comment": "I AM NOT STARING AT YOU. I AM A CYBORG PHOTOGRAPHER."}, {"comment_id": "e8qscm0", "post_id": "9sma9q", "comment": "I was hoping someone would reference that. You get an up vote. "}, {"comment_id": "e8pwob2", "post_id": "9sma9q", "comment": "Yeah but how many megapickles?"}, {"comment_id": "e8pzymc", "post_id": "9sma9q", "comment": "Just one small pickle "}, {"comment_id": "e8q30yn", "post_id": "9sma9q", "comment": "Ok this is legit awesome. It's actually a functional costume. The photos are real and uploaded to his twitter: https://twitter.com/cameraaman\n\nI wonder where's the actual camera. Maybe there's a DLSR hiding in the actual lens?"}, {"comment_id": "e8q9au5", "post_id": "9sma9q", "comment": "You can see in some of the picks that it is embedded in the lens of the costume.\n"}, {"comment_id": "e8pti36", "post_id": "9sma9q", "comment": "This is super cool!"}, {"comment_id": "e8qa2z4", "post_id": "9sma9q", "comment": "Next year costume goals. Anyone have an idea of how to build this? That display is huge... what is it? "}, {"comment_id": "e8qkd5y", "post_id": "9sma9q", "comment": "Some sort of small TV hooked in to the display out on the camera"}, {"comment_id": "e8r27oe", "post_id": "9sma9q", "comment": "If you imitate this kind of costume, try skipping the blackface. Even painting your face silver to integrate with the flash would be better than that. (Remember last week when NBC fired that newscaster after she said that back when she was a kid blackface costumes were OK, if you were dressing as a character?)\n\nOther than that, it's a great idea. How you and your equipment look, and how you present yourself in general, is super-important to what pictures you can take of people. (And having an excuse to mount a large softbox style flash above yourself if neat too.)"}, {"comment_id": "e8pyri8", "post_id": "9sma9q", "comment": "Cannot believe he used a flash instead of bumping up the ISO. This might be a fake photog. Huh kids these days!!"}, {"comment_id": "e8q15i2", "post_id": "9sma9q", "comment": "On-camera flash as well. Total noob."}, {"comment_id": "e8qi5a6", "post_id": "9sma9q", "comment": "If anything flash would be a more classic move. "}, {"comment_id": "e8q0w2t", "post_id": "9sma9q", "comment": "Only ONE card slot??\n\nNot professional. "}, {"comment_id": "e8put5v", "post_id": "9sma9q", "comment": "That is so cool!!! What a brilliant idea."}, {"comment_id": "e8q8p80", "post_id": "9sma9q", "comment": "So like trying to weed through all the \"hehe racism\" crap is no one else impressed with how well this guy actually worked that flash?? I mean go check out some of the results, for being a giant unweildy camera and a flash in hand he rocked that shit overall. This is pretty damn cool"}, {"comment_id": "e8qvfou", "post_id": "9sma9q", "comment": "The fact that his costume actually works is so awesome!\n\nEdit: the \"blackface\" comments in every thread this costume is posted in is fucking hilarious."}, {"comment_id": "e8qguf7", "post_id": "9sma9q", "comment": "[removed]"}, {"comment_id": "e8qp3jj", "post_id": "9sma9q", "comment": "Didn't even bother to cover up their hands, so lazy "}, {"comment_id": "e8qtt6z", "post_id": "9sma9q", "comment": "He is shooting in JPEG I presume, smh"}, {"comment_id": "e8qvog0", "post_id": "9sma9q", "comment": "This needs to be used at weddings and other events. A walking photo \"booth\""}, {"comment_id": "e8pwrnr", "post_id": "9sma9q", "comment": "There is an old instrudables article on how to make this costume. "}, {"comment_id": "e8qy789", "post_id": "9sma9q", "comment": "[removed]"}, {"comment_id": "e8r59bo", "post_id": "9sma9q", "comment": "Ha!  I wanted to make the same joke."}, {"comment_id": "e8qbptv", "post_id": "9sma9q", "comment": "Does anyone have any idea how heavy that costume would be? Lol"}, {"comment_id": "e8ql7n0", "post_id": "9sma9q", "comment": "Im thinking the heaviest part would be the batteries to power that huge screen."}, {"comment_id": "e8rfiu7", "post_id": "9sma9q", "comment": "u/stabbot"}, {"comment_id": "e8rfjcv", "post_id": "9sma9q", "comment": "\nI have stabilized the video for you: https://gfycat.com/UnfinishedGargantuanAntlion\n___\n^^[&nbsp;how&nbsp;to&nbsp;use](https://www.reddit.com/r/stabbot/comments/72irce/how_to_use_stabbot/)&nbsp;|&nbsp;[programmer](https://www.reddit.com/message/compose/?to=wotanii)&nbsp;|&nbsp;[source&nbsp;code](https://gitlab.com/juergens/stabbot)&nbsp;|&nbsp;/r/ImageStabilization/&nbsp;|&nbsp;for&nbsp;cropped&nbsp;results,&nbsp;use&nbsp;\\/u/stabbot_crop"}, {"comment_id": "egln8po", "post_id": "9sma9q", "comment": "Top 10 legal ways to wear black face"}, {"comment_id": "e8pz52g", "post_id": "9sma9q", "comment": "It looks like a Sony lol"}, {"comment_id": "e8ql2ej", "post_id": "9sma9q", "comment": "MAN! This is some next level shit."}, {"comment_id": "e8rj24h", "post_id": "9sma9q", "comment": "Where do I purchase this costume?"}, {"comment_id": "e8rr94y", "post_id": "9sma9q", "comment": "OMGGGGGGGGGGG"}, {"comment_id": "e90v4bv", "post_id": "9sma9q", "comment": "Now waiting for this to be posted on r/trashy because he did a blackface"}, {"comment_id": "e8qa92q", "post_id": "9sma9q", "comment": "r/madlads"}, {"comment_id": "e8qh8xz", "post_id": "9sma9q", "comment": "That's cool and all but does it have dual card slots?"}, {"comment_id": "e8rxrpc", "post_id": "9sma9q", "comment": "I think a morph suit would’ve been a better choice there. "}, {"comment_id": "e8q0ulj", "post_id": "9sma9q", "comment": "this is sick"}, {"comment_id": "e8pzbjn", "post_id": "9sma9q", "comment": "At least it has dual card slots"}, {"comment_id": "e8rfmq9", "post_id": "9sma9q", "comment": "Why didn’t he make his hands black, just his face? 🤔😒"}, {"comment_id": "e8q1skd", "post_id": "9sma9q", "comment": "[removed]"}, {"comment_id": "e8ptw7g", "post_id": "9sma9q", "comment": "Ah, Japan. One of the few places left that see no harm in blacking up. Even when dressing as a camera."}, {"comment_id": "e8puuu2", "post_id": "9sma9q", "comment": "So....I don’t see any harm in it? Are we meant to? Isn’t blackface only problematic when you’re emulating a person?"}, {"comment_id": "e8pw9yv", "post_id": "9sma9q", "comment": "> Ah, Japan. One of the few places left that see no harm in blacking up.\n\nBecause there is no harm here. This isn't blackface, it's camouflage. "}, {"comment_id": "e8pv26p", "post_id": "9sma9q", "comment": "You should read the definition of the word before saying something stupid."}, {"comment_id": "e8pvahz", "post_id": "9sma9q", "comment": "[deleted]"}, {"comment_id": "e8qbhdl", "post_id": "9sma9q", "comment": "[removed]"}, {"comment_id": "e8q3r72", "post_id": "9sma9q", "comment": "[deleted]"}, {"comment_id": "e8q4687", "post_id": "9sma9q", "comment": "I don’t think this is black face since it’s not about imitating the likeness of or mocking a black person. It’s just painting one’s face black. There is a difference. "}, {"comment_id": "e8q5m1b", "post_id": "9sma9q", "comment": "I assume this uses non-compact flash (NCF). "}, {"comment_id": "e8q012n", "post_id": "9sma9q", "comment": "The person filming it should be shot. "}, {"comment_id": "e8r12v8", "post_id": "9sma9q", "comment": "The camera probably got a shot of him after"}, {"comment_id": "e8puk69", "post_id": "9sma9q", "comment": "Blackface, racist."}, {"comment_id": "e8pv0hh", "post_id": "9sma9q", "comment": "Are you trolling?"}, {"comment_id": "e8q09a3", "post_id": "9sma9q", "comment": "It's BLACK, not a dark skin color. Don't be so fucking dense."}, {"comment_id": "e8pwlbr", "post_id": "9sma9q", "comment": "This might be the only time blackface is okay. "}, {"comment_id": "e8pysip", "post_id": "9sma9q", "comment": "[removed]"}, {"comment_id": "e8q0cgv", "post_id": "9sma9q", "comment": "It's literally black, not blackface. There is actually a difference, if you'd pull your head out of your ass.\n\nPlus, this is in Japan, where there isn't the history of minstrelsy. "}, {"comment_id": "e8pzifu", "post_id": "9sma9q", "comment": "https://i.imgur.com/Io3EDkS.jpg"}, {"comment_id": "e8q0gv4", "post_id": "9sma9q", "comment": "Welcome to /r/photography! This is a place to **politely** discuss the tools, technique and culture of the craft."}, {"comment_id": "ce00gt4", "post_id": "1spvc7", "comment": "the fact that you can 'out-money' somebody in court speaks volumes for the distortion in a legal system which has strayed so far from whatever idealist (albeit naive) principles were intended.\n\n\n"}, {"comment_id": "ce094ss", "post_id": "1spvc7", "comment": "[deleted]"}, {"comment_id": "ce05ky6", "post_id": "1spvc7", "comment": "Can someone explain to me why more money -> more lawyers equals better? I mean... a good lawyer should know the laws necessary for that specific case no? Or can more lawyers fill out more paper forms or does it simply mean that they can outsmart him because more lawyers know more loopholes and precedences?"}, {"comment_id": "ce026py", "post_id": "1spvc7", "comment": "e.g. the big banks out lawyering the federal government"}, {"comment_id": "ce0dm79", "post_id": "1spvc7", "comment": "Well, you see, money is speech so you just want to silence free speech.  What do you have against free speech?  Are you a commie?\n\n**Note:** Given Poe's Law, I'm obliged to state that this is sarcasm.  I'm not saying it's good sarcasm but just that I, in fact, do not think money is speech etc."}, {"comment_id": "ce02v28", "post_id": "1spvc7", "comment": "I hear it works in politics, too."}, {"comment_id": "ce01v62", "post_id": "1spvc7", "comment": "He was paid 350k for his work in 1997 and whatever this undisclosed settlement is."}, {"comment_id": "ce09lht", "post_id": "1spvc7", "comment": "Can there be any improvement in the current legal system? I mean, as it is little people are screwed, as you stated - system strayed from intended principles. "}, {"comment_id": "ce09ljd", "post_id": "1spvc7", "comment": "I just asked a similar question on [/r/askreddit](http://www.reddit.com/r/AskReddit/comments/1sqsxj/why_is_the_us_legal_system_so_expensive_how_can_a/), if anyone wants to answer in both places anyway . . "}, {"comment_id": "ce0eah5", "post_id": "1spvc7", "comment": "Precludes the possibility of justice and makes me wonder why any armed person would pay taxes."}, {"comment_id": "ce0so51", "post_id": "1spvc7", "comment": "This is because traditionally the law is really only supposed to used by rich people who have expensive disputes. The legal system tries to weigh a very difficult balance between being assessable to everyone and not over burdening the system. I see your point about how it's unfair that more money can easily out win the small guy but if it was different every person who ever bought an apple product would sue them. Not to mention companies like apple are constantly fighting legal battles against consumers. \n\nPeople already claim that there is too much litigation in the US. That is why the system favors wealthy litigants. They don't want to impede in the lives of two neighbors over how much the pig they sold to the other is really worth. They want more complex problems like the merger of two billion dollar companies fighting over buyout provisions of the old partners totaling more than 10 million dollars a partner.  "}, {"comment_id": "ce02jq1", "post_id": "1spvc7", "comment": "If anything, courts are more class-fair than they've ever been. Gideon v. Wainright, for example.  If you're suing a corporation with deep pockets and you have a good case, you'll have lawyers lining up to take that on contingency. "}, {"comment_id": "ce07xzu", "post_id": "1spvc7", "comment": "A friend of mine is trying to make a few bucks selling her photography. She had a prominent watermark on every picture which severely detracted from them. I talked her into removing it. I said copyright only meant anything if she was willing to pursue a theft in court. No way she had the money to do that so she removed the watermarks. Also, I said obscurity was worse than any potential thefts of her material.\n\nCopyright is a joke and only benefits the entrenched."}, {"comment_id": "ce03o68", "post_id": "1spvc7", "comment": "It sucks, but if it wasn't this method, there would be some other method (up to and including 'convenient accidents')"}, {"comment_id": "ce00cc7", "post_id": "1spvc7", "comment": "As A journalist, I applaud his persistence in defending himself. I know what it feels like to take a photo and have it used in nearly every major market without seeing a dime and it sucks. My situation was a lot different as I am not a strict freelancer and I don't feel cheated. I was paid my staff hourly wage.\n\nHe fought the good fight IMO."}, {"comment_id": "ce00gqr", "post_id": "1spvc7", "comment": "It resembles that Haiti photographer's AFP/Getty case where these companies have an army of lawyers and the money to drag it out. Mob mentality really. "}, {"comment_id": "ce07c5r", "post_id": "1spvc7", "comment": "Didn't necessarily do it well, though. You don't tell someone you're going to shit on them in public and expect them to watch it happen. He should have taken Ted's compliment and then revealed the issue to the world at the Peabodys."}, {"comment_id": "ce053vo", "post_id": "1spvc7", "comment": "One small point about the title of this post: It makes it seem like \"We can bankrupt him if he objects\" is a quote from Koppel or someone from ABC TV."}, {"comment_id": "ce09bfn", "post_id": "1spvc7", "comment": "As a journalist, he really should have been more clear about the source, when it was said and the context."}, {"comment_id": "ce0lgr7", "post_id": "1spvc7", "comment": "Hi there, I saw all the attention this post is getting and thank you very much.\n\nI'm doing an [AMA](http://www.reddit.com/r/photography/comments/1srvef/iama_nate_thayer_freelance_journalist_and_the/) in /r/photography if you'd like to take a look.\n\nThanks,\nNate"}, {"comment_id": "ce0ttuk", "post_id": "1spvc7", "comment": "You should also do this in /r/ama for greater exposure\n"}, {"comment_id": "ce0dgte", "post_id": "1spvc7", "comment": "Hey guys! I messaged Nate Thayer and he said he'd be totally down to do an AMA. Question to you, should I get him to post in /r/photography or /r/AMA ?"}, {"comment_id": "ce0f5df", "post_id": "1spvc7", "comment": "Good job! /r/AMA."}, {"comment_id": "ce0pfdz", "post_id": "1spvc7", "comment": "absolutely"}, {"comment_id": "ce0ttn0", "post_id": "1spvc7", "comment": "/r/ama and make sure to make a pre-ama post to /r/photography notifying of the impending ama."}, {"comment_id": "ce00x25", "post_id": "1spvc7", "comment": "God dammit. Ted Koppel came to our university for a talk back at the comm department. \n\nHad I known, my questions would have been much more interesting. "}, {"comment_id": "ce04ost", "post_id": "1spvc7", "comment": "Honestly, while your question(s) may have been far more interesting, it is very unlikely that his answer to said question would have been anything other than \"That's not something I can legally comment on at this time\".  And since most other people in attendence would be equally unaware of these events, they would likely all simply swallow that whole and accept it as valid."}, {"comment_id": "ce00srw", "post_id": "1spvc7", "comment": "The legal support for secrecy of settlements which I'm supposing is to encourage settlements is really short-sighted.  We should have a public policy that invitiates any secrecy clause, e.g. secrecy clauses are null and void at the outset.  The cost to society when secrecy is invoked may outweigh the perceived benefits of protracted litigation.  This case clearly shows how a deep pocket defendant can play the game of: so sue me, and we'll eventually settle in secret.  If their settlement could not, as a matter of public policy be secret, then they would realize they'd have the publicity of what they did and probably more litigation if their acts warranted it.  \n\nNot having secrecy may make corporation behave better.  Shame on Disney, ABC, & Ted Koppel."}, {"comment_id": "ce084vp", "post_id": "1spvc7", "comment": "[deleted]"}, {"comment_id": "ce02rk5", "post_id": "1spvc7", "comment": "What exactly is the cost of secrecy here? The only damage ABC caused was to Mr. Thayer, and Thayer is fully able to decide for himself what he wants in what is essentially a breach of contract case. There's very, very little public interest in a right to know about contract cases."}, {"comment_id": "ce08188", "post_id": "1spvc7", "comment": "This happens EVERY DAY. Had a friend in Rwanda, took some graphic photos, developed them herself, tried posting them on her website, got shut down within 7 hours, only to turn up on ABC within the week with their watermark on them. Her case was \"laughed out of court\" in spite of her having travel proof, and negatives, etc... That was direct , blatant piracy. THIS is Pol fucking Pot, and took 15 years, sir? Jesus. Good for you on speaking about this. I hope this breaks through. "}, {"comment_id": "ce01kfh", "post_id": "1spvc7", "comment": "I'd be curious to hear Koppel and ABC's side of the story. Considering how Thayer doesn't provide any evidence, or even exerts from the contract he claims to have signed I suspect it would be very different. And it would probably be supported by actual evidence."}, {"comment_id": "ce01pnf", "post_id": "1spvc7", "comment": "Well, he won his case. So there's not much reason to doubt he had a case here. Only it came with a gag order."}, {"comment_id": "ce01wf9", "post_id": "1spvc7", "comment": "This is what ABC said when his case was filed:\n\n>Despite the fact that ABC provided prominent and repeated credit and generous remuneration for his work, Mr. Thayer initiated a five-year barrage of complaints coupled with repeated demands for more money that culminate in this filing, in what is essentially a contract dispute. We find it unfortunate that Mr. Thayer and his lawyers have attempted to attack the good name of one of America's most respected news broadcasts as well as a journalist of impeccable reputation. We look forward to the opportunity to prove in court that Thayer's claims have no merit.'' "}, {"comment_id": "ce03bst", "post_id": "1spvc7", "comment": "Awesome! Thanks for sharing. And sorry to be that guy, but quoting what appears to be a direct statement in title is misleading--it is what Thayer wrote, but his text is a paraphrase of ABC's attitude. Again, though, thanks for sharing!"}, {"comment_id": "ce016jq", "post_id": "1spvc7", "comment": "Nice work not backing down!  I've learned about ABC's strategies this year via my own video which went viral courtesy of Reddit.  ABC's \"Good Morning America\" has excelled at making many Reddit videos go viral.  However, be careful when they ask to distribute your content to their affiliates for free... because that means all of ABC and the rest of the Empire.  All the networks play this game, though."}, {"comment_id": "ce02wuk", "post_id": "1spvc7", "comment": "We're you able to prevent that or secure proper payment?"}, {"comment_id": "ce03rst", "post_id": "1spvc7", "comment": "How did it turn out for you?"}, {"comment_id": "ce0hii3", "post_id": "1spvc7", "comment": "Is Ted Koppel still a thing?"}, {"comment_id": "ce02ml9", "post_id": "1spvc7", "comment": "Well, it sure is nice to feel a sense of moral outrage after reading just one side of the story, unsupported by any evidence whatsoever.\n"}, {"comment_id": "ce03w4g", "post_id": "1spvc7", "comment": "Yeah, except for the fact that the author won in court and all. And the countless other cases where major news organizations have stolen or refused to compensate authors for their work. \n\n"}, {"comment_id": "ce00uuo", "post_id": "1spvc7", "comment": "I'd like to read the documents, if any. Briefs from both sides might be available even if there was a settlement. I'm going to look for them and will post them here if I can find them.\n\nEven if it turns out he's the victim, he did freely agree not to talk about this in his settlement and is doing it anyway because he's not satisfied. Like everyone else he has the option to go to trial and make this all public and have a jury of his peers decide the outcome, but he choose to settle and is now breaking his word because he is still unsatisfied. \n\nedit: Decided not to pay PACER for the documents after reading [this article when the case was filed](http://natethayer.typepad.com/blog/2002/11/adages-marketing-the-news-the-selling-of-pol-potted-koppel-and-abc-in-lawsuit.html). Thayer was paid 350k for his work and his been paid again with the settlement of this suit. ABC's response when the suit was filed can be found in the link.\n\nIf anyone with free WestLaw access gets a hold of the complaints I'd still like to read them. \n\nedit2: Can't defeat the CORPORATIONS AND LEGAL SYSTEM R BAD circlejerk, apparently. "}, {"comment_id": "ce01kgl", "post_id": "1spvc7", "comment": "[deleted]"}, {"comment_id": "ce00xpv", "post_id": "1spvc7", "comment": ">  he did freely agree...\n\nHow free is free though when fighting a deep-pocket corporate organisation like this? How much money does a freelancer have to keep fighting this through court?\n\n"}, {"comment_id": "ce02e0y", "post_id": "1spvc7", "comment": "[deleted]"}, {"comment_id": "ce0mkwn", "post_id": "1spvc7", "comment": "Do you see what it's like when you are one person arguing with many? Even when you believe you're right you hesitate to respond. This was an exclusive story with pol pot, a person who the human race should hope to never see the likes of again, and in turn making this the last story of its kind, in the least, his lifetime. It's understandable that he's upset, and this was posted here not for you to argue about but to understand that it was him that spent his life bringing it to light, not ABC."}, {"comment_id": "ce041e4", "post_id": "1spvc7", "comment": "350k as a \"large sum\"? Is that a joke? You could sell a topless picture of Kim Kardashian for millions and yet the video and photographs depicting a major international event, that were front page news for weeks and circulated around the world are only worth 350k? "}, {"comment_id": "ce019yo", "post_id": "1spvc7", "comment": "Would he have done better going to a picture agency such as GettyImages? At least then he would have a corporation on \"his\" side, as Getty would fight for royalties. (Genuine question, I don't know)."}, {"comment_id": "ce03s0i", "post_id": "1spvc7", "comment": "No, they've been known to pull the same crap before:\n\nhttp://blog.ericgoldman.org/archives/2013/11/afp-v-morel-lawsuit-over-haiti-photos-taken-from-twittertwitpic-goes-to-trial.htm\n\n"}, {"comment_id": "ce0e8qa", "post_id": "1spvc7", "comment": "Hey OP, you can't win against the big =\\"}, {"comment_id": "ce0ejnm", "post_id": "1spvc7", "comment": "Isn't something like this what photo organizations like the ASMP are for? They fight the good fight."}, {"comment_id": "ce0i92y", "post_id": "1spvc7", "comment": "Not surprised, rich get richer and poor get poorer with no in between.\nThis attitude by corporations and rich will destroy their society some day."}, {"comment_id": "ce0mcef", "post_id": "1spvc7", "comment": "He's getting a lot of sympathy here because he is a photo journalist, but I am still skeptical of his account."}, {"comment_id": "ce0qna2", "post_id": "1spvc7", "comment": "You can ask him a question in AMA 11am EST"}, {"comment_id": "ce0cqfi", "post_id": "1spvc7", "comment": "[deleted]"}, {"comment_id": "ce0g4ze", "post_id": "1spvc7", "comment": "Because if ABC had stuck to the agreement he would have been able to sell the pictures and video to other outlets himself, making a hell of a lot more than $350k. And let's face it, $350k isn't really a lot of money for spending 15 years in malarial infested, heavily land mined jungle, hunting for one of the Twentieth century's most genocidal maniacs and getting the only footage of him for something like 20 years. \n\nYes, he wanted to speak out about ABC but he still had to pay his rent (in the US, not the jungles of Cambodia) and eat and all that, so step one was to secure the $350k they did agree to pay and then take them to court for the millions they stiffed him for. \n\nOh, and the reason he was even put up for a Peabody was because ABC has a whole department whose sole purpose is to apply for awards but they don't communicate very well with other departments so didn't know Thayer was beating on their ass and applied for one on his behalf as well. When he turned up at the award ceremony he was ejected despite having an invite and being the winner of an award because ABC was worried he would show them up. And he would have!"}, {"comment_id": "ce00nel", "post_id": "1spvc7", "comment": "I'm highly skeptical of this guy. Why would he tell Koppel his plan to make a scene at the awards?  Not that I wouldn't put it past ABC to do something like this, but it doesn't add up."}, {"comment_id": "ce00v99", "post_id": "1spvc7", "comment": "It's hard not to be skeptical sometimes. He is all over the the Internet fighting and talking, but that is the result of being on high alert for 15 years. He was accused of plagiarism at one point, but that was for a completely separate thing. "}, {"comment_id": "ce00oqm", "post_id": "1spvc7", "comment": "> Why would he tell Koppel his plan to make a scene at the awards?\n\nTo get this issue solved smoothly and quickly?"}, {"comment_id": "ce09e8g", "post_id": "1spvc7", "comment": "He should have gone to the awards event - it would be full of journalists and press industry folks, and spelled out the situation.\n\nLots of stuff ends up in court because someone may be in the right and at the same time be an impossible jerk who self-sabotages any hope of a smooth working relationship or resolution to disagreements.  I don't have enough information to say that's the case here, but it came to mind as a possibility."}, {"comment_id": "ce0anc8", "post_id": "1spvc7", "comment": "A lot of people are hotheads who threaten others without thinking through the fact that they just handed out an invitation for first strike."}, {"comment_id": "ce0cdwo", "post_id": "1spvc7", "comment": "Probably because he was pissed off, I dont think we can be perfectly rational all the time"}, {"comment_id": "ce03jn3", "post_id": "1spvc7", "comment": "Ted Koppel is a dick in real life btw. When I was younger my step dad and I did regular work around his home and I met him more than a few times. He was an absolute asshole. "}, {"comment_id": "ce0cq7r", "post_id": "1spvc7", "comment": "Can you elaborate?"}, {"comment_id": "ce0g8tn", "post_id": "1spvc7", "comment": "Great work. Now you should write a book about the ordeal, and self-publish it on Amazon as an ebook (so easy to self-publish and it's the only way you'll be able to sell it if Disney doesn't want you to). Use whatever objections they raise as controversy to sell more. Then you might recoup some of your money.\n\nGood luck!"}, {"comment_id": "ce0fg22", "post_id": "1spvc7", "comment": ">ABC America–owned by Disney–told Koppel to sign whatever Thayer asks for–our lawyers will deal with it later. He is just a freelancer. Give him whatever he wants. We can bankrupt him if he objects.\n\nHow does he know they said that?"}, {"comment_id": "ce0ik0e", "post_id": "1spvc7", "comment": "Unfortunately, this is how all big corporations work. For example, health insurance companies single out young and very ill people to deny claims that should be paid. There's a certain percentage that they just deny to be dicks, I forget what it is. But the reason they go for young and ill people specifically is that they are more likely to give up sooner. My very ill friend lost all of her money to lawyers trying to sue the insurance company into paying claims they were contractually obligated to pay. Fortunately, her father had a lot of money and stepped in to pay for lawyers when she went broke, and they won. But I have to say it did not help her get better any faster, and she had a ton of complications from the whole affair. "}, {"comment_id": "ce0kvu0", "post_id": "1spvc7", "comment": "Not sure how this will go down, but here goes: \n\nIf all of this is true, I say more power to the guy. I hope they take him to court and all of this comes out ruining their image. They deserve to be exposed. \n\nHowever, I would like to see the documents proving what he says. He's already going against a gag order so he should have no problem providing documents of the case if he's really interested in exposing the truth. "}, {"comment_id": "ce0ogl3", "post_id": "1spvc7", "comment": "Obviously ABC thought it was..... *EASY AS ONE,TWO,THREE*\n\n\nI'm sorry I'll leave now."}, {"comment_id": "ce0pfze", "post_id": "1spvc7", "comment": "The lesson: Don't sell any rights to your independent work to any large corporation, without understanding that they will bend the rules to violate your rights."}, {"comment_id": "ce0qkmj", "post_id": "1spvc7", "comment": "This story needs to be made into a movie. It strikes of that movie \"Flash of Genius\" where Robert Kearns would not give up until GM admitted they stole his invention. "}, {"comment_id": "ce0rk8q", "post_id": "1spvc7", "comment": "It sounds like this was a common practice with big news gathering organizations. During the week of the 50th anniversary of the Kennedy assassination, one of the news segments talking about the Zapruder film talked about CBS News asking Mike Wallace to obtain the film by any means necessary (including outright physical force), stating that their legal department would deal with the consequences later."}, {"comment_id": "ce0saho", "post_id": "1spvc7", "comment": ">I said “Fuck you! Where is my fucking money? I am going to go to the Peabody awards ceremony and refuse the award and tell the planet what unethical thieves ABC are and how you, Ted Koppel, acted as their pimp.” I was then banned from attending the award ceremony, escorted out of the Waldorf Astoria hotel banquet room by security guards.\n\nFuck dude... ;_;"}, {"comment_id": "ce0xa9w", "post_id": "1spvc7", "comment": "It's really sickening what ABC has done to you good sir. I applaud you for fighting all these long years. Here's too you getting every little bit of money back In court for all those years of unpaid use of your work. "}, {"comment_id": "ce10hd9", "post_id": "1spvc7", "comment": "Hi everybody. I am doing my AMA today for a couple hours at the link below.\n\nhttp://www.reddit.com/r/photography/comments/1st6nm/i_interviewed_pol_pot_of_the_khmer_rouge_and_i_am/"}, {"comment_id": "ce3rnhv", "post_id": "1spvc7", "comment": "And people wonder why I don't trust news sources. If they're dishonest to their news sources, they'll clearly be dishonest to their public."}, {"comment_id": "ce04ela", "post_id": "1spvc7", "comment": "This really needs to get more attention. I googled \"Nate Thayer ABC\" and there's very little out there other than this guy's blog. \n\nAnyway, [here](http://ajrarchive.org/Article.asp?id=2282)'s an article from 1997, when this all started, giving more info."}, {"comment_id": "ce09jcq", "post_id": "1spvc7", "comment": ">  Khmer Rouge agents smuggled Thayer and David McKaige, an Asiaworks cameraman, from Thailand to Cambodia.\n\nOh?  Well, who is this cameraman, then?  The guy who shot the video that Thayer refers to as stuff that he, himself, shot.\n\nThe article makes it sound like McKaige shot the video and Thayer shot stills, in addition to doing the writing.  But that's not what I got from Thayer's rant."}, {"comment_id": "ce0a8hg", "post_id": "1spvc7", "comment": "It is an unfortunate reality - money always speaks louder than truth. \n\nI can only hope that the journalist, Mr. Thayer, be recompensed in some way for his work, and that the perpetrators of this injustice, and all those like them, may be exposed for the parasites they are.\n"}, {"comment_id": "ce0ay9j", "post_id": "1spvc7", "comment": "Mr. Thayer admits violating a legal agreement by publishing the blog post we see here. Thus, he admits he is a dishonest person. I have neither respect nor sympathy for him."}, {"comment_id": "ce0bjgo", "post_id": "1spvc7", "comment": "Violating a agreement is, at most, a single dishonest act. That does not make one a dishonest person. "}, {"comment_id": "ce0nhxs", "post_id": "1spvc7", "comment": "I guess he's fighting fire with fire?"}, {"comment_id": "ce0nxtf", "post_id": "1spvc7", "comment": "Legal agreement =/= a morally correct one"}, {"comment_id": "ce0dle3", "post_id": "1spvc7", "comment": "He had to sign the legal agreement just to get what he was owed. His point is that he is not willing to be muzzled by corporate dicks and their attack lawyers and agreement be damned. Their behaviour needs to be exposed."}, {"comment_id": "ce0cent", "post_id": "1spvc7", "comment": "ad hominem"}, {"comment_id": "ce04ibv", "post_id": "1spvc7", "comment": "Is he overplaying the importance of this story? Yeah Pol Pot is one of history's disgusting men, but who really cared in America in 1997? I don't remember this story at all."}, {"comment_id": "ce05e5g", "post_id": "1spvc7", "comment": "This story went all over the world. I remember it pretty well. The first footage with Pol Pot."}, {"comment_id": "ce0646h", "post_id": "1spvc7", "comment": "Were you alive? It was a huge story. Probably actually a much bigger deal in the 70s/80s than when he finally died in the 90s, but still Pol pot was still one of the most demonized political figures in world history with quite a kill count to match his reputation."}, {"comment_id": "ce0rebw", "post_id": "1spvc7", "comment": "Its a bit like finding Hitler. Pol Pot didn't suicide, he just vanished. Look up \"The Killing Fields\" for more info about his regime."}, {"comment_id": "ce07g2f", "post_id": "1spvc7", "comment": "\"I was five years old at the time and *I* didn't really see what the big deal was, so obviously it wasn't *that* big a story.\""}, {"comment_id": "ce05gu8", "post_id": "1spvc7", "comment": "It's an interesting story (I guess), but it has a very short shelf life.  ABC paid for it because it's the kind of thing their viewers expect on a regular basis, not because it was earth-shattering.  ABC did not make untold millions off of this story, they kept people who would otherwise change the channel from doing so for one or two commercial breaks. \n\n"}, {"comment_id": "ce07k45", "post_id": "1spvc7", "comment": "tldr summary\n\nFreelance journalist who took first footage of former Khmer Rouge leader after 20 years had given ABC America exclusive rights to access for 7 days for North America only.  Says no stills etc. are to be taken.  ABC America flagrantly breaches this with stills, transcripts etc. going around the world.  After years ABC America finally agrees to pay freelance journalist providing he keeps quiet.  He didn't."}, {"comment_id": "ce06e0t", "post_id": "1spvc7", "comment": "This guy is a total moron. He appears to have absolutely no idea how the media works. He's very very lucky to have got 350K. He could've easily got nothing. "}, {"comment_id": "ce07hdj", "post_id": "1spvc7", "comment": "\"He's *so* lucky they only stole *x* - $350,000 from him instead of the whole *x*!\""}, {"comment_id": "ce03t13", "post_id": "1spvc7", "comment": "i wonder whats more importand to OP.  the money, or the credit?"}, {"comment_id": "ce07dzz", "post_id": "1spvc7", "comment": "Money comes & goes; your reputation is the only thing that sticks around."}, {"comment_id": "ce0652u", "post_id": "1spvc7", "comment": "We should come up with our own digital rights management system to prevent OTHERS from stealing OUR work. Oh, and making them sign agreements stating bajillions of dollars if they break their deal.\n\nLike here's the contract, \n\n\"If we fuck up, we owe you [insert number] Bajillion of dollars in compensation. No if's and's or but's.\""}, {"comment_id": "ce0dupo", "post_id": "1spvc7", "comment": "Before everyone jumps all over my dick about how Reddit is different people, let me just say I get that. I still find it funny that so many people sympathize with this guy even though a lot of people on Reddit seem to have no problem with copying 'intellectual property' like a photograph. Where are all the \"copying intellectual property isn't stealing and is totally okay\" apologists now?"}, {"comment_id": "ce0sx3b", "post_id": "1spvc7", "comment": "/r/Photography is not r/all, there are tons of posts in this subreddit about maintaining control of your intellectual property."}, {"comment_id": "ce05l1e", "post_id": "1spvc7", "comment": "This infuriates me. Good for him for standing up. I know it might come crashing down around him, but at least he won't just go quietly. I just hope his story gains traction."}, {"comment_id": "ce062tg", "post_id": "1spvc7", "comment": "As someone who gets sickened by this kind of shit. Public humiliation and beheading should be the norm again. Like, literally,heads should be rolling for thinking what ABC/Disney did was acceptable.\n\nGlad I was never a fan of either one. Disney Channel sucks. "}, {"comment_id": "ce07en7", "post_id": "1spvc7", "comment": "too far"}, {"comment_id": "ce067zn", "post_id": "1spvc7", "comment": "What a cry baby"}, {"comment_id": "ce04zu4", "post_id": "1spvc7", "comment": "ABC can just ruin this guys life and then put a gag order on him with no problem? There are laws to protect us for a reason. This is wrong. I'm going to support this guy because he's being HONEST. Whether I agree or not. I've got his back."}, {"comment_id": "ce072j4", "post_id": "1spvc7", "comment": "Wow! ABC TV, one of the largest media corporations is crooked and full of dicks? No one is surprised. Fuck them."}, {"comment_id": "ce07uo5", "post_id": "1spvc7", "comment": "7 years of bullshit in court, all the money spent on lawyers and taxes and by his own account, they 'sucked the life out of him'. Yes ABC and Koppel may have been cunts but this sounds like a Pyrrhic victory to me."}, {"comment_id": "ce08uiy", "post_id": "1spvc7", "comment": "He should seriously get a new theme for his blog though. "}]