[{"comment_id": "esi2o84", "post_id": "c7x8mm", "comment": "I don't really like their labelling it 'dissonance' *or* 'consonance'.\n\nLike a major 2nd has a more 'open' airy feel to it than does a minor 3rd; but this chart would imply the opposite.  \nI'd sooner say the majors are *more* consonant"}, {"comment_id": "esknsd4", "post_id": "c7x8mm", "comment": "The fourth is also a dissonance, depending on context."}, {"comment_id": "eslgw3i", "post_id": "c7x8mm", "comment": "Thank you!!"}, {"comment_id": "dllu5ae", "post_id": "6tltp7", "comment": "Looks very useful, subscribed!"}, {"comment_id": "dlm4nmr", "post_id": "6tltp7", "comment": "Rick's a great guy, his knowledge of music is vast and I feel like we're lucky he even gives the time of day to bestow is knowledge. The topics he talks about vary greatly but forewarning you need to have at least a basic understanding a theory to really follow along"}, {"comment_id": "dlmxcqw", "post_id": "6tltp7", "comment": "Rick is great. His recent Apple rant was a lot of fun."}, {"comment_id": "dln3fr1", "post_id": "6tltp7", "comment": "Wow, this looks awesome.  Thanks for sharing!"}, {"comment_id": "c2seu3a", "post_id": "lfux0", "comment": "I really want to add to that chart after \"Don't Stop\", then \"Believing\", then a line back to \"Don't Stop.\""}, {"comment_id": "c2sd2zv", "post_id": "lfux0", "comment": "This actually inspired me to start practicing again. \nThanks!!"}, {"comment_id": "c2scbj3", "post_id": "lfux0", "comment": "I like it because its true. :)"}, {"comment_id": "c2sdj6h", "post_id": "lfux0", "comment": "I wish... I have midterms in Political Ecology tomorrow. "}, {"comment_id": "c2sj581", "post_id": "lfux0", "comment": "This is Awesome because over the weekend i was playing out and some random person came up to me while I was taking a break and asked if he could play.  And went up there and knocked out some of the hardest stuff that I know. And it just made me want to practice more and be a better musician.\nLater I found out that he was actually a professional musician and had opened up for big name country stars and was just visiting the area."}, {"comment_id": "c0joyal", "post_id": "aw2o6", "comment": "[removed]"}, {"comment_id": "c0k3a29", "post_id": "aw2o6", "comment": "**THANK YOU!!!!**"}, {"comment_id": "c0jopak", "post_id": "aw2o6", "comment": "Awesome!"}, {"comment_id": "c0joxaj", "post_id": "aw2o6", "comment": "Thank you so much for this. This is so so great. I have singing experience but really want to take it to the next level, especially with my upper range. I'm a bass/baritone so this is just perfect.\n\nRock on."}, {"comment_id": "c0jp7hh", "post_id": "aw2o6", "comment": "You're amazing. Thanks for taking the time to put this together for us."}, {"comment_id": "c0jonu1", "post_id": "aw2o6", "comment": "\\m/ \\m/"}, {"comment_id": "c0jsta2", "post_id": "aw2o6", "comment": "Thank you so much! Demystifying the art of singing!!!!"}, {"comment_id": "c0kh3wg", "post_id": "aw2o6", "comment": "how much whiskey n smokes do i have to use to sound like tom waits"}, {"comment_id": "c409nyd", "post_id": "qt9wm", "comment": "Thanks to [this post](http://www.reddit.com/r/musictheory/comments/qrix5/in_all_my_years_of_trying_to_learn_music_theory/) for discovering this woman's material.  I just went through afterwards to separate all of her teaching videos and arrange them somewhat in order as one playlist."}, {"comment_id": "c40bq0l", "post_id": "qt9wm", "comment": "Thanks, this is really great."}, {"comment_id": "c41yzdd", "post_id": "qt9wm", "comment": "wow greath thx mate!"}, {"comment_id": "c45174r", "post_id": "qt9wm", "comment": "thanks so much"}, {"comment_id": "c40aeo4", "post_id": "qt9wm", "comment": "You rock! I really enjoyed the videos, but couldn't bear to slog through all the miscellaneous videos to find the relevant ones. Thanks, this is greatly appreciated. "}, {"comment_id": "c0jnsaa", "post_id": "avvp5", "comment": "I'm not a singer by any means but have a few questions for when I'm singing in my car:\n\nHow can I learn to sing in key consistently?\n\nWhere can I learn to expand my vocal range? Particularly when it comes to yeling/scream notes like you find in grunge bands from the 90's.\n\nWhat vocal techniques and exercises do you find to be the most useful? Links, books, or resources to learn said techniques?"}, {"comment_id": "c0jnua5", "post_id": "avvp5", "comment": "I am a musician, but not a singer.  I can hit pitches well, I know a few breathing exercises, and I can hear lots of harmony, but I hate the sound of my voice.  From what I've heard, you're pretty much stuck with your voice as far as tone goes, but are there any exercises to change it a bit?  Is this something that singers focus on the way a saxophonist might?"}, {"comment_id": "c0jnttu", "post_id": "avvp5", "comment": "How much do voice coaches charge to train someone?  On average.  What credentials should I look for?"}, {"comment_id": "c0jnt60", "post_id": "avvp5", "comment": "There are a few people who have asked about scream singing, so I'll just talk about it in a reply that is not to a single comment.\n\nMy training is in classical technique, so I'm not as well versed in such severe vocal affectations.\n\nThat being said, I believe the trick to getting good clarity and focus in screaming has to do with placement. Since vocal muscles are all intrinsic, visualization plays a large part in vocal technique. Imagine that the sound is coming out of a very forward placement, like the space between your teeth and lips."}, {"comment_id": "c0jpbus", "post_id": "avvp5", "comment": "2 questions...\r\nHow come somedays I can sing right along with a song and hit the notes. Some times I can't get it even close?\r\n\r\nFor instance, \"Fall to pieces\" Velvet Revolver.\r\nSometimes I hit the beginning and soemtimes just all over the place.\r\n\r\nAlso, how do I find my voice? \r\nWhen I sing along to a song, I seem adopt the singers style? Like the velvet revolver song... all throaty and if I sing to jackson Browne, all clean?\r\n\r\nWhenever I try to just sing, I feel I fall into a singers style, even if i try to go clean and let it go, it just comes off like a famous singer singing it. Like a crutch. Make sense?"}, {"comment_id": "c0jnryw", "post_id": "avvp5", "comment": "How do I became pop star? LOL\n\nOk, j/k\n\nFor real, is there anyway to improve my vocal range?  Is there any way to improve my \"shout-singing\" so that I can sing-scream better?"}, {"comment_id": "c0jnryt", "post_id": "avvp5", "comment": "I do death metal growls. What part of my vocal apparatus am I using? I can't find any reliable information on this online because there's so many different inconsistent explanations that I can't get a clear answer.\n\nSo...are false vocal chords even a thing and is that what does it?"}, {"comment_id": "c0jnsb5", "post_id": "avvp5", "comment": "What are the absolute basic things a person can practice daily to improve his/her voice?"}, {"comment_id": "c0jnsnz", "post_id": "avvp5", "comment": "I sing in a band, and lately I've been having a lot of trouble coming up with melodies. I think my problem is that I haven't properly familiarized myself with timing and staying in key. Are there any vocal exercises that will help me with this?"}, {"comment_id": "c0jntxt", "post_id": "avvp5", "comment": "I work parttime for my college as a piano accompanist for one of our voice teachers, and one day he mentioned something that I found really interesting. He said that voice was different than playing an instrument in that the age you start at doesn't have a strong impact on how good you can become. That is, someone who's studied voice from 10 years old to 20 years will be roughly as good as someone who studied from 20 to 30, whereas someone who studied piano (for example) from 10 to 20 will be significantly better than someone who studied from 20 to 30. In your experience, is that true? Do people progress at approximately the same rate regardless of their age?"}, {"comment_id": "c0jo4at", "post_id": "avvp5", "comment": "I have a slight nasally voice because I have a long nose ( assume) , but I have a pretty great ear, so I know when I'm singing well or not and in tune etc, but Is there anyway short of surgery or something, to have my singing voice lose some of it's \"nasal-ness\" ? "}, {"comment_id": "c0jo8xj", "post_id": "avvp5", "comment": "I don't wish to sing for a living. I am just a regular guy. I like to sing in the showers and along songs I listen to. The problem is: I suck at it. What can I do best to improve my pitch and range?\n\nI've noticed a few times, that when I think I am singing at a pitch (the way I hear myself), it's not the same pitch that's heard outside. I've also in fact noticed that when I listen to recordings of my own voice, I sound nothing like what I hear myself while talking.\n\nIs this common? And if it is how do I battle it?\n\nI am a musician and am really well ear-trained, so I have no problems distinguishing between notes and pitches.\n\nSo, what should I do to extend the range of pitches I can sing/make sounds in? And how do I precisely know what pitch I am at?"}, {"comment_id": "c0jnxeo", "post_id": "avvp5", "comment": "I used to be a really, really bad singer. The concept of singing in key was entirely unknown to me. Music just never came naturally to me. I've practiced a lot since then but I still feel it's hard to hit all the notes consistently. I can definitely hear when I'm off now, which is a huge improvement. What can I do to become better at this?  \n\nSecretly, being able to sing well is my biggest dream. I don't seek to become a star - not at all! I just want to be able to sing and record the songs that I love. I feel most of the songs are just way too high :( I don't understand how the singers manage to sing them while maintaining a \"full\" voice - mine just disappears into a whimper."}, {"comment_id": "c0jnuda", "post_id": "avvp5", "comment": "What are the absolute no-no's for singers as far as food and drink?"}, {"comment_id": "c0jnusq", "post_id": "avvp5", "comment": "Vibrato: How the fuck do you do that?! I can kinda make it so my voice wavers, but it's always very fast. How can I learn to control the speed/intensity of my vibrato?"}, {"comment_id": "c0jnvjq", "post_id": "avvp5", "comment": "how do i know if i'm staying on key?"}, {"comment_id": "c0jnwi2", "post_id": "avvp5", "comment": "I used to sing in musicals and I would consider myself to be decent, as in I would occasionally get a really small solo but otherwise I was chorus. The problem I had was that it would take me a hell of a long time to get warmed up to where I could really feel myself singing (as opposed to singing and needing to pay attention to my voice).\n\nWhat can I do to improve my warm up time? Is this just something that improves with practice?"}, {"comment_id": "c0jnzcw", "post_id": "avvp5", "comment": "Question about singing and smoking\n\nI used to smoke cigarettes on a pretty regular basis and as a result of this, I have lost some ability to sing the way I used to.  I have recently quit smoking and now I would like to know ways to make my vocal chords healthy again.\n\nalso, I realize very well may be a stupid question"}, {"comment_id": "c0jo1ea", "post_id": "avvp5", "comment": "I have a hard time singing when people around me are singing other parts.  For example, in choir when I was with the other basses I was find, but as soon as I was placed next to a tenor or alto it all went to hell.  I've learned music primarily by ear and have always gone by ear when it comes to singing.  Now I've had a decent amount of theory, band, choir, and have been playing music for about ten years now.  Any suggestions on how to deal with the automatic need to match the pitches around me?  "}, {"comment_id": "c0jo3cf", "post_id": "avvp5", "comment": "[deleted]"}, {"comment_id": "c0jo50q", "post_id": "avvp5", "comment": "Is falsetto considered \"cheating\" when singing your own or others' material? You don't hear a lot of it; is that because it isn't considered skillful singing, or because it is actually a skill that some do not have? My falsetto sounds better than my normal range, which is alright on its own. Should I keep working on my lower register to be taken seriously, or would it be in my best interests to keep it up with the falsetto?"}, {"comment_id": "c0jog6o", "post_id": "avvp5", "comment": "Whats your advice for staying in key?  Im a singer with a terrible problem of falling in and out of key "}, {"comment_id": "c0jojek", "post_id": "avvp5", "comment": "Some advices for actors who don't know a lot about their voices, please? "}, {"comment_id": "c0jols9", "post_id": "avvp5", "comment": "First of all, thank you so much for this thread.  Seriously, again just like most people here, I am an average dude with silly little daydreams of doing duets with my favorite singers.  \n\nSince most of my other concerns have been answered here, I should ask, when going low to high, and high to low,  is it ok to go in to falsetto range, and how do I defeat that little...\"bump\" that makes it obvious that I;m going from my diaphragm to my throat?"}, {"comment_id": "c0mg68y", "post_id": "avvp5", "comment": "[deleted]"}, {"comment_id": "c0ovrpy", "post_id": "avvp5", "comment": "It's been a while since this was posted, but maybe you'll reply.  \n\nI have noticed that when I'm singing something (usually in chapel) I just try to copy what I hear other people singing (makes sense), but I end up sometimes singing in a really low voice and sometimes singing in a much higher voice, without any real consistency of which I would be using when. I can't switch between them in the middle of singing, only in big gaps like between songs or verses.  Can you offer your help here?"}, {"comment_id": "c4lyhqh", "post_id": "tdw3l", "comment": "This is really neat!\n\n::bookmarks::"}, {"comment_id": "c4lxz7c", "post_id": "tdw3l", "comment": "way useful.  passing it on to my other guitar friends"}, {"comment_id": "c4lt65d", "post_id": "tdw3l", "comment": "Give this a repost over to /r/guitar and /r/musictheory great concept!"}, {"comment_id": "c4lww1o", "post_id": "tdw3l", "comment": "The UI feels kind of weird on my laptop, with the input box all the way in the far left corner. Maybe center all the text in the middle and put the input box on top :p"}, {"comment_id": "c4mhlbx", "post_id": "tdw3l", "comment": "I'm glad you guys like it!"}, {"comment_id": "dz1j9wy", "post_id": "8joknp", "comment": "Nice!  I made one too, but mine's playable, not just an image:\n\nhttp://www.offtonic.com/theory/applets/circleoffifths.html\n\nThere's more playable stuff at [http://www.offtonic.com/theory](www.offtonic.com/theory) if you want to check it out."}, {"comment_id": "dz1katq", "post_id": "8joknp", "comment": "Dope"}, {"comment_id": "c2l4e2h", "post_id": "kkx4s", "comment": "Good share. Thank you. : )"}, {"comment_id": "c2l7iu0", "post_id": "kkx4s", "comment": "This is great! You have a good teaching style. I'm looking forward to more. Thanks for posting."}, {"comment_id": "c2l2vgi", "post_id": "kkx4s", "comment": "There's also a [part two](https://www.youtube.com/watch?v=3tbK2jtVRM8&feature=related) introducing seventh chords."}, {"comment_id": "c2l82om", "post_id": "kkx4s", "comment": "This is really good! Is this you?"}, {"comment_id": "c2qb7qp", "post_id": "kkx4s", "comment": "DUDE thank you so much. This is exactly what I needed. (I taught myself piano/keyboard.)\n\nI dont know jack. Like reading... or anything. Took lessons for like a week. Like 17 years ago.  So this stuff really helped out with basics. (i usually just sound things out)"}, {"comment_id": "c2s3b23", "post_id": "kkx4s", "comment": "this is great, but he kinda sounds like he's out of breath."}, {"comment_id": "dl0twbf", "post_id": "6qvikt", "comment": "Neat!"}, {"comment_id": "dl2396u", "post_id": "6qvikt", "comment": "dis is my fast reference tool on anything!"}, {"comment_id": "c0zibcl", "post_id": "ddrba", "comment": "I have heard it said, \"Amateurs practice until they can get it right. Professionals practice until they *can't* get it wrong.\""}, {"comment_id": "c0zg892", "post_id": "ddrba", "comment": "Then, after you master it, you play it a few dozen times.  A year or so goes by, you try to play it again and forget everything."}, {"comment_id": "c0zhq4r", "post_id": "ddrba", "comment": "I was a music major and there were two tips that my teacher gave me about practicing that really helped.  I will save you the money and share them now.  :)  (Keep in mind I played woodwinds, some of this would help with piano I guess as well.)\n\n1) When you have a tough fingering passage, play it as if the first note had a dot.  Then reverse it.\n\n2) When you practice a tough spot set the temp a couple of clicks higher than the tempo of the piece.  Practice like that for a while.  When you back off the temp to the true speed of the piece, it's easy and you can usually play it more accurately since you're used to playing it faster than tempo.\n\nShe always said that when you're to the point where this would help, your fingers already know what to do.  Music at that point is really just a head game and tricking your mind into doing it.  :)  Worked well for me."}, {"comment_id": "c0zlu0e", "post_id": "ddrba", "comment": "There is also a difference between playing an instrument and knowing HOW to play that instrument. For example I am classically trained and i can play the piano, you put a fully written piece in front of me and i can play it and perfect it but i never really learned how to play the piano. That is to say if you put a lead sheet in front of me (up until recently when i actually started learning how to play the piano) and tell me to play the song at the jam i would hand it back to you and say no thanks. But I could play a memorized solo piece like nobody's business... no room for improvisation though. \nI am starting to learn how to apply the theory i learned to the actual act of playing the piano. \nI don't know if that makes sense but it was a dawning realization for me about 3 years back that though i could play and i knew theory i didn't actually know how to put them together to actually play. \nWhen you know this the difference between classically trained and jazz trained musicians becomes apparent even more so. €"}, {"comment_id": "c0zi12f", "post_id": "ddrba", "comment": "I have recently found the \"record yourself\" option is the most direct way of learning that I don't indeed play a song perfectly or how it sounds on the radio. Holy smokes, a song I have been playing for 20 years and the rhythm is awful.\n\nTime to break out the metronome and really focus. Thanks for the suggestions."}, {"comment_id": "c0zrbi0", "post_id": "ddrba", "comment": "Just  something to add:\n\nA great way to work on the harder parts of a song is to photocopy the difficult sections, cut out just the parts that are difficult and compile them in to a notebook. If you spend practice entire sessions working on the parts you have compiled in your handy notebook you will make much more progress at mastering them than if you are distracted by entire scores. \n\nAlso, I disagree with your last statement. You cannot master the piano without spending hours and hours at the piano. The pianist who has his \"perfect practice routine\" and is finished in under an hour cannot compare to the results you get from practice, even if it is a bit less focused, for a long time. "}, {"comment_id": "c0zg4pv", "post_id": "ddrba", "comment": "cool, thank you. I'll try"}, {"comment_id": "c0zge3d", "post_id": "ddrba", "comment": "This post is awesome, thank you!"}, {"comment_id": "c0zgwpj", "post_id": "ddrba", "comment": "Yeah, real practicing makes you awesome, but then after you can play the piece correctly, chances are you'll be sick of the song for awhile.  I know it happens to me. "}, {"comment_id": "c0zharo", "post_id": "ddrba", "comment": "Thank you for this! I've been slowly gravitating towards doing just this while I practice but it's nice to see it in written form. My practice right now basically consists of doing this for a chosen song, plus following practice exercises in the book \"Beginning Acoustic Guitar\" by Greg Horne. It seems to be working out quite well, actually."}, {"comment_id": "c0zhfge", "post_id": "ddrba", "comment": "When I was in school, I was a music minor simply because I liked playing my trumpet.  I was somewhat talented, had good tone, a good ear, good mechanics.  I hit a lot of plateaus with my performance and improvisation though when I started to pick up jazz and I'm sure that bad practicing habits were to blame.  I never finished my minor, graduating without one.  \n\n\nIf you want to be good at music, practice practice practice.  And not just the things you're good at.\n"}, {"comment_id": "c0znhy2", "post_id": "ddrba", "comment": "i may be an asshole but, this all seems fairly obvious to me?"}, {"comment_id": "e38zaxl", "post_id": "92vdtf", "comment": "Oh, I've always wanted to learn something from Han-Tyumi, the Confused Cyborg."}, {"comment_id": "e38q1wx", "post_id": "92vdtf", "comment": "Looks fun, subscribed"}, {"comment_id": "e39hze9", "post_id": "92vdtf", "comment": "This... this is something I have needed so badly in my life. Finally, I can stop all my other musician friends from laughing at me and my shit rhythm!"}, {"comment_id": "e3a5437", "post_id": "92vdtf", "comment": "This looks good, interested to see more. This part of learning music can be easily overlooked so I'm hopeful for a simple way to practice."}, {"comment_id": "e57pjp5", "post_id": "92vdtf", "comment": "Liked the intro. Shared it with some music trainer friends. Keep it up :)"}, {"comment_id": "c8u1pgp", "post_id": "1a4lfa", "comment": "Holy shit, I'm quite jealous myself"}, {"comment_id": "c8u2gqz", "post_id": "1a4lfa", "comment": "So gifted, hopefully he'd like to pursue music down the road!"}, {"comment_id": "c8u1sh0", "post_id": "1a4lfa", "comment": "ubernerd in the making right here...be proud"}, {"comment_id": "c8u79ou", "post_id": "1a4lfa", "comment": "...mind blown. How did you manage to teach them this?"}, {"comment_id": "c8u4str", "post_id": "1a4lfa", "comment": "what app are you using?"}, {"comment_id": "c8ugdub", "post_id": "1a4lfa", "comment": "As someone who has perfect pitch naturally it blows my mind whenever it blows other peoples' minds. I rarely use it unless I'm singing something, and, being a band nerd, I'm not usually singing."}, {"comment_id": "c8und1w", "post_id": "1a4lfa", "comment": "Funnily enough there is some evidence that perfect pitch is innate in humans. The rate of adults with it is much higher in places like china, where intonation of words is very imporant for its meaning. Sadly in english we lose all of that as our brains trim away that portion of hearing to save on energy. Im not saying its impossible to learn it, but it wont be easy\n\nSo teach them when they are young, and they may just keep that perfect pitch. "}, {"comment_id": "c8u6so7", "post_id": "1a4lfa", "comment": "It's like a super power. The Pitch Man."}, {"comment_id": "c6vgesm", "post_id": "12ip5z", "comment": "This is a good site.  It would be cool if it could remember me between sessions."}, {"comment_id": "c6vh3pi", "post_id": "12ip5z", "comment": "Id be cool if you had people in more places. Hopefully you get more attention."}, {"comment_id": "c6vipzr", "post_id": "12ip5z", "comment": "Cool site.  Sadly, most of the members seem to be focused on the east coast."}, {"comment_id": "c76bt8z", "post_id": "12ip5z", "comment": "Awesome site, I'll be spreading the love south of the equator :D"}, {"comment_id": "c0x22gk", "post_id": "d2401", "comment": "This site rocks incredibly hard.  Thanks broseph."}, {"comment_id": "c0wzt37", "post_id": "d2401", "comment": "An hour on this subreddit and I didn't see this site anywhere, I hope you guys find it useful."}, {"comment_id": "c0x1z59", "post_id": "d2401", "comment": "Thanks for the site!"}, {"comment_id": "c0wzuze", "post_id": "d2401", "comment": "Thanks for this link, I'm very interested in music theory. It's funny as my career is music has expanded I find the less and less I know about the BASICS of music theory such as beats, measures, and time signatures. It looks like I spent all my time on scales, intervals, chords, and harmony. \nI like how you can mouse over the examples and HEAR not just see what the author is trying to convey. \nGreat link, thanks."}, {"comment_id": "c0x0vol", "post_id": "d2401", "comment": "Great beginner info. thanks."}, {"comment_id": "c0x3z71", "post_id": "d2401", "comment": "Thanks a lot man. I used to know lot's of theory but due to not applying or using it enough it has gone over the years. "}, {"comment_id": "c0zdczv", "post_id": "d2401", "comment": "This is great. Thanks!"}, {"comment_id": "dppxr7o", "post_id": "7cfzio", "comment": "This is great thanks for sharing!"}, {"comment_id": "dpq5dlc", "post_id": "7cfzio", "comment": "Love it! "}, {"comment_id": "dt7r02w", "post_id": "7cfzio", "comment": "That was a great video, cheers for that! I also like his lesson on being able to [recognise chords on sheet music](https://www.youtube.com/watch?v=pFirOBQ1K5M); that is where I am currently stuck and it has helped immensely. "}, {"comment_id": "epdj23o", "post_id": "bukbbs", "comment": "congrats - keep at it and always remember to compare yourself to only yourself. As long as you're better than you from the day before then you're doing it right."}, {"comment_id": "epmex81", "post_id": "bukbbs", "comment": "Bonam fortunam!  :)  I'd seek a teacher to help guide you through the beginning."}, {"comment_id": "epdpicw", "post_id": "bukbbs", "comment": "Awesome! I started on the violin but then my bloody mother, in an effort to look important and wealthy, sent my ass to a boarding school with no music program so that was that:("}, {"comment_id": "epdv1sa", "post_id": "bukbbs", "comment": "Shouldn't you start learning on *second* violin?"}, {"comment_id": "c16qcgw", "post_id": "ealf5", "comment": "Also, not sure why this is on 'irish hip hop forums' but yeah, there you go I guess. "}, {"comment_id": "c16td4l", "post_id": "ealf5", "comment": "Awesome series."}, {"comment_id": "d5vg5ob", "post_id": "4v2myg", "comment": "I'll test it within the week. I play a bunch of stringed instruments but I'd like to try piano. \n\nSo I'll be back in a few days when I get my hands on a piano"}, {"comment_id": "d5w0qa1", "post_id": "4v2myg", "comment": "I'll give it a try, sure"}, {"comment_id": "d61sd4r", "post_id": "4v2myg", "comment": "I have never played keyboard before I started 2 days ago. I found your video in this thread and I am now playing the chords to my favorite songs. Thank you so much -- this is exactly what I was looking for! Practical advice so I can just start out learning songs I like. Every where else was starting at square 1 and trying to make me a classical pianist or something lol.\n\nGreat video!"}, {"comment_id": "d5d6mfy", "post_id": "4sugls", "comment": "It's a mnemonic, not a rhyme (nothing rhymes there) :D"}, {"comment_id": "d5cvwrw", "post_id": "4sugls", "comment": "This is brilliant! I've never learned theory and it's held me back quite a lot. I'll be watching your other videos :-)"}, {"comment_id": "d5czeyh", "post_id": "4sugls", "comment": "Most of this is very good.  The one thing that is factually incorrect is that lower pitched instruments use the bass clef and that higher pitched instruments use the treble clef.  There are exceptions: all saxophones, regardless of pitch, use the treble clef, as does the bass clarinet.\n\nTo be fussier, viola's a special case (it uses the much rarer alto clef) and the trombone, whilst most commonly using the bass clef, still has a lot of repertoire written in the tenor or alto clefs.\n\nOn the whole though, this is well explained.  I'm guessing you took some inspiration from Minute Physics or ASAP Science, but it works well - good job."}, {"comment_id": "d5dirgb", "post_id": "4sugls", "comment": "[deleted]"}, {"comment_id": "d5dnm3r", "post_id": "4sugls", "comment": "I really like the drawing and presentation style.  Also perfect pacing for beginners!  Well done. "}, {"comment_id": "d5idozs", "post_id": "4sugls", "comment": "This is perfect for beginners! I'm subscribing and hoping that someday you will post more intermediate/advanced-oriented videos"}, {"comment_id": "d9tnabh", "post_id": "4sugls", "comment": "You can't hide from me Artifexian!"}, {"comment_id": "cw0wfla", "post_id": "3ougxw", "comment": "[deleted]"}, {"comment_id": "c0jnwt1", "post_id": "avuyk", "comment": "This is your Brain on Music by Daniel Levitin is a great book.  It explains some basic music theory and, more interestingly, the science behind it, why music affects people emotionally. The author does a good job of explaining it so that anyone can understand.  "}, {"comment_id": "c0jozkd", "post_id": "avuyk", "comment": "I'll take a shot at explaining what is to *understand* a scale versus just memorizing it. The key idea in understanding what makes different scales unique is the placement of whole and half steps. Other people have gone over that concept in this thread, but I'll try and explain why it matters. If you play two notes a half step apart, it sounds dissonant, more dissonant than two notes a whole step apart. So, for example, the C major scale goes like this:\n\nC (W) D (W) E (H) F (W) G (W) A (W) B (H) C\n\nWhere I showed you the interval between each note. When people talk about major and minor scales, and even different modes of those, it's all essentially a question of where you put the whole and half steps. The half step intervals in a scale are where our attention is drawn. If you play through the C scale slowly, you'll hear that the E-F transition and the B-C transition stand out the most, in some sense. You could also try playing the C scale, but stopping on B, and you'll hear how it's sort of \"unfinished\", until you hit that last C. For an example of this in practice, play these two chords in a row:\n\nC-F-G\nC-E-G\n\nEven better, if you're on the piano, keep the C and G held down and just move the F to an E. This kind of sound is *extremely* common in music. It sounds very pleasing to us because it goes from C-F-G, a kind of weird chord, to C-E-G, a nice perfect C major triad, by way of a half step. You can get a similar (but different) effect by going from C-D-G to C-E-G. The destination is the same, but this time you took a *whole* step to get there. What if you take advantage of both half-step jumps in the C major scale at once? Play G-B-D-F (called a G7 chord), and then play G-C-E (see how it's still a C major chord, but the notes are in a different order?). See how that went from a kind of dissonant sounding chord to a nice, consonant chord that kind of sounds like \"home\"? In music, we call that a \"resolution\", or say that G7 \"resolves\" to C major. It sounds that way because there were two half-step changes in there: B to C and F to E.\n\nNow, the basic minor scale is a different arrangement of whole and half steps:\n\nA (W) B (H) C (W) D (W) E (H) F (W) G (W) A\n\nThe different placement of the half steps among the whole steps is really what characterizes this as the minor scale, rather than the major scale. It also means that you can't do the exact same things chord-wise as you did with the major scale, because now the half steps, the points of interest, are in different places. For example, if you try to replicate what we did with the G7 above, you'd now be going from E-G-B-D to E-A-C. However, if you look at all the different notes, now there are no half-step resolutions, so the resolution doesn't sound as \"strong\". Because of this, a common change to the minor scale is to make the G a G# instead, so now the scale looks like this:\n\nA (W) B (H) C (W) D (W) E (H) F (minor third) G# (H) A\n\nDon't worry too much about the reference to a minor third, that's just what you call the interval one half step bigger than a whole step. Now, the resolution is E-G#-B-D to E-A-C. However, now the half-step jumps are G# to A and B-C. Notice that the B-C is in a different place on the chord than the F-E was earlier. That's what gives this resolution its minor character rather than major.\n\nBasically, a lot of the \"understanding\" you're looking for will come from finding and exploiting half steps in scales (also a good way to think about writing melodies). In a more general sense, it's about using intervals. A lot of this will just come with lots of practice. Someone else described it as learning your scales to forget them, which is true. By now, I don't think of scales as a bunch of notes, I think of them as the intervals involved, plus some muscle memory. If you asked me to play, say, A major, I'd probably just whip it out based on muscle memory because I'd played it so many times. If you asked for something more arcane though, like Gb melodic minor, I wouldn't do it because I memorized the notes in Gb melodic minor, I would know the sequence of intervals that makes up *any* melodic minor scale, and then I would construct it based off of that. That's the kind of understanding you should strive towards."}, {"comment_id": "c0jnnvh", "post_id": "avuyk", "comment": "What specifically would you like to know?"}, {"comment_id": "c0jnn69", "post_id": "avuyk", "comment": "I'm interested in this too... been playing guitar for years, and relaying on my ears to jam... but I've never had a grasp of proper music theory"}, {"comment_id": "c0jnt5p", "post_id": "avuyk", "comment": "> Simplified theory\n\nIt sounds like you need to learn just that.\n\nStudy and and practice scales and chord theory. Primarily, learn the major and natural minor scales, and how to play them starting anywhere on the neck. Learn intervals and what intervals make up basic major and minor chords (root, major/minor third, fifth.) Listen and learn what all the intervals sound like so you can identify them and know what chords to try when you want to play along with a song. By learning these scales and chord theory, you'll have a basic understanding of why certain chords sound good together, and why others don't seem to work."}, {"comment_id": "c0jo7wz", "post_id": "avuyk", "comment": "Judging from your comments and replies, mitchelwb, it sounds like you have the proper approach to learning, in general.  Be patient and apply that to music.  Learn the notes and really study what other people put together.  You know the basic theories, see what you can come up with.  \n\n\nRemember: It's music, it's what sounds good!  \n\n\nWestern music is 8 notes to a scale, but there are 5 notes to a scale, 7 notes, 6 notes, etc.  There are MANY different ideas about what sounds good.  So many times I've listened to a piece and thought it pleasing then looked at how they did it, theoretically, and said \"WOW! This goes against all you're taught.\"\n\n\ntl;dr: want to understand Western music?  I IV V I.  done.  Want to **play** music?  Practice, practice, practice...and listen."}, {"comment_id": "c0jo7xi", "post_id": "avuyk", "comment": "[harmonic experience](http://www.amazon.com/Harmonic-Experience-Harmony-Natural-Expression/dp/0892815604/ref=pd_sim_b_2) is a great treatise on learning harmonic theory by directly experiencing it.  it starts with very simple exercises that allow to feel the differences in each tonal interval by singing along with a drone that holds the root.  before i even picked this book up i used to practice like this, just wanting to be a better backup singer, and can attest that the method works quite well.  if you stick with it you will quickly find yourself able to identify the types of chords you're hearing and learn how to harmonize within them.  but the book develops so much further than that, expanding in great detail on elaborate harmonic relationships.\n\nas a word of caution, it uses very ornate language, which can be off-putting for me sometimes.  it also incorporates some indian classical theory, which uses quarter-tone (as opposed to the western half-tone) intervals.  it might take a lot of patience to hear the minute \"cents\" between a quarter- and a half-tone, but that focus is rewarded by an even sharper ear.\n\nspeaking as an another autodidact with a passion for learning about music without a lot of rote memorization, it was one of the best books i've ever read."}, {"comment_id": "c0jnozt", "post_id": "avuyk", "comment": "Being able to listen to a song and find the notes without looking them up is a skill that you will develop over time. You are doing exactly what you need to do to achieve this. Just make sure when you are learning a new song that you are aware of the pitches while you play. Pay special attention to what each note sounds like. An exercise you could do, though it may sound silly, is to sit down and pick a note. Pluck it and sing along with it, do this ascending and descending the scale. Now pick another note and do the same. Try to keep each of these base pitches in mind. Challenge yourself by humming a pitch and then plucking the note you were trying to hum, see how many you can match correctly. Make sure you use a tuner to get as close to perfect pitch on your guitar as possible so you don't memorize the wrong pitches. And as a final tip turn down the radio in your car when you're traveling and just sing some scales! Hope some of this helps, I am a senior in high school, principal trumpet player, and music lover."}, {"comment_id": "c0jo804", "post_id": "avuyk", "comment": "There is already some great information in here, but I'd just like to point out something in particular that I've learned about music theory and music in general:  \n\nYou can read about it and have it explained to you time and time again, but unless you're actually practicing it, you won't ever get it to a useful degree.  There's a reason people study this stuff in class, at a college level, and that's because it's complicated, non-intuitive, and has a very hard learning curve before you get somewhere useful with theory knowledge.  \n\nSee, the point I'm trying to make is that anyone that's had a few years training can tell you their major scales/chords, but in order to really understand theory and be able to use it, you have to know these things forward and backward.  It's a matter of speed and accuracy, and the fact is that you just become more familiar with it the more you practice."}, {"comment_id": "c0jwcpg", "post_id": "avuyk", "comment": "Learning and memorizing theory only works if you apply it. Use it to gain confidence improvising. Write out charts for some of your favorite songs, then change the key.\nTo me, the most important thing I learned from reading music was to visualize the music separately from the instrument.\nhttp://www.jacmuse.com/artisticconcepts/newpage16.htm\nhttp://guitar.to/indexblack.htm\nLearning to feel and control the opposing gravity of Major and minor will allow you improvise effortlessly. Also learn everything, chords(arpeggios), scales, chord progressions on 1 string, this will show you the relationships.\nHere's a link to my blog, you might find some useful info\nhttp://gorehound1313.wordpress.com/"}, {"comment_id": "ek9hxzf", "post_id": "ba5kg9", "comment": "Great video. Thanks for sharing! "}, {"comment_id": "ek9j47s", "post_id": "ba5kg9", "comment": "Among the best music tutorials on Youtube."}, {"comment_id": "ek9s5en", "post_id": "ba5kg9", "comment": "Great video "}, {"comment_id": "ekabn3f", "post_id": "ba5kg9", "comment": "Are you afraid of being copyright struck like everyone else has been lately?"}, {"comment_id": "eabv744", "post_id": "9zsp9z", "comment": "exceptionally well made video. I would say that the theory is a bit glossed over- it would have been nice to cover the chords in more detail. Also, there's a section where someone is saying something like \"the G chord has tension that wants to be resolved by going back to the C\". I have slight nitpick with this. You might think to yourself, \"well, what is it about the G major chord that 'creates tension', that the C major chord does not? they're both major chords, what's the difference?\" and this is fair...\n\n*ACKSHUALLY*, there's not really anything with a G chord - or any major chord, really - that creates tension. Diminished chords and dominant seventh chords create tension because of their tritones. In the context of a major key, the dominant seventh chord rooted on V is interesting and commonly used because \n\n1. all of its pitches appear in the key of the I,\n\n2. it creates tension that can be resolved by going back to the I,\n\n3. it's less dissonant than a diminished chord.\n\nSo in the context of C Major, a G7 chord (G B D F) is entirely composed of pitches in C major and it creates tension because it contains a tritone (B and F), *and it wants to go to C chord* because B leads to C and F leads to E.\n\nPlay any dominant seventh chord and you hear this. C7 makes you want to hear an F. F7 makes you want to hear a Bb. and so on.\n\nI'd argue that an un-seventh'd major V chord only \"wants\" to precede a I because of your ear's expectations and experiences with western harmony/cadences.\n\n---\n\nedit: more elaboration on why 7 chords are great"}, {"comment_id": "eabpxin", "post_id": "9zsp9z", "comment": "I just thought this vid would be useful for anyone curious about how composers use and play with circle of fifths and key changes. Super fun vid regardless of skill level! "}, {"comment_id": "ccjolwg", "post_id": "1nl9e9", "comment": "yea guys, as you've probably noticed there are a series of these lessons I suggest browsing through them.  I've been learning theory on my own for a year now and I have learned a great deal within the last hour than I have within the past year"}, {"comment_id": "ccjn05k", "post_id": "1nl9e9", "comment": "I've just started learning piano and this looks really interesting. I don't really understand how the major and minor chords were assigned though (ie with the c chord, a d minor, e minor and a minor) or why the g was a g7. Is this just something I need to learn for each 'tonic'?"}, {"comment_id": "ccjo71i", "post_id": "1nl9e9", "comment": "Probably the best, most easy to understand music theory lesson I've ever seen.\n"}, {"comment_id": "cpxkhue", "post_id": "310py3", "comment": "Imo it should be soul to motown to hip hop."}, {"comment_id": "cpxsiqb", "post_id": "310py3", "comment": "[It's \"Patti Smith\" not \"Patty Smith\"](http://upload.wikimedia.org/wikipedia/en/thumb/8/88/PattiSmithHorses.jpg/220px-PattiSmithHorses.jpg)"}, {"comment_id": "cpy5xx2", "post_id": "310py3", "comment": "It's good but there are some relations which are confusing. Most of the graph implies a L->R flow of time but Heavy Metal is to the right of Grunge and Punk. Psychedelic Rock should flow out of Folk at least as much as it flows from Soul."}, {"comment_id": "cpxygh4", "post_id": "310py3", "comment": "Dated, but pretty good."}, {"comment_id": "c97lews", "post_id": "1bj5wv", "comment": "One quote that has stuck with me is something Kenny Werner says in [this video](http://www.youtube.com/watch?v=Un3p614XExc&feature=youtu.be) - *Don't quit practising one day before the miracle happens.*"}, {"comment_id": "c9iolx9", "post_id": "1bj5wv", "comment": "Thanks, i needed that :)"}, {"comment_id": "c1dhrb7", "post_id": "f5tis", "comment": "Good luck; it ain't easy! Stick with it though, few instruments are as hauntingly beautiful."}, {"comment_id": "c1dht25", "post_id": "f5tis", "comment": "There's always room for cello."}, {"comment_id": "c1dhs7b", "post_id": "f5tis", "comment": "Hurray! Cello!  I just started playing about 5 months ago and it's been a ton of fun.  Best of luck and let me know if you have any questions.  Not sure I'd be able to answer, but I could try. =)"}, {"comment_id": "c1e69wt", "post_id": "f5tis", "comment": "Sure wish I got a reddit mask for my birthday"}, {"comment_id": "c1dij3h", "post_id": "f5tis", "comment": "I'm jealous!  I took a cello class while I was studying at university (I was a percussion major) and since then have always wished that I had one of my own.  Good luck!"}, {"comment_id": "c1dit30", "post_id": "f5tis", "comment": "Niccceeee"}, {"comment_id": "c1diymv", "post_id": "f5tis", "comment": "[This book](http://www.amazon.com/170-Foundation-Studies-Violoncello-ILLUSTRATED/dp/0825802628) has some really good exercises for working on some common problems. It starts off pretty easy, and progresses to insanely difficult toward the end\n\nAlthough, if you're just now learning where all the pitches are, I'd hold off until you have a basic understanding of the first position\n\nPlaying cello is a blast though. Good choice!\n\n"}, {"comment_id": "c1djlgd", "post_id": "f5tis", "comment": "Awesome! Great instrument, hope you enjoy it as much as I have!\n\nSimilarly to some other commenters, I'd be happy to give you any tips/advice/stories, as I've been playing for about 5 years now."}, {"comment_id": "c1di4fz", "post_id": "f5tis", "comment": "Go Red Raiders!"}, {"comment_id": "c1dimwj", "post_id": "f5tis", "comment": "You want to get that checked by a doctor."}, {"comment_id": "c1diuf1", "post_id": "f5tis", "comment": "You really look like that Reddit alien guy."}, {"comment_id": "c1dk7wy", "post_id": "f5tis", "comment": "Warning: Harsh reality to follow.\n\nJudging by the finish and fingerboard, you have yourself a grade A crap box. Also, if you want to have a hope of sounding even mildly acceptable in the next 12 months you need private lessons.\n\nNow listen to my story before you down vote.\n\nWhen I was a young teenager I also became fascinated by the cello. After much debate I spent my long saved snow shoveling money on a very similar hundred and fifty dollar piece of crap from eBay.\n\nShortly after I got it, and no doubt partially motivated by a desire to improve the horrific sounds that were emitted from this claptrap imitation of an instrument, my mother agreed to pay for private violin lessons.\n\nThe first time I met the teacher she took one look at the cello I had so proudly bought and kindly suggested that perhaps I should rent for a few months. That was many years and about 5 cello upgrades ago. The fact of the matter is a decent pre-owned cello will run you about $1,500. Add in a few hundred for a bow. Then add in a case, rosin, music, lessons.\n\nI tell you this not to discourage you, but because if I had tried to learn on the toy I originally purchased, and I had not been able to have private lessons once a week, I have no doubt that I would have never gotten past a beginner level.\n\nKeep in mind that learning on an instrument that sounds like crap can be a very serious deterrent to persevering. Also private lessons are absolutely not optional with a bowed instrument. Maybe you can figure out guitar tab, after awhile you can teach yourself some piano, but you absolutely cannot teach yourself the cello."}, {"comment_id": "c0z2nuw", "post_id": "dbv5u", "comment": "Not that I give an arial monkeys fornication about karma, but I'm interested to know why I got a downvote?\n\nMeh... matters not, as long as someone finds it useful.\n\n:)"}, {"comment_id": "c0z1zef", "post_id": "dbv5u", "comment": "Thank you fine sir. "}, {"comment_id": "c0z2ntr", "post_id": "dbv5u", "comment": "This is an excellent guide! I'm currently in the process of mixing my band's first recordings and this helps a lot. Maybe you could post it to [/r/WeAreTheMusicMakers](http://reddit.com/r/WeAreTheMusicMakers) too, they will appreciate it."}, {"comment_id": "c0z2w0u", "post_id": "dbv5u", "comment": "As someone that has always been daunted by mixing options and what various plug-ins can do, I love you.  <3"}, {"comment_id": "c18adgs", "post_id": "dbv5u", "comment": "Really great, thank you.\n\nWhat does Q mean?"}, {"comment_id": "c1y5a87", "post_id": "ht4f0", "comment": "I suffered from poor ear and instead of doing some training ended up creating this. Am I doing it right? I'd be happy to introduce changes if you have any suggestions. Everybody is welcome to use it."}, {"comment_id": "c1y58wa", "post_id": "ht4f0", "comment": "Clever and simple - Nice!"}, {"comment_id": "c1yb3uz", "post_id": "ht4f0", "comment": "I'm going to recommend this to my students next year. "}, {"comment_id": "c1y6mr4", "post_id": "ht4f0", "comment": "Thanks, I'm going to try this out!"}, {"comment_id": "c1y6wa5", "post_id": "ht4f0", "comment": "its nice but i would like to see a way to go through without having to enter the melody into the computer. when i practice this stuff the last thing i want to do is click around stuff, maybe an option to show it if i'm not sure, but playing it and repeating is enough. also the roman numerals are usually used for chords, from what I see, you have \"I III V\"< but only the tonic triad, I, is being used"}, {"comment_id": "c1y7mng", "post_id": "ht4f0", "comment": "Excellent job with the program. Customization options would be very useful for chord types and progressions, and you might want to consider not requiring the correct octave in the perfect pitch training, as this will distract learners (it's better to ignore pitch height when identifying pitches absolutely). Thanks for putting this out there."}, {"comment_id": "c1y8dp2", "post_id": "ht4f0", "comment": "I've barely scratched the surface with this, but it seems you've created a very handy tool.  I look forward to checking this out some more.. thanks a bunch, good sir!  \n\nOne thing I noticed is that when you hit the correct note (C, for example), but in the wrong octave, it says \"Sorry, not a C\".  That's a little silly, considering the answer is, in fact, a C... even if the octave is wrong.  That might seem like a small issue, but it does have the potential to confuse a new learner.\n\nAnyway, great job, OP... please keep it up!  :)"}, {"comment_id": "c1y98zk", "post_id": "ht4f0", "comment": "Am I correct in noticing that if in the absolute pitch training if you choose one pitch and it is another, it has you practice the difference between those two pitches? And similarly in the chord type exercise with mistaking one chord type for another? I only played with it for a minute but that's what it seemed like it was doing. I approve, if so."}, {"comment_id": "c1yh1v1", "post_id": "ht4f0", "comment": "Perhaps you could suggest the use of syllables such as Do Re Me Fa Sol La Ti Do. You could either suggest their usage when you say \"When you hear a melody, sing it!\" or even make a warm-up page with something that would flash the syllables to make the exercise idiot-proof. I would use this often if it had a warm-up that ascended by triads and by modes.\n\nGNU Solfege may give you some more ideas as well. Thanks for this :D"}, {"comment_id": "c1zkh25", "post_id": "ht4f0", "comment": "Awesome, but I am embarrassingly bad at this. But I already knew that I have a strange way of relating to music. Still, I'ma try and stick with it for awhile and see if it helps."}, {"comment_id": "c224cqr", "post_id": "ht4f0", "comment": "It might help if after the user gets the last note right, the answer shows up under the button that says \"Ok, press play to hear melody\", so that they get a chance to think through the original melody again and see the right notes before going on. Otherwise it looks like a great tool."}, {"comment_id": "c24a6ea", "post_id": "ht4f0", "comment": "Holy fuck. This is amazing. Thank you so much for this."}, {"comment_id": "f4yzo1m", "post_id": "dm8rk3", "comment": "This is a great video. I love the way you frame musical ideas in a very palatable way. Would definitely love to see you get into more brainy subjects as well!"}, {"comment_id": "f4yjitz", "post_id": "dm8rk3", "comment": "Hi! Let me know if you have any questions. I love to discuss!"}, {"comment_id": "f50vov9", "post_id": "dm8rk3", "comment": "This was... actually really good! Short and to the point using simple and easy to understand examples. And no unnecessary waffling like sooo many youtubers do! Brb, going to watch your next vid...."}, {"comment_id": "f53byb3", "post_id": "dm8rk3", "comment": "That was helpful, thanks\n\nI find choosing the chord progression to be the most difficult part"}, {"comment_id": "f46ivmh", "post_id": "dje9wp", "comment": "Would changing key from D major to C# minor be considered upwards or downwards? Obviously the root note is lower, but since C# minor has two more sharps than D major (and since it's the relative minor of E major), it could be considered 'higher' than D?"}, {"comment_id": "c8lrkdn", "post_id": "198gpq", "comment": "I'd be interested to see these studies the author keeps mentioning.\n\nThe points the author made about the benefits of this regimen are easy to find counter-examples too and poke holes in. For example,\n\n>A) You never get bored or burnt out with practicing because you always have new things to get to\n\nThe reality of anyone who plays and practices a musical instrument is that they will always have periods of boredom and burnout. The author's argument would be true if we weren't talking about human beings. But even if one were to come up with the perfect regimen all it would take is one stupid thing, like not setting your alarm, to throw everything out of sync.\n\nI've been there. One day you're enjoying a well crafted practice routine. Then you get sick for a few days and the rest of the week is spent stressed out practicing exclusively for a performance. If there is a time to burn out, it's then.\n\nA good practice routine will keep you more organized and likely reduce your stress. But it doesn't solve all of life's problems."}, {"comment_id": "c8m0k61", "post_id": "198gpq", "comment": "Wait, so this whole article is about not practicing *too much*? Man, I've got the polar opposite problem. Let me know when you figure out the most effective seven minute practice routine and we'll talk."}, {"comment_id": "c8m6dh3", "post_id": "198gpq", "comment": "I think that practising for extended periods probably helped train my brain to focus and learn for extended periods.  I don't think there's a blanket rule, and I'd say the most efficient length of time to practise varies for different people, at different skill levels, and for different objectives."}, {"comment_id": "c8m76k7", "post_id": "198gpq", "comment": "This sounds similar to the [Pomodoro Technique.](http://en.wikipedia.org/wiki/Pomodoro_Technique)"}, {"comment_id": "c8mbpxs", "post_id": "198gpq", "comment": "Who can sit down and play for 8 15 minute increments a day?"}, {"comment_id": "c1e2g76", "post_id": "f8dxz", "comment": "you are awesome."}, {"comment_id": "c1e37jg", "post_id": "f8dxz", "comment": "Great post.  Do one on rhythm!"}, {"comment_id": "c1e5jns", "post_id": "f8dxz", "comment": "Great article, I sent it to my friend, it pretty much sums up what I have been teaching him lately. "}, {"comment_id": "c1e9dz5", "post_id": "f8dxz", "comment": "Really good summary article, and a nice mix of pure theory and hands-on music creation stuff. Great work, thanks for sharing!"}, {"comment_id": "c1e392j", "post_id": "f8dxz", "comment": "Very nice, but like, can we stop doing these 1-page crash courses and just keep sending people to musictheory.net?\n\nI think it's paced a little better, accessible to everybody, oh and also not blogcruft."}, {"comment_id": "ebnemoc", "post_id": "a5knxn", "comment": "This is neat and I like the interface. I dont know who your intended market is, but as an ableton user and guitar player, I'll offer some feedback. \n\n- Why are some of the circles opaque white, yellow, or just circles? They dont seem to change consistently. \n- I need a way to reset the metronome. Especially after I 'plus-signed' my way into a hard stutter.\n- The metronome sound is harsh\n\n\n- Polyrhythms would be cool, maybe you could split screen it?\n\n\nDont take my feedback as criticism, I think you have a fun little app here. I could see myself running it at the same time as spotify to try and nail a beat. Thanks for making."}, {"comment_id": "ebnj5nl", "post_id": "a5knxn", "comment": "Darn android.... "}, {"comment_id": "ebp98rr", "post_id": "a5knxn", "comment": "android please :D"}, {"comment_id": "c8oh6ov", "post_id": "19h5jb", "comment": "Can't wait to try it and get back to you"}, {"comment_id": "c38yzp8", "post_id": "ngkdm", "comment": "This makes a lot of sense. I like the philosophy behind it. \n\nThe editor of the video, on the other hand, needs to check his captions before he renders the video though. : /"}, {"comment_id": "c390r7u", "post_id": "ngkdm", "comment": "The interesting thing is, this does not only apply to music. This applies to any skill or knowledge that you are trying to acquire. Thus the so called 'learning process'"}, {"comment_id": "c392sms", "post_id": "ngkdm", "comment": "I love the musical examples and enthusiasm Wellington brings to this concept, but it's not original: this is the [Four Levels of Competence](http://en.wikipedia.org/wiki/Four_stages_of_competence), often called Mazlow's model of learning:\n\n* Unconscious Incompetence\n* Conscious Incompetence\n* Conscious Competence\n* Unconscious Competence\n\nGreat video though! I particularly liked his final point, the analogy about rooms in a house: *\"You just have to not be scared to walk to that next room\"*"}, {"comment_id": "c394h5m", "post_id": "ngkdm", "comment": "This video opened up a whole new approach to learning. He brings a calm, encouraging demeanor to teaching the concept. "}, {"comment_id": "c4qi7t6", "post_id": "ngkdm", "comment": "This needs to go in /r/scientology :D\n\nBut seriously, that video was profound."}, {"comment_id": "ejvbanj", "post_id": "b7omyg", "comment": "The practice part is the most important. If you challenge yourself to try and make a song every night you’ll get better real quick "}, {"comment_id": "ejt2ab8", "post_id": "b7omyg", "comment": "If you have friends interested in learning how to produce music, hook them up with this guide! It covers everything from selecting a DAW to cultivating healthy practice habits."}, {"comment_id": "dqj20hj", "post_id": "7ggwwn", "comment": "Nice, thanks."}, {"comment_id": "dr6kbhm", "post_id": "7jiaz7", "comment": "###List of content: ###\n[0:00](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=0s) Intro - a myriad of Jazz Scales\n\n[0:20](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=20s) Practice efficiently\n\n[0:50](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=50s) Finding the scales by looking at the progressions\n\n[0:59](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=59s) The Major II V I Cadence: Dm7 G7 Cmaj7\n\n[1:15](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=75s) The II V I and the other diatonic chords\n\n[1:44](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=104s) The Major scale it's all you need from So What to Giant Steps.\n\n[1:57](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=117s) The Minor II V I Cadence: Bø E7(b9) Am6\n\n[2:09](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=129s) Adding Harmonic minor and Melodic minor\n\n[2:34](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=154s) Secondary dominants and cadences\n\n[2:51](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=171s) Secondary cadence to IV in C major\n\n[3:07](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=187s) Secondary cadence to III in C major\n\n[3:27](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=207s) IV minor variations\n\n[4:26](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=266s) Diminished Chords the two types\n\n[4:40](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=280s) Dominant diminished chord\n\n[5:04](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=304s) Subdominant diminished chord\n\n[5:44](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=344s) What is covered so far\n\n[6:06](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=366s) The tritone substitute: Dm7 Db7 Cmaj7\n\n[6:23](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=383s) The Backdoor dominant: Fmaj7 Bb7 Cmaj7\n\n[6:48](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=408s) Double diminished or German Augmented 6th: Fmaj7 Ab7 Cmaj7\n\n[7:23](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=443s) Cadences with other dominant choices: Altered and Harmonic minor\n\n[8:11](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=491s) The three scales and where we need them - cutting away what we don't need.\n\n[8:55](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=535s) Getting this into your practice routine!\n\n[9:12](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=552s) Scale practice suggestions and knowing the scales\n\n[9:40](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=580s) Example of what works and what doesn't work when improvising over an Fmaj7 in C major\n\n[10:59](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=659s) The Bonus from practicing like this!\n\n[11:20](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=680s) Learning the rest of the scales\n\n[11:58](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=718s) Do you work with this system or do you have a better one?\n\n[12:36](https://www.youtube.com/watch?v=NEvBZTD-f6s&t=756s) Like the video? Check out my Patreon Page!"}, {"comment_id": "c33l6ms", "post_id": "msxis", "comment": "That's just a sound board, commonly used for recording or live audio. You don't really need to know anything about music or music theory, you just have to know what sounds good and what to adjust. Try out [/r/audioengineering](/r/audioengineering) or [/r/WeAreTheMusicMakers](/r/WeAreTheMusicMakers) if you're really stumped.\n\nHas your dad told you what he wants you to learn to use it for? Recording? Live performance?"}, {"comment_id": "c33l8ol", "post_id": "msxis", "comment": "Mixing?  It's conceptually easy, but extremely difficult to do well.  You have to have a sharp ear for the mix you're creating, and be able to identify individual channels that are too loud/soft, or need an EQ adjustment, or need more/less reverb or some other effect, or any number of other little adjustments.  Some of this work is done in prep, and some is done on the fly.\n\nThen there's the whole issue of miking, if that's also included in the job description.  There are lots of different kinds of microphones, and each model has different properties that make them good for different situations.  Then there's the whole issue of placement, which is not only dependent on the mics, but also the room, the player, and the particular setup.  It's an incredibly subtle art, and there are pretty much no strict rules about it.\n\nIf you listen to music and know what music is supposed to sound like, then you are capable of learning this, but it's a lot of work, and unfortunately, something that's very difficult to practice."}, {"comment_id": "c33m8lv", "post_id": "msxis", "comment": "Consoles are easy!!  Just remember: \n\n1)Each column (channel) operates the same way, so every knob has the same effect on its channel as that same knob on every other channel.\n\n2) Never EVER EVER EVER crank those knobs.  Make tiny (one \"notch\" or less) adjustments, register the effect, and adjust again.\n\nWelcome to live sound production!"}, {"comment_id": "c35vnkt", "post_id": "msxis", "comment": "I've spent over two years behind this very board and can answer any questions you have about it. Seriously, anything."}, {"comment_id": "c37d46u", "post_id": "msxis", "comment": "Honestly, read the manual. If you are using it for live sound, there should be some diagrams of how to hook up monitoring, fx, submixes etc...\n\nFrom that comes a lot of time behind the board listening to get comfortable with it.\n\nAlso, most important quick tip I can give you:\nAlways turn the speakers on last and always turn them off first."}, {"comment_id": "c34qr1v", "post_id": "msxis", "comment": "When it comes to mixing a degree of practical musical experience helpful in understanding what sounds right with what. But if your young and you have time to learn then that's fine.\n\nThe basic rule is that each column is a pathway for sound. starting from the input down to the volume slider.\n\nThe input is usually female XLR or female 3.5 mm jack. These are where you plug in the instrument. An XLR lead will usually come from a microphone or a DI box. A 3.5mm (1/4 inch) jack is a standard mono guitar or speaker lead.\n\nThe first pot (potentiometer, better way of saying knob) is almost always Gain. Usually 12 o clock will be 0 Decibels, and this is how you should usually keep it. \n\nYou have an EQ section next, Hi mid low. These control certain frequencies. It is important to know the jargon here. Roll off all or much of the mid and it's Scooped. Roll off all the top and it's bassy, roll off the low and its trebley. Pretty simple really.\n\nSeeing as this is a big desk you might have AUX and Effect. Neither of these are much use to you as a beginner so just keep them at 0.\n\nNow the next bit doesn't make sense if you don't understand 3D Mixing. The principle is simple, you can mix in 3 dimensions by changing the EQ (as mentioned above) panning; reverberance (reverb) and volume, . EQ changes the up and down dimension, so bass is at the bottom and treble is at the top. Panning is left and right. Reverb/volume is forward and backwards \n\nIf it has a built in reverb unit then it is as simple as turning a dial. Things get more complicated (but better quality) if you have outboard effects. Simply speaking, turn up the reverb to make the room you are in sound bigger.  \n\nPanning is usually the second last thing on the column. Panning is simply how far left and right the sound is. Turn to the left it goes left, to the right it goes right, it is incredibly simple but hard to master. Be prepared for subtlety over extreme panning. Pan so the instruments are heard where they are on stage.\n\nThe last is the volume. set this at ±0db and usually only cut sound down. I know it sounds weird at first but it makes sense. The figures do not represent actual volume, but difference from the original sound.\n\nThere are a few more controls. One is the stereo out, and that is the final level of the mix. It can be one slider but is often (as seems to be the case with your mixer) two representing left and right.\nHope this helps. And i invite anyone else to go into more depth or correct me on any of these subjects. Happy mixing.   \n"}, {"comment_id": "c33larb", "post_id": "msxis", "comment": "You can learn everything you need to know about how to operate it in a weekend. Unfortunately, what you won't learn in a weekend is how to effectively record and mix music. I recommend you pick up a book on mixing audio like [Mixing Secrets for the small studio](http://www.amazon.com/Mixing-Secrets-small-studio-Senior/dp/0240815807/ref=pd_sim_b_7) or [The Recording Engineer's Handbook](http://www.amazon.com/Recording-Engineers-Handbook-Bobby-Owsinski/dp/159863867X/ref=pd_sim_b_8) if you plan on recording through this mixing desk. "}, {"comment_id": "c33na11", "post_id": "msxis", "comment": "Its easy. It's basically set like a flow chart. Except there's lots of the same path. Learn one path, you learn them all. I'm talking about the identical left hand side of the board. You go from top to bottom. Every setting you tweak changes the sound. Once you've done all that you can also use the non-identical settings on the right hand side of the board to tweak the sound from your channel. Thats a little more complicated. Just play around with it."}, {"comment_id": "c33oxpe", "post_id": "msxis", "comment": "1 part aptitude, 2 parts inclination "}, {"comment_id": "c33nprg", "post_id": "msxis", "comment": "All you need is a bunch of mics and instruments to plug into it. With all the other posts, in reality you need a lot of different things to mix. He'd be better off with a 4 channel mixer instead of a 32 channel, no need for it, unless you have a stadium in your house. \n\nMIXING is not easy. Some of the highest paid and trained people in music biz are producers and engineers. Maybe of them go to 2 or four year colleges. For example, at Berklee College of Music, the hardest major to get accepted into is Engineering. \n\nBut seriously, unless your dad has at least 20 different sounds to mix, this thing is overkill. "}, {"comment_id": "c33o1ix", "post_id": "msxis", "comment": "This is for sound not music"}, {"comment_id": "eg8wl06", "post_id": "apitug", "comment": "As a beginner piano player I can't thank you enough. "}, {"comment_id": "eg8zn3i", "post_id": "apitug", "comment": "Very cool. Thank you a lot! "}, {"comment_id": "egaksys", "post_id": "apitug", "comment": "Looks fairly similar to [this](https://pianoworld.com/fun-stuff/piano-scales-and-chords/) but if you prefer a poster then that's what you should go for"}, {"comment_id": "d4955f5", "post_id": "4o0n1d", "comment": "It almost makes me want a kindle, but not quite!!\n\nThanks though!!!"}, {"comment_id": "d49hqjt", "post_id": "4o0n1d", "comment": "Thanks!"}, {"comment_id": "d49pdz4", "post_id": "4o0n1d", "comment": "Thanks for providing the book! I'm looking forward to going over it tonight and applying it to the piano. "}, {"comment_id": "d49yfq9", "post_id": "4o0n1d", "comment": "Thank you"}, {"comment_id": "ceabqsg", "post_id": "1tpwd4", "comment": "[deleted]"}, {"comment_id": "ceab19e", "post_id": "1tpwd4", "comment": "I'm just a noob but I just can't get out of my head this lovely 5-chord progression I found the other day, however after toying with it for 2 days on my keyboard I can't do much with it, moreover it loses its charm when I transfer it to the only DAW I'm familiar with.\n\nAfter browsing several resources I found this video, hopefully it will be helpful for this issue."}, {"comment_id": "c4fdwtq", "post_id": "sms3s", "comment": "Whichever one you have the most fun with."}, {"comment_id": "c4f9gl3", "post_id": "sms3s", "comment": "I've been practicing theory and dexterity on the keyboard, I've owned a guitar for a while and have learned a few songs that I particularly like by rote. Even so, after having played those hundreds of times, they're still not as fluid and easy to discern and pull out of the ether that are my thoughts as even the easiest ideas and formulae I've learned on the piano. Major, minor scales, chord formation (I know the rules for making major, minor, augmented, and diminished chords. I somewhat grasp the idea of where the 4's and 7's come in as they're part of the same scale, but I feel like that idea has yet to click in my brain), inversion and things like that. The very basic basics, but I'm not at the point where I can just sit and play. I know how a piano goes, but I can't remember whether guitar frets go \"step, step, half step\" or \"half step, half step, step\". Not only that, but it's less intuitive and flat than a keyboard. Still, because of what I've done over the years in my trying to learn guitar (and taking 4 years of classes, I honestly feel kinda like public school failed me - this shit is intuitive and easy) my right hand is significantly more dominant (I like finger picked music, so that's what I taught myself) so I'm finding it hard to use my left hand as an independent instrument basically. Five little individual mallets for the percussion that is piano/keys. I'm rambling, sorry. Any guidance or reading material would help. I would especially like to learn the rules for all the other kinds of scales. Any help is appreciated."}, {"comment_id": "c4fcfye", "post_id": "sms3s", "comment": "After tinkering with guitars for about a year and a half, I got an uke and started playing it. The chords came pretty easily, and they made my guitar fretwork much better. Just something to think about."}, {"comment_id": "c4l4vu7", "post_id": "sms3s", "comment": "JAM ON ALL THE THINGS"}, {"comment_id": "c4faxhh", "post_id": "sms3s", "comment": "**Mandolin**- Right hand uses a pick, has to be very articulate. The strings are tuned in 5ths so the scale is the most different of the three. \n    \n**Guitar**- I would recommend learning fingerstyle first then how to use a pick. Scales and chords are all shapes. Learn how to play with the shapes and change 'em up.\n    \n**Uke**- Right hand should be played w/o pick (IMO). Fingerpicking patters are called rolls and you'll want to learn a variety. They allow you to express the same chords in different ways. The top three stings are tuned the same as the guitar so if you know those chords shapes, it's easy to switch. \n\n    \nIf you want my opinion, start with guitar. Get comfortable with learning the shapes and building versatility in your right hand. From that you can decide if you want to move to mando or uke. Ultimately, it depends on what type of music you want to play. I find the uke to be the most limiting, especially if your instrument ins't great quality."}, {"comment_id": "c4fi0z5", "post_id": "sms3s", "comment": "I've been playing the guitar for years and I'm thinking about learning piano on a MIDI controller, those look like M-AUDIO *es series (61 I think) do you recommend them? does the keys feel good for a beginner?"}, {"comment_id": "c4fah6l", "post_id": "sms3s", "comment": "i pick a favorite then supplement with the others. looks like fun to me. i play bass and am learning keys and guitar on the side just whenever i feel like picking one up. im not that dedicated its just a way i dont get bored with what im doing."}, {"comment_id": "c4fe3lm", "post_id": "sms3s", "comment": "Assuming your fingers are small enough, the uke is probably the easiest to play. Four nylon strings, and for some reason, it just seems to respond better to poor technique than guitar or mandolin.\n\nOn the ther hand, guitar might better for a beginner simply because of its ubiquity. It's not as though there's a lack of uke/mando learning resources on the Internet, but the amount for guitar may as well be infinite, for all intents and purposes.\n\nThat said, I see no reason to keep them all in rotation. You'll figure out quickly what you like and dislike and probably end up playing one more tha another. That's fine."}, {"comment_id": "c4fk8a9", "post_id": "sms3s", "comment": "Learn mandolin and you can also play tenor banjo, cello, and fiddle more easily because the fingerings are the same."}, {"comment_id": "c4ffntg", "post_id": "sms3s", "comment": "You have to play all 6. At the same time."}, {"comment_id": "c4pxn34", "post_id": "sms3s", "comment": "Pls dun post imgur 4 karma. maeks 4 bd dskshn. Self post nxt tym pls."}, {"comment_id": "eeind0s", "post_id": "ahm470", "comment": "Those exercises are good as a start, I wonder how complex the exercises become on musictheory.net?"}, {"comment_id": "dox1f7e", "post_id": "78vuop", "comment": "Looks like Yale took this one off of their page of free courses. Luckily for us, the direct links to individual lectures still work (for now):\n\n[Lecture 1 - Introduction](http://oyc.yale.edu/music/musi-112/lecture-1) (same as main post link)\n\n[Lecture 2 - Introduction to Instruments and Musical Genres](http://oyc.yale.edu/music/musi-112/lecture-2)\n\n[Lecture 3 - Rhythm: Fundamentals](http://oyc.yale.edu/music/musi-112/lecture-3)\n\n[Lecture 4 - Rhythm: Jazz, Pop and Classical](http://oyc.yale.edu/music/musi-112/lecture-4)\n\n[Lecture 5 - Melody: Notes, Scales, Nuts and Bolts](http://oyc.yale.edu/music/musi-112/lecture-5)\n\n[Lecture 6 - Melody: Mozart and Wagner](http://oyc.yale.edu/music/musi-112/lecture-6)\n\n[Lecture 7 - Harmony: Chords and How to Build Them](http://oyc.yale.edu/music/musi-112/lecture-7)\n\n[Lecture 8 - Bass Patterns: Blues and Rock](http://oyc.yale.edu/music/musi-112/lecture-8)\n\n[Lecture 9 - Sonata-Allegro Form: Mozart and Beethoven](http://oyc.yale.edu/music/musi-112/lecture-9)\n\n[Lecture 10 - Sonata-Allegro and Theme and Variations](http://oyc.yale.edu/music/musi-112/lecture-10)\n\n[Lecture 11 - Form: Rondo, Sonata-Allegro and Theme and Variations (cont.)](http://oyc.yale.edu/music/musi-112/lecture-11)\n\n[Lecture 12 - Guest Conductor: Saybrook Orchestra](http://oyc.yale.edu/music/musi-112/lecture-12)\n\n[Lecture 13 - Fugue: Bach, Bizet and Bernstein](http://oyc.yale.edu/music/musi-112/lecture-13)\n\n[Lecture 14 - Ostinato Form in the Music of Purcell, Pachelbel, Elton John and Vitamin C](http://oyc.yale.edu/music/musi-112/lecture-14)\n\n[Lecture 15 - Gregorian Chant and Music in the Sistine Chapel](http://oyc.yale.edu/music/musi-112/lecture-15)\n\n[Lecture 16 - Baroque Music: The Vocal Music of Johann Sebastian Bach](http://oyc.yale.edu/music/musi-112/lecture-16)\n\n[Lecture 17 - Mozart and His Operas](http://oyc.yale.edu/music/musi-112/lecture-17)\n\n[Lecture 18 - Piano Music of Mozart and Beethoven](http://oyc.yale.edu/music/musi-112/lecture-18)\n\n[Lecture 19 - Romantic Opera: Verdi's La Traviata, Bocelli, Pavarotti and Domingo](http://oyc.yale.edu/music/musi-112/lecture-19)\n\n[Lecture 20 - The Colossal Symphony: Beethoven, Berlioz, Mahler and Shostakovich](http://oyc.yale.edu/music/musi-112/lecture-20)\n\n[Lecture 21 - Musical Impressionism and Exoticism: Debussy, Ravel and Monet](http://oyc.yale.edu/music/musi-112/lecture-21)\n\n[Lecture 22 - Modernism and Mahler](http://oyc.yale.edu/music/musi-112/lecture-22)\n\n[Lecture 23 - Review of Musical Style](http://oyc.yale.edu/music/musi-112/lecture-23)"}, {"comment_id": "doyd4gv", "post_id": "78vuop", "comment": "A million blessings to you OP. And Yale too I guess"}, {"comment_id": "dp17wzh", "post_id": "78vuop", "comment": "Thank you so much for this!"}, {"comment_id": "d977c7v", "post_id": "5969pf", "comment": "haha, that was straight up kooky. It's like the sound track for the loony bin."}, {"comment_id": "ctilxuj", "post_id": "3ersyi", "comment": "Oddly, D is actually the dominant of the first song and G is the tonic. \n\nG minor scale - not D minor."}, {"comment_id": "cti8na3", "post_id": "3ersyi", "comment": "Wow... really cool. It worked for me right away. Thanks a ton!"}, {"comment_id": "ctigxx1", "post_id": "3ersyi", "comment": "This is amazing. I tried it out on three different songs to practice and it worked. Quite quickly I might add. :)"}, {"comment_id": "c0jpbvt", "post_id": "aw47e", "comment": "thanks! I just started playing piano! This is going to help me out greatly!"}, {"comment_id": "c0jpf8d", "post_id": "aw47e", "comment": "This is super rad! I jam acoustic bass, guitar, and baritone ukulele with buddies and was thinking about buying a melodion to jam with as well so I could learn some piano keys too. This may have convinced me."}, {"comment_id": "c0jqnhd", "post_id": "aw47e", "comment": "Is that first thing you play in the video a ten bar blues?"}, {"comment_id": "c0jw75z", "post_id": "aw47e", "comment": "Thanks a lot!  This is encouraging as fuck, bookmarked.  I've wanted to learn piano for years and have finally decided to spend this years tax refund on a keyboard.  Can't wait to start taking lessons.  Here's two bands I think sound great and do some really interesting things with composition.  Maybe you'll dig 'em too?\n\n[Black Diamond Heavies](http://www.lala.com/#album/2017894108713714516/Black_Diamond_Heavies/A_Touch_of_Some_One_Else%27s_Class) heavily blues influenced 2 piece where the singer John growls like Tom Waits and plays a Rhodes piano.\n\n[Au Revoir Simone](http://www.lala.com/#album/937030197557909904/Au_Revoir_Simone/Still_Night,_Still_Light) very poppy all girl 3 piece who only play keys and a drum machine.  And harmonize a lot."}, {"comment_id": "c0l2ebj", "post_id": "aw47e", "comment": "Thanks a lot for this. I am somewhat frustrated with my progress on the piano and blues is my favorite genre ( saw BB King and Buddy Guy last week. :) ). This is the perfect post for me. "}, {"comment_id": "c0ldqk1", "post_id": "aw47e", "comment": "I just started playing the piano too. I bought one a couple of weeks ago and started lessons. I was going through some books and tried the blues scales they showed, and I was like \"Ah, yeah, this is it.\" Totally the sound I love. Thanks for all the tips!"}, {"comment_id": "elywt0a", "post_id": "bhz2jr", "comment": "Very nice. Any other cheat sheets for chords like this one?"}, {"comment_id": "e8pewbx", "post_id": "9sbt7z", "comment": "I watched. I played along. I learned. I subscribed. Thanks."}, {"comment_id": "e8uftvo", "post_id": "9sbt7z", "comment": "As a teacher I found this useful. Thank you "}, {"comment_id": "e7rwqko", "post_id": "9o2z3g", "comment": "Nice, clear and very easy to follow. As a rank beginner, I'm always looking for videos like this and look forward to future ones -- so I can eventually play /u/themusictutor's version of Gerhard Gschossmann's version of Chet Atkins & Mark Knopfler's version of Django Reinhardt's [tune](https://www.youtube.com/watch?v=1-cQKuFWZvQ)."}, {"comment_id": "d419aba", "post_id": "4n649s", "comment": "This sounds great!  Thanks for making it! :)\n\nRemindMe! 6 Days \"Free Instrument Learning eBook\""}, {"comment_id": "d41k7zy", "post_id": "4n649s", "comment": "RemindMe! 6 Days \"Free Instrument Learning eBook\""}, {"comment_id": "d41ymvl", "post_id": "4n649s", "comment": "RemindMe! 6 days \"Free Instrument Learning ebook\""}, {"comment_id": "d429tq7", "post_id": "4n649s", "comment": "Sounds great! Thanks. \n\nRemindMe! 6 Days \"Free Instrument Learning eBook\""}, {"comment_id": "d47p4ff", "post_id": "4n649s", "comment": "It doesn't appear as free for me. "}, {"comment_id": "d42aukb", "post_id": "4n649s", "comment": "So this is a single book that's purporting to teach any musical instrument?  How could that possibly be helpful beyond a superficial level?  What's the structure of it?"}, {"comment_id": "e0ci7hy", "post_id": "8pk5tb", "comment": " Excellent job! Well explained, great editing, and perfect illustrations. I subscribed."}, {"comment_id": "e0ciizk", "post_id": "8pk5tb", "comment": "Awesome job.  I got out my guitar and followed along.  Great explanation and examples.  I subscribed!  Nice to put a name and strategy to what I've observed in chord progressions already!"}, {"comment_id": "e0cms4k", "post_id": "8pk5tb", "comment": "This is great, got me excited about music theory again after a while. Subbed :P"}, {"comment_id": "c3x5r8k", "post_id": "qe5yl", "comment": "Umm sure possibly, link?"}, {"comment_id": "c422uaj", "post_id": "qe5yl", "comment": "FINALLY."}, {"comment_id": "c3jsyq0", "post_id": "osy99", "comment": "There are two really good essays on this topic you should check out:\n\nAdorno, T. \"On Popular Music.\" http://www.icce.rug.nl/~soundscapes/DATABASES/SWA/Some_writings_of_Adorno.shtml\n\nBourdieu, P. \"Distinction: A Social Critique of the Judgment of Taste.\"\n\nAdorno has this very excellent idea about accessible or \"popular\" music that its primary function is to simultaneously provide escape from boredom without requiring the listener to exert effort. This is why popular music is formulaic and standardized while still marketing itself around a cult of pseudo-individuality. The favored hit singer of the week provides novelty without any significant musical change.\n\nIf you want to hear my perspective as a musician, I do not think that learning music theory alone changes taste in music. I think that being exposed to different styles of music and attempting to learn them inherently increases your ability to appreciate them. I also think that there are many theories of music rather than just one. Hip-hop has its own musical language, and I couldn't compose in that style to save my life. It has its own theory, even if musicians don't sit around describing it in terms of numbers and intervals. "}, {"comment_id": "c3jt9n8", "post_id": "osy99", "comment": "I like to make an analogy between music and food. The latest Top 40 hit is like a fast food meal, and something like, say, a Mahler symphony is a $100 steak. Personally, I wouldn't want to live on only either one of those for my whole life. Some days, you want to set aside some time and really digest a $100 steak [big symphony], savoring every nuance and flavor. Other days, maybe you're short on time or really stressed and you just need to have a cheap, simple, and satisfying burger [pop music]. Neither one is \"bad\", they just play different roles in people's lives."}, {"comment_id": "c3juqkc", "post_id": "osy99", "comment": "Think of it this way: You can reap all the benefits of science without knowing a damn thing about it. You don't suddenly appreciate computers less by learning about how they work. Instead, learning about them is enlightening and allows you to both appreciate and understand more.\n\nToo often, people explain that you \"should\" like a form of music because of some highly technical reason. And that's condescending. You don't have to like anything. And there are plenty of well-educated musicians for whom Keith Jarrett is just not their taste, too.\n\nMusic contains two distinct \"arts\": the composition and the performance. The performance part is what interests you. After all, that's the end product that makes music worthwhile in the first place.\n\nHowever, the composition part is quite an art, too. A skilled composer often likes the intellectual stimulation of writing out an abstract idea. A skilled producer likes tending to subtle changes in a song's instruments and form. A skilled improviser likes realizing whatever artistic whim runs through his (or her) head. It's just like a writer who appreciates a creative grammatical construction or a painter who tries holding a brush in a new way. Or, to stick with my original analogy, it's like the people who design websites, computers, and video games. These may (and usually do) go unnoticed by the person experiencing the art, but that doesn't mean they don't contain artistic value. Sometimes the value is only to the composer, and that's fine.\n\nLearning more about music theory is not obstructing. Instead, it opens up a new dimension to the art. It allows you to appreciate the finer details of creating music--details that may be virtually invisible to the non-musician. Your piano teacher probably likes both Coldplay and Keith Jarrett. And if he doesn't, I would argue he's the one that's jaded, not you."}, {"comment_id": "c3jv2wa", "post_id": "osy99", "comment": "Every day that you live your taste is changing and growing. Don't be so concerned about it -- do what you like."}, {"comment_id": "c3jxjwa", "post_id": "osy99", "comment": "Rather than an external conflict of \"music theory vs the audience\", I have an internal one of \"music theory vs taste\". There is a lot of value in understanding music theory, but I swear the more I learn the more I feel like it clashes with my tastes."}, {"comment_id": "c3jss95", "post_id": "osy99", "comment": "I'm not much of a musician, but...\n\nHow many chart toppers in the last 40 years have been something other than a I-IV-V or some basic blues progression?  If you're going to try to appeal to the biggest audience, you're going to have to keep it simple.  I know there are counterexamples, and maybe those are what would make the discussion interesting, but it seems like the vast majority of radio friendly music follows maybe 5 or so chord progressions, and rarely strays outside of a few keys.\n\nI don't think adding complexity necessarily creates a sound that takes more education to appreciate.  I suspect it has more to do with the listener's personality: how curious are you?  How much do you appreciate something new for the sake of it versus sticking with something you're comfortable with?  Someone who likes new stuff just because it's new might really like unique harmonies and melodies even if they couldn't describe what's different about them.\n\nThe same thing happens with movies, where certain people like challenging films and a somewhat distinct group likes blockbusters.  The distinction between those groups has more to do with appreciation than with who knows more about making movies.  "}, {"comment_id": "c3lskme", "post_id": "osy99", "comment": "I feel learning more about music does change my taste in music. I find that my attention span is much longer and I am able to listen to things more intently, regardless of what style of music. I am also able to determine what I like and don't like about a particular piece or song.\n\nWhat I find interesting is that many composers such as Bartok, Ives, Stravinsky, Tchaikovsky, and even Beethoven use folk songs for some of their themes. At the same time I have heard plenty of modern classical music that pulls its inspiration from rock and other popular music (ie. Zappa, Reich, Now Ensemble, etc.). It seems that each side of the spectrum needs each other.\n\n"}, {"comment_id": "c3jul6l", "post_id": "osy99", "comment": "Broadly speaking, there's a balance to strike between connecting deeply with a small audience and connecting shallowly with a large audience. However, that balance doesn't have anything to do with how well-versed you are in theory or how sharp your ear is—learning more about music will make you a better musician in whatever style you decide to play."}, {"comment_id": "c3jvcdj", "post_id": "osy99", "comment": "Why wouldn't your audience change with your tastes? It's not like Keith Jarrett is marketing his stuff to Coldplay fans..."}, {"comment_id": "c3k3uh0", "post_id": "osy99", "comment": "Chris Martin is writing music to appeal to the masses by using common denominator ideas in his pop music writing. Jarrett on the other hand writes music for artistic purposes. Don't be fooled though, I am sure Jarett will have his place in history and lives quite comfortably. In face he has been on WAY more recordings and probably has a more stable and controllable career than martin. 30,000 copies sold at a high royalty rate can make more money than 3,000,000 copies through a major record label. In fact, most pop artists owe the record company money even after goin gold or platinum. My guess though, Jarett will be remembered more in 100 years, Martin more or less forgotten. "}, {"comment_id": "c3ksef3", "post_id": "osy99", "comment": "Who cares about the audience?"}, {"comment_id": "f5ojnl3", "post_id": "dlncn6", "comment": "Nice! Very useful! Thanks for sharing"}, {"comment_id": "ejn542j", "post_id": "b6u965", "comment": "Really nicely explained, thank you!!"}, {"comment_id": "dzlmyar", "post_id": "8m7vv3", "comment": "I always laugh at instructions like this. “Hey! Here’s how to use this product. Want to practice for all the world to hear? Don’t.” "}, {"comment_id": "d3gm9um", "post_id": "4koyhc", "comment": "Great help, thanks! "}, {"comment_id": "d3h9vuj", "post_id": "4koyhc", "comment": "Very helpful! Thanks for sharing. "}, {"comment_id": "d3s8cwb", "post_id": "4koyhc", "comment": "As a total noob this is awesome!  Can you do more for different scales?  I'd like to see the pattern and the notes in that pattern.  For example:\n\n**Legend**\n\nT = Tone [whole step]\n\nS = Semitone [half step]\n\nTS = Tone + Semitone (minor 3rd interval)\n\n**The Minor Pentatonic Scale**\n\nFormula: TS T T TS T\n\nC Eb F G Bb\n\nD F G A C\n\netc.\n\nI hope I got those right! Like I said, complete noob here.  I found this page (http://www.guitarorb.com/guitar-scales/) listing the 6 most used scales and having those scales listed out like you did with the Major scale would be absolutely incredible.\n\nEdit: I stole the legend from another page but if it ended up being the more common W and H that's understandable too."}, {"comment_id": "d3h1txk", "post_id": "4koyhc", "comment": "How is this helpful?  Do people not know which key is which or something?"}, {"comment_id": "cmxdjgr", "post_id": "2ph8jr", "comment": "Sounds awesome.  Will check it out when I get home."}, {"comment_id": "cmxfxi1", "post_id": "2ph8jr", "comment": "This is brilliant! Must have taken a while to do."}, {"comment_id": "cmxsft9", "post_id": "2ph8jr", "comment": "Brilliant! Thank you for this."}, {"comment_id": "cn81h72", "post_id": "2ph8jr", "comment": "[deleted]"}, {"comment_id": "ch5dugv", "post_id": "24b15u", "comment": "/r/NeedABand/ would also be a good place to put this.\nNice concept and already people in my area signing up. Good luck!"}, {"comment_id": "ch5s21x", "post_id": "24b15u", "comment": "Awesome tool!  I've been wishing for something like this for years, all signed up.  It wont let me import a photo though.  I have a strange feeling  the problems on my end though, my computer's kind of tempermental."}, {"comment_id": "ch5fc3a", "post_id": "24b15u", "comment": "If you're ever in NYC, we should jam. Love what you're contributing to the musician community."}, {"comment_id": "ch5he8y", "post_id": "24b15u", "comment": "Tweeted your site, awesome stuff =)"}, {"comment_id": "ch5udyu", "post_id": "24b15u", "comment": "Loving this! I'll share this on my social feeds. :D"}, {"comment_id": "ch62p9x", "post_id": "24b15u", "comment": "I joined - and I'm all alone in my area!\n\nGreat site, thanks!"}, {"comment_id": "chfhqpf", "post_id": "24b15u", "comment": "SDAWQ12R2EZX"}, {"comment_id": "c9fcrb8", "post_id": "1cbyoy", "comment": "Jesus christ. Cramming in as much information as possible ≠ \"easier\", \"faster\", or \"simpler\". This is a visual design nightmare in so many ways.\n\nEDIT: here's a list of problems I see with it\n\n1. All the information is incredibly small and hard to see compared to normal notation. Imagine it in an orchestral score, for example. You wouldn't be able to see half of what's going on!\n\n2. Letter mnemonics are English-specific - in another language, they'll be totally arbitrary. Standard notation isn't bound to any language or geographical region.\n\n3. Since there aren't any stems, it's impossible to indicate double-stemming, as is common (and extremely important) in much keyboard music, orchestral reductions, etc.\n\n4. Accidentals are confusing and inconsistent, at least in their example. In the left hand: the A's at the beginning are unmarked, but supposed to be natural. So we assume that no marking means \"follow the key\", but then the B at the top is unmarked, and it's supposed to be flat. And it seems that they've ditched key signatures and are just marking all the accidentals (see the repeated Ab in beats 3 and 4, first measure, left hand), which will lead to a huge amount of redundant symbols.\n\n5. It's not clear in their notation how or why to interpret the beamed notes in the first measure LH as 16th notes. The line with an arrow doesn't really resemble their symbol for 16th notes.\n\n6. What about articulations, slurs, breath marks, etc? I think it's telling that they picked an example without any, because it's already quite visually cluttered without including all those things in it."}, {"comment_id": "c9fhcge", "post_id": "1cbyoy", "comment": "I don't believe this notation to be better than standard notation. Regardless, I'm upvoting, as interest towards alternative notations really needs to be fostered. For every iteration towards our current notation, there likely have been many asshats  denouncing it as futile, as it tried to fix what isn't broken. In other words, people really tried to argue that what they had then was perfect. How is that ever the case?"}, {"comment_id": "c9fbjmq", "post_id": "1cbyoy", "comment": "I really like how they have the \"helper part\" of the notes so you can easily tell what note it is, but It seems to make the actual score kind of useless.  \nI'd rather go about it the original way instead of learning a whole new system."}, {"comment_id": "c9f4rvv", "post_id": "1cbyoy", "comment": "You missed April 1st by 2 weeks."}, {"comment_id": "c9f531u", "post_id": "1cbyoy", "comment": "why fix something that isn't broken?\n"}, {"comment_id": "c9fpnfd", "post_id": "1cbyoy", "comment": "If you're going to indicate pitch with hieroglyphics, you may as well just write the letters-- you already use a stylized C to indicate a C. Why not just print the letters in Helvetica and eliminate the Adam West-like associative sequence? It's like you're selling me modernist octagonal training wheels when clearly the traditional round variety are in order. \n"}, {"comment_id": "c9fet6h", "post_id": "1cbyoy", "comment": "If there were no need to count lines as they say, why are they still placed on different lines on the staff? You still have to count. \n\nAlmost half of their critics are under 9 years old."}, {"comment_id": "c9f6a29", "post_id": "1cbyoy", "comment": "What the *hell* is this bullshit?"}, {"comment_id": "c9fmyau", "post_id": "1cbyoy", "comment": "see also...  http://www.reddit.com/r/musictheory/comments/1c5h2q/hummingbird_a_new_notiation_system/ "}, {"comment_id": "c1raehf", "post_id": "gypb5", "comment": "Cool little lesson. Too many newbie guitarists confuse vibrato with tremolo."}, {"comment_id": "c1remll", "post_id": "gypb5", "comment": "Nice, thanks for posting this."}, {"comment_id": "errl02y", "post_id": "c3a97u", "comment": "Good read"}, {"comment_id": "ec6c105", "post_id": "a7x2nh", "comment": "So i know almost nothing about music but my son is learning keyboard/piano and i always thought a chords root had to be the letter of the chord?\n\nhow come this book is teaching him this way?"}, {"comment_id": "ec6czyw", "post_id": "a7x2nh", "comment": "In addition to what everyone else is saying [here is a cool video](https://www.youtube.com/watch?v=BEWQNKbXHQk) where you can hear how \"normal\" chords sound in various covers of popular songs compared to how inversions sound.  \n\nThis video is aimed at guitar players but an inversion is an inversion.  It really helped something click in my mind. "}, {"comment_id": "ec6chx9", "post_id": "a7x2nh", "comment": "This is an inversion. Same notes, different order. Adds a little character to the chord. Not sure why its not in root position though."}, {"comment_id": "ec6f8ex", "post_id": "a7x2nh", "comment": "This chord's bass is G because the keyboard is small and starting on C would make the chord sound either too low or too high.  Start on the lower C in the picture and you can't go down; start on the higher C in the picture and you get in the way of the melody in the right hand.  Generally you *do* want the bass to be the root of the chord (though there are plenty of times when you don't), but this manual decided that it's better to put the chord in inversion.  Some keyboards actually have automatic chords, where if you play the notes of the chord, the keyboard recognizes which chord you're playing and fills in the instruments or changes the key of the backing.  In those keyboards, you don't actually hear the notes you're playing; playing the G, C, and E in the chord range of the keyboard simply tells the keyboard to put the backing in C major."}, {"comment_id": "ec6st3b", "post_id": "a7x2nh", "comment": "I don't play piano but keyboard and theres this thing called \"split point\", it's this border between chord and notes, and if you're playing normally you can change the order of a chord however you like, but if you play with a mode called \"fingered on bass\" on the order actually matters. And if you play C chord like G-C-E you get C/G which means C with a G on bass, and if you wanna play an actual C chord you need to play it with C-E-G. And basically if you need to play with fingered on bass on you need to grab a chord with it's lowest note being the name of the chord so:\n\nC: C-E-G\n\nG: G-B-D\n\nD: D-F#-A"}, {"comment_id": "ec6cref", "post_id": "a7x2nh", "comment": "It's a chord inversion.\n\nYour C Major chord is made of three notes:  The root (C); the 3rd (E); and the 5th (G).  The numbers refer to their positions in the C Major scale (C D E F G A B).\n\nThe one you have pictured is the second inversion, so it still contains the notes C, E & G but in a different order, with the 5th (G) in the bass.  The first inversion would have the 3rd (E) in the bass.\n\nI'm not sure why this book is choosing to show a C chord like this when I could just as easily show it with the root in the bass.  Either way, it's not wrong, it's just an inversion.\n\nChord inversions are used to give different sonic options to your chords, which will make your chord progressions more interesting.  Using inversions also helps with playing melody lines along with chords and [voice leading](https://en.wikipedia.org/wiki/Voice_leading).\n\nHope that helps :)"}, {"comment_id": "ec6t75i", "post_id": "a7x2nh", "comment": "Okay, so C is the root note because the triad (C-E-G) comprise the third and fifth harmony in the key of C, which melodically, is all the white keys on the keyboard. Any variation on the ordering of these notes still constitutes a C chord. \n\nC-E-G = root position.\nE-G-C= 1st inversion. \nG-C-E= 2nd inversion. \n\nWhen playing with accompaniment, these chords will generally (but not always)  be played while the keyboardist or bassist plays a C note on the low end. C is the root note because in the key of C it is the resolving note, aka the tonic. In other words, it is commonly that satisfying ending note in a song. "}, {"comment_id": "ec6v74c", "post_id": "a7x2nh", "comment": "It helps keep chord progressions together. \n\nSay your playing a I chord in C major and want to move to a V\n\nThe notes for I are C-E-G  and for V are G-B-D.\n\nYou could simply go from C to G as the bottom of the chord but it's a large leap and the D at the top ends up in another octave which may be too high for the desired affect. \n\nSo instead we invert the V to where D is on the bottom because it is right next to C. Now it goes from C E G. To. D G B.  The move from C to D will be smoother and sound more together, and the chords are all kept in a single octave. (So far)\n  \nHope this helps"}, {"comment_id": "ec6yye6", "post_id": "a7x2nh", "comment": "When you play  fingered chords, you must press all three keys down together, or the chord will not sound.  \n\nThere's not \"start\" to this chord, only the notes that make it up."}, {"comment_id": "czu6d0s", "post_id": "44yy90", "comment": "Yeah, this is exactly the same as e ery book I've ever read on playing an instrument. Nothing new here."}, {"comment_id": "cg75dhl", "post_id": "20vkfw", "comment": "Thank you for sharing, I'm considering buying a piano and getting back to playing and this looks very helpful"}, {"comment_id": "cg77z50", "post_id": "20vkfw", "comment": "So we download this directly from the amazon page?"}, {"comment_id": "cg79pul", "post_id": "20vkfw", "comment": "Cool! I've been looking match my terrible practical knowledge to my decent theory knowledge. "}, {"comment_id": "cg7aixe", "post_id": "20vkfw", "comment": "[Same book on Amazon.co.uk](http://www.amazon.co.uk/Scales-Chords-Arpeggios-Lessons-Elements-ebook/dp/B00HGB70WM/ref=sr_1_3?s=digital-text&ie=UTF8&qid=1395312514&sr=1-3&keywords=piano+scales) (still free).\n\nThanks OP."}, {"comment_id": "cg7diy5", "post_id": "20vkfw", "comment": "Cheers man, this is really helpful. "}, {"comment_id": "cg7jmox", "post_id": "20vkfw", "comment": "Great stuff, thank you! Laid out in a refreshingly concise style. Took all of two minutes to figure out where best to start based on my current skill level."}, {"comment_id": "cg7n52l", "post_id": "20vkfw", "comment": "awesome\n"}, {"comment_id": "cg7o4fv", "post_id": "20vkfw", "comment": "Oh this is amazing. I was actually looking at music theory and piano ebooks just last night. Thanks for this!"}, {"comment_id": "c80m4u7", "post_id": "16yon9", "comment": "This is my favorite thing I have ever seen"}, {"comment_id": "c80ppzs", "post_id": "16yon9", "comment": "Did I miss sol? WHY IS THERE NO SOL IN THIS MUSIC?\n\nBut seriously, great song! \\^_^"}, {"comment_id": "c1fwu1o", "post_id": "fh49d", "comment": "Modes are not exactly a basic concept, because a lot of people don't understand them at all.  Also, you are getting derped by a bunch of the members of /learnmusic/ who don't have a good understanding of modes right now.  It's hard to blame them, because it took me about 4 or 5 years before I properly understood them myself.  \n\nA mode is a set of pitches just like any other scale.  We can arrive at the most basic ones by using a different degree of the major scale as a root.    Each one has it's own specific character to it.  \n\nWhen referring to modes, C major is not the same as D dorian, because they aren't using the same root (among other reasons).  The best exercise I can recommend to familiarize yourself it to put on a drone (C for instance) and then play every parallel mode of C (C major, dorian, phrygian, lydian, mixolydian, aeolian, locrian.)\n\nI recommend playing them in order of Lydian, Ionian, Mixolydian, Dorian, Aeolian, Phrygian and finally Locrian.  Notice how only one pitch changes between each mode.  Each changed pitch is the \"characteristic tone\" of the mode, or what sets it apart from other modes.  When improvising over the drone, make sure your phrases emphasize the characteristic note, because otherwise it's extremely hard to establish what mode you are in.  \n\nModes do NOT have progressions.  It's impossible to progress in a mode because any sense of a dominant tonality will destroy modality.  Modes are better defined as a wash of harmony that moves between chords without ANY strong feel or need to resolve.  Until you have a very strong understanding of how modes function, it's best to just use them over pedals or vamps.\n\nIf you are looking for some distinctly modal music, I have a few recommendations.  \nDorian - \"So What\" by Miles Davis\n\nPhrygian - \"Meeting of the Spirits\" by Mahavishnu Orchestra (the first vamp in 6/8 establishes a strong phrygian feel)\n\nLydian - \"Jungle Fiction\" by John Scofield (Although he is toying with the listener by using two lydian modes a minor third apart)\n\nMixolydian - \"Don't Stop Till You Get Enough\" by Michael Jackson\n\n\nI only listed those modes because Ionian is the major scale, and Aeolian is minor.  Locrian is not used as a tonic mode.  It can be used as a chordscale for harmonization but there is no music written in locrian aside from experimental compositions, as it is a tonic diminished sound that will retonicize as soon as either minor or major tonality is introduced.\n"}, {"comment_id": "c1fwc73", "post_id": "fh49d", "comment": "When they say that you are starting on a different note, the mean that you don't change the pattern of whole and half steps that you have been using. So say you wanted to play in the phrygian mode on a keyboard, what you would do is start at E, and only play the white keys until you got to E again. It has a different feel from the standard mode because the order of the step sizes changes, each order having its own unique characteristics."}, {"comment_id": "c1fwej6", "post_id": "fh49d", "comment": "D dorian is not derived from the C major scale; it has the same key signature, but is not the same scale. The site you were looking at is a little confusing because it uses the term 'C Major' to mean both the key and the scale. Playing a C major scale from D to D doesn't make sense because that is a Dorian scale; playing from D to D in the **key** of C major is a much better way to say it. By the way, the major and minor scales are modes as well (Ionian and Aeolian, respectively), which may help you understand that you can't derive a Dorian mode from either a major or a minor key."}, {"comment_id": "c1fzdde", "post_id": "fh49d", "comment": "Some motherfucking kickass redditor taught me this:\r\n\r\n**I** **D**on't **P**articularly  **L**ike **M**odes **A** **L**ot.\r\n\r\nIonian Dorian Phrygian Lydian Mixolydian Aolian Locrain\r\n\r\nNot helpful for the sounds but helpful for remembering the damned names in order.  ; )"}, {"comment_id": "c1fwv3z", "post_id": "fh49d", "comment": "I like to think of modes as only things that work with melodies, not harmonies.  I've never heard of a chord progression in E dorian.  You usually just pick what key is closest and work from there.\n\nFor instance, you'd probably say that \"Eleanor Rigby\" by the Beatles is in the key of e minor, but with all of the C#s in the melody, it sounds dorian to me.\n\nThe whole thing about starting with a different root note is just a way to teach kids the whole/half steps in between the notes of the real scale.  Has nothing to do with the modes themselves, really.  But the fact they have a different tonic is key."}, {"comment_id": "c1fx074", "post_id": "fh49d", "comment": "Another way to think of the modes is to start with a major scale and just keep adding flats to the key signature. First you get C ionian, then mixolydian, then dorian, then aeolian, then phrygian, then locrian. If you go the other way by adding sharps you just get lydian and that's it. In general, the more flats a mode has the \"darker\" it sounds, the more sharps it has the \"brighter\" it sounds."}, {"comment_id": "c1fxala", "post_id": "fh49d", "comment": "someone else posted this before. I thought it was cool http://www.youtube.com/watch?v=JKbPIGnqt80"}, {"comment_id": "c1g1fws", "post_id": "fh49d", "comment": "The modes sound different because not only are you starting on a new scale degree as your root, the relationship between each degree changes... the pattern of half steps and whole steps is no longer the same \n\n- Starting on C\n(e.g. Major Key: whole, whole, half, whole, whole, whole, half) \n\n- Starting on D\n(e.g. Dorian Mode: whole, half, whole, whole, whole, half, whole.)\n\nIt creates a new tonic note, and also a completely different feel/characteristic."}, {"comment_id": "dnt0f5s", "post_id": "73n8p9", "comment": "Octaves in the melody are cool and can really elevate your melody. Also, fifths and fourths in the bass are also alright - it comes down to personal preference. "}, {"comment_id": "d52k5rh", "post_id": "4rd9iu", "comment": "This is frustrating because they don't seem to be eighth notes  at least not classical ones.\n\nYou cant play triplets over eighths like that in classical compositions and thats what i need to learn. \n\nIt would be nice to see the sheet music...."}, {"comment_id": "d4brz9q", "post_id": "4oe901", "comment": "First week's lesson is Minor and Major Seconds. Every week, I'll do two podcasts - One to introduce a new concept, one to drill on everything that has been learned. I've never done a podcast before, so feedback is greatly appreciated!"}, {"comment_id": "d4c9phn", "post_id": "4oe901", "comment": "This is awesome, thanks!"}, {"comment_id": "d4bxo4w", "post_id": "4oe901", "comment": "[Now on iTunes!](https://itunes.apple.com/us/podcast/the-mussar-method/id1125014418)"}, {"comment_id": "d4c7v1y", "post_id": "4oe901", "comment": "This is a cool idea. I'll try to check it out and leave feedback. Good luck dude"}, {"comment_id": "d4c901m", "post_id": "4oe901", "comment": "Very nice! "}, {"comment_id": "ckk4keq", "post_id": "2gki6w", "comment": "I thought this said Castlevania and I got really excited. "}, {"comment_id": "ckk1cr4", "post_id": "2gki6w", "comment": "very cool!"}, {"comment_id": "ckk4glx", "post_id": "2gki6w", "comment": "This is amazing! Great job man."}, {"comment_id": "ckk7zve", "post_id": "2gki6w", "comment": "[deleted]"}, {"comment_id": "ckkr39s", "post_id": "2gki6w", "comment": "That is *really* cool!"}, {"comment_id": "ckkvunu", "post_id": "2gki6w", "comment": "Why not use the same letters corresponding to notes:, e.g Type CEG instead of ADG. This will be a steep learning curve. e.g for DF#A now have to remember SF=H"}, {"comment_id": "cdcwrzi", "post_id": "1qhjws", "comment": "awesome. thank you."}, {"comment_id": "cbf6m6i", "post_id": "1jh0if", "comment": "Yes!"}, {"comment_id": "cbf9csv", "post_id": "1jh0if", "comment": "Thank you!"}, {"comment_id": "c3uankc", "post_id": "q1w53", "comment": "   Omit\n\nAll The Information!"}, {"comment_id": "c3u4hvr", "post_id": "q1w53", "comment": "Everything?"}, {"comment_id": "c3ui91a", "post_id": "q1w53", "comment": "This is not so good. "}, {"comment_id": "c4h5zs5", "post_id": "q1w53", "comment": "This isn't at all close to what I was expecting to see but it is somewhat inspiring. I wonder how many ways someone could represent basic harmonic structures visually."}]